[{"number":1,"episodes":[{"title":"Pilot: Part 1","summary":"\nForty-eight survivors of an airline flight originating from Australia, bound for the U.S., which crash-lands onto an unknown island 1000 miles off course, struggle to figure out a way to survive while trying to find a way to be rescued.    ","episodeNumber":0,"rating":9.2},{"title":"Pilot: Part 2","summary":"\nHaving retrieved the plane tranceiver, a group of survivors try to transmit a signal, only to receive a strange transmission from another inhabitant.    ","episodeNumber":0,"rating":9.1},{"title":"Tabula Rasa","summary":"\nJack and Hurley discover an alarming secret about Kate, while the marshal\u0027s life hangs in the balance.    ","episodeNumber":0,"rating":8.4},{"title":"Walkabout","summary":"\nWhen the survivors run out of food, Locke, Kate, and Michael go out hunting for boar. Michael gets injured, so he and Kate go back. But Locke stays out hunting, and ends up running into the creature living in the jungle.    ","episodeNumber":0,"rating":9.0},{"title":"White Rabbit","summary":"\nJack begins to experience visions of his dead father Christian. He runs into the jungle trying to find him, but things go wrong when he falls down a hill and off a cliff.    ","episodeNumber":0,"rating":8.3},{"title":"House of the Rising Sun","summary":"\nJin attacks Michael for seemingly no reason; Jack wants to move the survivors over to the caves, although some people disagree.    ","episodeNumber":0,"rating":8.1},{"title":"The Moth","summary":"\nCharlie begins a journey of withdrawal from drugs aided by Locke, whose true motive is a mystery. Jack is buried alive in a cave collapse.    ","episodeNumber":0,"rating":8.4},{"title":"Confidence Man","summary":"\nShannon is having an asthma attack, and Boone is sure that Sawyer has her medication. As Kate\u0027s way of dealing with this situation doesn\u0027t work, Sayid takes things into his own hands.    ","episodeNumber":0,"rating":8.6},{"title":"Solitary","summary":"\nSayid\u0027s life is in danger after finding the source of the French transmission, while Hurley hatches a ridiculous plan to make life more civilized.    ","episodeNumber":0,"rating":8.4},{"title":"Raised by Another","summary":"\nClaire has a horribly realistic nightmare about her baby being harmed, while flashbacks reveal her troubled past.    ","episodeNumber":0,"rating":8.6},{"title":"All the Best Cowboys Have Daddy Issues","summary":"\nJack, Kate, Locke and Boone go after Ethan, Claire and Charlie. They separate, and while Jack and Kate confront Ethan, Locke and Boon find another mystery at the jungle. Flashbacks reveal more about Jack\u0027s past with his dad.    ","episodeNumber":0,"rating":8.8},{"title":"Whatever the Case May Be","summary":"\nKate and Sawyer discover a briefcase and the race begins to win ownership of it. Charlie is still depressed over Claire, and is given a sharp talking to by Rose.    ","episodeNumber":0,"rating":7.9},{"title":"Hearts and Minds","summary":"\nWhen Locke learns that Boone wants to share their secret with Shannon, Locke plans to teach him a lesson.    ","episodeNumber":0,"rating":8.0},{"title":"Special","summary":"\nA mysterious island beast reappears when Michael and Locke clash. Sayid enlists Shannon to help decipher the French woman\u0027s map.    ","episodeNumber":0,"rating":8.1},{"title":"Homecoming","summary":"\nAfter Claire returns with no memory since the flight, Jack and Locke form a plan against her kidnapper, who threatens to kill the other survivors.    ","episodeNumber":0,"rating":8.3},{"title":"Outlaws","summary":"\nSawyer believes that a boar is harassing him. So he and Kate go to find it. They bond on the journey. They run into Locke, who tells them a story that seems to mean something to Sawyer.    ","episodeNumber":0,"rating":8.5},{"title":"...In Translation","summary":"\nWhen the raft the survivors have been building burns down, Michael accuses Jin of sabatoge. Sun makes a surprising revelation.    ","episodeNumber":0,"rating":8.4},{"title":"Numbers","summary":"\nWhen Hurley becomes obsessed with the French woman and heads into the jungle to find her, Jack, Sayid and Charlie have no choice but to follow. Meanwhile, Locke asks Claire to help build a mysterious item.    ","episodeNumber":0,"rating":9.0},{"title":"Deus Ex Machina","summary":"\nLocke thinks he knows how to get the hatch open, and he and Boone venture inland. Jack is reluctant to help Sawyer get glasses.    ","episodeNumber":0,"rating":9.0},{"title":"Do No Harm","summary":"\nClaire goes into labor while a helpless Charlie goes into panic mode. Meanwhile Locke is missing, Jack tends to a wounded Boone and Sayid presents Shannon with a romantic surprise.    ","episodeNumber":0,"rating":8.9},{"title":"The Greater Good","summary":"\nAfter burying one of their own, tempers flare as the castaways\u0027 suspicions of each other grow -- and an unlikely survivor vows revenge. Meanwhile, Claire and Charlie struggle to calm her newborn.    ","episodeNumber":0,"rating":8.2},{"title":"Born to Run","summary":"\nJack suspects foul play when Michael becomes violently ill while building the raft. Meanwhile a secret from Kate\u0027s past is revealed, the mysterious hatch is shown to a few of the survivors, and Walt gives Locke a warning.    ","episodeNumber":0,"rating":8.0},{"title":"Exodus: Part 1","summary":"\nThe French woman arrives at the camp with a dire warning about a group of survivors known as the Others.    ","episodeNumber":0,"rating":9.0},{"title":"Exodus: Part 2","summary":"\nThe castaways on the raft are surprised at sea by something unexpected. Meanwhile, remaining islanders attempt to blow open the hatch, and a visitor to the encampment might be a threat to Claire\u0027s infant son.    ","episodeNumber":0,"rating":9.2},{"title":"Exodus: Part 3","summary":"\nA visitor to the encampment could be a threat to Claire\u0027s son.    ","episodeNumber":0,"rating":9.3}]},{"number":2,"episodes":[{"title":"Man of Science, Man of Faith","summary":"\nOne of the castaways is chosen to descend into the mysterious hatch, and Shannon stumbles upon a shockingly familiar face in the jungle.    ","episodeNumber":0,"rating":9.1},{"title":"Adrift","summary":"\nMichael and Sawyer fight for their lives on the high seas and discover a new threat. Locke descends into the hatch to find a missing Kate.    ","episodeNumber":0,"rating":8.3},{"title":"Orientation","summary":"\nJack, Locke and Kate learn more secrets about the hatch. Meanwhile, after being beaten and taken captive, Sawyer, Michael and Jin wonder if their captors are fellow survivors or the dreaded \u0022Others.\u0022    ","episodeNumber":0,"rating":8.7},{"title":"Everybody Hates Hugo","summary":"\nHurley struggles with a task inside the hatch as he flashes back to disturbing memories. Sawyer and the others learn their captors\u0027 identities.    ","episodeNumber":0,"rating":8.2},{"title":"...And Found","summary":"\nMichael goes into the jungle to find Walt, but discovers he\u0027s not alone. Sawyer and Jin\u0027s captors demand to be taken to their camp.    ","episodeNumber":0,"rating":7.8},{"title":"Abandoned","summary":"\nSawyer\u0027s wound becomes life threatening as he, Michael and Jin make their way across the island with the tail section survivors.    ","episodeNumber":0,"rating":8.2},{"title":"The Other 48 Days","summary":"\nForty-eight days ago, the tail section of Flight 815 crashes. The survivors struggle to live when some other people on the island continue to kidnap some of them.    ","episodeNumber":0,"rating":8.8},{"title":"Collision","summary":"\nTempers flare when Ana Lucia and her group stumble upon Sayid and the other castaways.    ","episodeNumber":0,"rating":8.6},{"title":"What Kate Did","summary":"\nKate\u0027s original crime that started her life on the run is revealed. Meanwhile, the survivors lay one of their own to rest, Kate sleeplessly watches over a feverish Sawyer, and Mr. Eko has a surprise for Locke regarding the hatch.    ","episodeNumber":0,"rating":8.2},{"title":"The 23rd Psalm","summary":"\nClaire loses faith in Charlie after Eko questions him about the Virgin Mary statues.    ","episodeNumber":0,"rating":8.7},{"title":"The Hunting Party","summary":"\nJack, Locke and Sawyer follow Michael who left to look for his son. They meet \u0022the others\u0022. More is shown about Jack\u0027s back-story.    ","episodeNumber":0,"rating":8.4},{"title":"Fire \u002B Water","summary":"\nWhen Charlie\u0027s dreams lead him to believe Claire\u0027s baby\u0027s in peril, Locke suspects he may be using drugs again. Charlie\u0027s back story reveals a difficult relationship with his brother. Hurley\u0027s encouraged to act on his attraction to Libby.    ","episodeNumber":0,"rating":7.2},{"title":"The Long Con","summary":"\nSurvivors fear that \u0022The Others\u0022 may have returned when Sun is injured during a failed kidnapping attempt. Meanwhile, Sawyer is an amused, but highly interested, bystander when tension escalates between Jack, Locke, Kate and Ana Lucia over control of the hatch computer, and the storage of the weapons.    ","episodeNumber":0,"rating":8.6},{"title":"One of Them","summary":"\nThe mysterious French woman, Danielle Rousseau returns to lead Sayid to a mysterious captive who claims he crashed on the island. Meanwhile, Sawyer recruits Hurley to help him find another island animal that is harassing him: a loud tree frog.    ","episodeNumber":0,"rating":8.5},{"title":"Maternity Leave","summary":"\nWhen Claire\u0027s baby falls ill, she becomes determined to find out what happened to her to regain her memory during her captivity with the Others, triggering flashbacks to her experience among the Others, and her ordeals concerning her baby. Also, Mr. Eko learns about Henry Gale and asks Jack and Locke to give him a meeting with their captive.    ","episodeNumber":0,"rating":8.3},{"title":"The Whole Truth","summary":"\nWhen Sun comes to the realization that she might be pregnant, she struggles on whether to tell Jin about the situation. After no success from Jack or Sayid, Ana Lucia is called in by Locke to interrogate the prisoner, Henry Gale, to get more information out of him about how he arrived on the island. Ana Lucia, Sayid, and Charlie then set out into the jungle to try and confirm Henry\u0027s story.    ","episodeNumber":0,"rating":8.1},{"title":"Lockdown","summary":"\nWhen the hatch suddenly takes on a life of its own, Locke is trapped alone in the bunker and is forced to enlist the help of an unlikely ally: the captive Henry Gale to try to free him. Meanwhile, Jack faces off against Sawyer in a series of card games for supplies. Also, Ana Lucia, Sayid and Charlie find out the truth about Henry in the jungle.    ","episodeNumber":0,"rating":9.0},{"title":"Dave","summary":"\nHurley begins to think the island is affecting him in a very strange way, so Libby attempts to offer him support. Hurley also recalls his past in a mental hospital with his friend Dave. Meanwhile, the prisoner calling himself Henry Gale offers new information about the Hatch, which severely shakes Locke\u0027s sense of purpose.    ","episodeNumber":0,"rating":8.2},{"title":"S.O.S.","summary":"\nRose is opposed to Bernard\u0027s plan to create an SOS signal. Jack and Kate propose a trade with the Others.    ","episodeNumber":0,"rating":7.7},{"title":"Two for the Road","summary":"\nJack and Kate bring an exhausted Michael back to camp where he has news about \u0022The Others\u0022. Meanwhile, Ana Lucia attempts to get the prisoner, Henry Gale to confess to being a spy for the Others, and he attempts to kill her. Also, Hurley plans a surprise date for Libby.    ","episodeNumber":0,"rating":8.9},{"title":"?","summary":"\nMr. Eko enlists Locke to help find a secret location he believes houses answers to the island\u0027s mysteries. Meanwhile, Jack, Sawyer, and Kate struggle to cope with the horrific situation in the hatch following the escape of \u0022Other\u0022 Henry Gale, and of the shooting deaths of Ana-Lucia and Libby, unaware that it was Michael who is responsible.    ","episodeNumber":0,"rating":8.7},{"title":"Three Minutes","summary":"\nMichael\u0027s whereabouts during his 13 days in captivity in the \u0022Others\u0022 camp are detailed while in the present, he tries to convince Jack to help him mount a search party for his son Walt still being held captive. Meanwhile, Locke struggles with a choice whether or not to abandon the hatch.    ","episodeNumber":0,"rating":8.4},{"title":"Live Together, Die Alone: Part 1","summary":"\nAfter discovering a sailboat just offshore containing former hatch oversee Desmond, Jack and Sayid come up with a plan to confront \u0022The Others\u0022 and hopefully get Walt back. Meanwhile, Eko and Locke come to blows as Locke makes a potentially cataclysmic decision regarding the \u0022button\u0022 and the hatch.    ","episodeNumber":0,"rating":9.4},{"title":"Live Together, Die Alone: Part 2","summary":"\nJack and Sayid come up with a plan to confront \u0022The Others\u0022. Eko and Locke come to blows as Locke makes a potentially cataclysmic decision regarding the \u0022button\u0022 and the hatch.    ","episodeNumber":0,"rating":9.4}]},{"number":3,"episodes":[{"title":"A Tale of Two Cities","summary":"\nJack, Kate and Sawyer are kidnapped by the Others, who reveal themselves as more sophisticated and savvy than anyone guessed.    ","episodeNumber":0,"rating":8.6},{"title":"The Glass Ballerina","summary":"\nSayid\u0027s attempt to rescue Jack, Kate and Sawyer from the others jeopardizes Sun and Jin\u0027s lives.    ","episodeNumber":0,"rating":7.9},{"title":"Further Instructions","summary":"\nLocke experiences visions of Boone, leading him to a new mystery on the island.    ","episodeNumber":0,"rating":7.9},{"title":"Every Man for Himself","summary":"\nThe Others perform a sadistic medical procedure on Sawyer in order to prevent him from causing any more mischief.    ","episodeNumber":0,"rating":8.3},{"title":"The Cost of Living","summary":"\nAfter Mr. Eko has a vision of his dead brother, he sets out to return to the site of his plane crash.    ","episodeNumber":0,"rating":8.1},{"title":"I Do","summary":"\nKate desperately tries to protect Sawyer from being killed by The Others. But at the same time, The Others plan to use her as a pawn on Jack to get him to perform surgery on Ben.    ","episodeNumber":0,"rating":8.5},{"title":"Not in Portland","summary":"\nSawyer and Kate struggle to escape the island while Jack sabotages Ben\u0027s surgery, and Juliet\u0027s plan to make a deal with Jack to kill Ben on the operating table is exposed.    ","episodeNumber":0,"rating":8.6},{"title":"Flashes Before Your Eyes","summary":"\nAfter Desmond saves Claire from drowning, Charlie and Hurley suspect that he can see the future. So they try to get him drunk to get some answers out of him.    ","episodeNumber":0,"rating":9.1},{"title":"Stranger in a Strange Land","summary":"\nA power play ensues between Jack and Ben as Juliet\u0027s future lies in the balance. Kate and Sawyer deal with the consequences of their escape.    ","episodeNumber":0,"rating":7.2},{"title":"Tricia Tanaka Is Dead","summary":"\nHaving returned to camp, Sawyer\u0027s help is enlisted by Hugo, who has an obsession with retrieving an old VW van found on the island. More events in Hugo\u0027s life are also revealed, showing what brought him to be on the doomed flight.    ","episodeNumber":0,"rating":8.2},{"title":"Enter 77","summary":"\nSayid, John and Kate find another Dharma station on their way to rescue Jack. In the meantime Sawyer tries to get his stuff back in the camp.    ","episodeNumber":0,"rating":8.5},{"title":"Par Avion","summary":"\nClaire launches a plan to use migratory birds to send a message, but she doesn\u0027t understand why Desmond keeps sabotaging it. Elsewhere on the island, Sayid, Locke and Kate scale The Others\u0027 protective perimeter and discover their camp.    ","episodeNumber":0,"rating":8.2},{"title":"The Man from Tallahassee","summary":"\nJack tells Kate that he has made a deal with The Others; Locke hinders Jack\u0027s plan to leave the island    ","episodeNumber":0,"rating":9.1},{"title":"Exposé","summary":"\nNikki and Paulo are two more of the castaways with a past just like any of the others. What have they been doing since the plane crash?    ","episodeNumber":0,"rating":8.0},{"title":"Left Behind","summary":"\nWith their secret location now compromised, The Others abandon camp and take Locke with them. But they also leave Juliet behind, handcuffed to Kate in the middle of the jungle.    ","episodeNumber":0,"rating":8.1},{"title":"One of Us","summary":"\nJack takes Juliet back to their camp after being abandoned by The Others. However, nobody else at the camp trusts her or wants her there, until she saves Claire\u0027s life.    ","episodeNumber":0,"rating":8.6},{"title":"Catch-22","summary":"\nAfter Desmond has another vision, he convinces Hurley, Jin, and Charlie to follow him into the jungle.    ","episodeNumber":0,"rating":8.3},{"title":"D.O.C.","summary":"\nAn unlikely person helps Desmond save the life of the mysterious woman who crashed onto the island, and Juliet helps Sun find out whether she conceived on the island or before the plane crash.    ","episodeNumber":0,"rating":8.1},{"title":"The Brig","summary":"\nLocke tells Sawyer that he needs to come with him to kill Ben. But the man Locke wants him to kill is actually his father--who also happens to be a figure from Sawyer\u0027s past.    ","episodeNumber":0,"rating":9.0},{"title":"The Man Behind the Curtain","summary":"\nAs Ben takes Locke to see Jacob and reveal the island\u0027s secrets, Ben\u0027s background on the island is exposed--as well as what happened to the Dharma Initiative.    ","episodeNumber":0,"rating":9.2},{"title":"Greatest Hits","summary":"\nDesmond has another vision of Charlie\u0027s death, but this time his death ultimately will result in Claire\u0027s rescue. Meanwhile, the survivors discover that an attack by the others is even more imminent than originally expected.    ","episodeNumber":0,"rating":9.1},{"title":"Through the Looking Glass: Part 1","summary":"\nJack and the survivors wait for Charlie to turn off The Others\u0027 signal-jamming device, not knowing that he has been captured at the Looking Glass station. In addition, Sayid, Jin and Bernard are captured after The Others invade the camp.    ","episodeNumber":0,"rating":9.7},{"title":"Through the Looking Glass: Part 2","summary":"\nOn the island, Jack and the survivors come closer to finding rescue. In the flashback, Jack is shown in Los Angeles, living though a meaningless existence as a drunkard.    ","episodeNumber":0,"rating":9.8}]},{"number":4,"episodes":[{"title":"The Beginning of the End","summary":"\nCharlie\u0027s dying message casts doubt on the intentions of the people that Jack believes to be their rescuers. A power struggle ensues between Jack, who wants to leave the island, and Locke, who thinks that they\u0027re supposed to stay.    ","episodeNumber":0,"rating":8.7},{"title":"Confirmed Dead","summary":"\nThe surviving members of the supposed \u0022rescue team\u0022 are scattered around the island after a helicopter problem. However, once they are located, they reluctantly reveal that they are indeed not there to rescue them.    ","episodeNumber":0,"rating":8.6},{"title":"The Economist","summary":"\nSayid negotiates a deal with Locke to hand over Charlotte from the \u0022rescue team,\u0022 so that he can get on their helicopter and reach their ship. Kate joins Sayid for the mission, but she decides to stay behind with Sawyer.    ","episodeNumber":0,"rating":8.4},{"title":"Eggtown","summary":"\nKate goes behind Locke\u0027s back to arrange a meeting between Miles and Ben, where Miles offers his terms for not giving Ben up to his colleagues. However, Locke discovers what she has done, and banishes her from his camp.    ","episodeNumber":0,"rating":8.0},{"title":"The Constant","summary":"\nDuring the helicopter ride to the ship, Desmond\u0027s consciousness begins jumping back and forth between present day 2004 and 1996. He is forced to find Daniel Faraday in 1996 in order to get answers and stop the jumps.    ","episodeNumber":0,"rating":9.7},{"title":"The Other Woman","summary":"\nDaniel and Charlotte leave Jack\u0027s camp to fulfill their objective, and Jack and Juliet try to track them down before they are successful. Juliet\u0027s romantic history on the island with The Others is exposed.    ","episodeNumber":0,"rating":7.8},{"title":"Ji Yeon","summary":"\nJuliet exposes Sun\u0027s pre-island affair to Jin so that they won\u0027t defect to Locke\u0027s camp. Sayid and Desmond meet the ship\u0027s captain and discover who is working on the boat.    ","episodeNumber":0,"rating":8.3},{"title":"Meet Kevin Johnson","summary":"\nMichael\u0027s journey from escaping the island to working as Ben\u0027s spy on Widmore\u0027s ship is revealed, as well as his mission. Ben tells Danielle and Alex to leave Locke\u0027s camp and go to the island temple, but they are ambushed on the way.    ","episodeNumber":0,"rating":8.3},{"title":"The Shape of Things to Come","summary":"\nThe team from the ship attacks Locke\u0027s camp looking for Ben, with Alex as a hostage. Meanwhile, the doctor from the ship washes up on shore at Jack\u0027s camp, and Daniel Faraday provides some distressing news to Jack.    ","episodeNumber":0,"rating":9.0},{"title":"Something Nice Back Home","summary":"\nJuliet is forced to perform an emergency appendectomy on Jack, Jack\u0027s post-rescue relationship with Kate is revealed, and Sawyer, Claire, and Aaron head back to Jack\u0027s camp with Miles.    ","episodeNumber":0,"rating":7.9},{"title":"Cabin Fever","summary":"\nLocke, Ben, and Hurley continue their search for the cabin so that Locke can talk to Jacob. Back on the boat, Keamy prepares to take off again, this time for an all-out assault on the island.    ","episodeNumber":0,"rating":8.5},{"title":"There\u0027s No Place Like Home: Part 1","summary":"\nBen, Locke, and Hurley go to The Orchid, but Keamy and his men beat them there. Jack and Kate go after the helicopter, and are later joined by Sawyer. Sayid comes back to the island with a rescue boat, and then goes after them too.    ","episodeNumber":0,"rating":8.9},{"title":"There\u0027s No Place Like Home: Part 2","summary":"\nBen tries to escape Keamy\u0027s custody so that he and Locke can follow through with Jacob\u0027s request to move the island. Michael tries to neutralize the explosives on the boat, while the \u0022Oceanic 6\u0022 move closer to rescue.    ","episodeNumber":0,"rating":9.2},{"title":"There\u0027s No Place Like Home: Part 3","summary":"\nIn the season finale, the Oceanic Six find themselves closer to rescue.    ","episodeNumber":0,"rating":9.2}]},{"number":5,"episodes":[{"title":"Because You Left","summary":"\nAs a result of Ben moving the island, the survivors left on the island begin skipping through time. Meanwhile, three years later in Los Angeles, Ben starts convincing the Oceanic 6 to return to the island.    ","episodeNumber":0,"rating":8.7},{"title":"The Lie","summary":"\nWhile Ben and Jack try to round the Oceanic 6 up, Sayid and Hurley are on the run from the law. Meanwhile, back on the island, the survivors, still skipping through time, come under attack.    ","episodeNumber":0,"rating":8.1},{"title":"Jughead","summary":"\nDesmond returns to Oxford to fulfill Faraday\u0027s request to find his mother. Back on the island, the survivors discover that they\u0027ve run into The Others 50 years in the past, but Richard Alpert is the same age.    ","episodeNumber":0,"rating":8.5},{"title":"The Little Prince","summary":"\nIn Los Angeles, Kate tries to find out who is trying to take Aaron away from her. Back on the island, Locke convinces everyone that they have to go to The Orchid.    ","episodeNumber":0,"rating":8.2},{"title":"This Place Is Death","summary":"\nIn order to avoid being killed, Ben promises to offer proof to Sun that Jin is still alive. On the island, Jin meets up with the survivors as Locke reaches The Orchid and fulfills his mission.    ","episodeNumber":0,"rating":8.6},{"title":"316","summary":"\nEloise explains that the Oceanic 6 have a very limited window to return to the island, and leaves Jack instructions to bring one of his father\u0027s items to John Locke.    ","episodeNumber":0,"rating":8.5},{"title":"The Life and Death of Jeremy Bentham","summary":"\nJohn Locke, now alive again and back on the island after the second plane crash, flashes back to his return to civilization, where he is brought in by Charles Widmore and asked to convince the Oceanic 6 to return to the island.    ","episodeNumber":0,"rating":8.8},{"title":"LaFleur","summary":"\nThe survivors left on the island, now led by Sawyer after Locke\u0027s departure, find themselves back in the 1970s, where they are now forced to become members of the Dharma Initiative.    ","episodeNumber":0,"rating":8.9},{"title":"Namaste","summary":"\nJack, Kate and Hurley wind up on the island in 1977, where they meet up with Sawyer and also join the Dharma Initiative. Meanwhile, Sun is stuck on the island in the present with Ben and the other passengers after the plane crash.    ","episodeNumber":0,"rating":8.4},{"title":"He\u0027s Our You","summary":"\nSayid is held as a prisoner by the Dharma Initiative, presumed to be a Hostile. However, during his capture, he believes he has discovered the reason why he\u0027s back on the island.    ","episodeNumber":0,"rating":8.4},{"title":"Whatever Happened, Happened","summary":"\nJack refuses to help save young Ben after Sayid shoots him, so Sawyer and Kate turn to Richard Alpert for help. Meanwhile, what Sawyer said to Kate on the chopper is revealed, as well as what Kate did with Aaron before the flight.    ","episodeNumber":0,"rating":8.2},{"title":"Dead Is Dead","summary":"\nBen and Locke return to the island, where Ben says he is going to summon the Smoke \u0022monster\u0022 and atone for his daughter\u0027s death. In addition, the falling-out on the island between Ben and Charles Widmore is revealed.    ","episodeNumber":0,"rating":8.7},{"title":"Some Like It Hoth","summary":"\nMiles is chosen by Horace to transport a dead body across the island. During the trip, Miles reveals to Hurley that Dr. Pierre Chang (a.k.a. Dr. Marvin Candle) is his father, whom he resents for leaving him and his mother.    ","episodeNumber":0,"rating":8.2},{"title":"The Variable","summary":"\nFaraday returns to the island and tells Jack that his mother, Eloise Hawking, lied to them--they don\u0027t belong on the island. He then initiates a dangerous plan to get them back home.    ","episodeNumber":0,"rating":8.7},{"title":"Follow the Leader","summary":"\nJack attempts to follow through with Daniel Faraday\u0027s plan to detonate the hydrogen bomb after Faraday is killed, Locke instructs Alpert to take him to Jacob, and Sawyer is interrogated about an incriminating surveillance video.    ","episodeNumber":0,"rating":8.6},{"title":"The Incident: Part 1","summary":"\nJack and Sayid\u0027s plan faces resistance from Sawyer, Juliet, and Kate. Ben and The Others/Hostiles reach Jacob at the Foot of the Statue, and are soon met by the 316 survivors, who reveal the contents of their mysterious package.    ","episodeNumber":0,"rating":9.1},{"title":"The Incident: Part 2","summary":"\nAt the site of the Taweret statue remains, Locke assigns Ben a difficult task that involves Jacob\u0027s fate.    ","episodeNumber":0,"rating":9.2}]},{"number":6,"episodes":[{"title":"LA X: Part 1","summary":"\nFlight 815 is shown successfully landing in Los Angeles with no crash on the island, but the survivors are simultaneously shown still on the island after Juliet detonates the bomb.    ","episodeNumber":0,"rating":8.7},{"title":"LA X: Part 2","summary":"\nThe man impersonating John Locke reveals his true intentions.    ","episodeNumber":0,"rating":8.4},{"title":"What Kate Does","summary":"\nSayid miraculously comes back to life, but his problems have only just begun. Sawyer escapes, and Kate and Jin go after him. Back in Los Angeles, fugitive Kate helps Claire as she goes into labor.    ","episodeNumber":0,"rating":7.6},{"title":"The Substitute","summary":"\nOn the island, the being now occupying Locke\u0027s body turns to Sawyer and promises to tell him why he\u0027s on the island. Back in Los Angeles, Locke loses his job and encounters a number of familiar faces.    ","episodeNumber":0,"rating":8.2},{"title":"Lighthouse","summary":"\nJacob sends Hurley on a mission across the island, but Jack must accompany him. In Los Angeles, Jack\u0027s difficult relationship with his son is revealed. Meanwhile, Jin discovers that Claire thinks the people at the temple stole her son.    ","episodeNumber":0,"rating":8.0},{"title":"Sundown","summary":"\nClaire arrives at the temple and warns the inhabitants that the being inhabiting Locke wants to talk, but Dogen sends Sayid to kill him instead. In Los Angeles, Sayid saves his brother, who is in trouble with a loan shark.    ","episodeNumber":0,"rating":8.0},{"title":"Dr. Linus","summary":"\nIlana prepares to kill Ben after Miles reveals that Ben killed Jacob. In Los Angeles, Ben contemplates a power play at his high school. Meanwhile Richard and Jack share their secrets and experiences with Jacob and form an alliance.    ","episodeNumber":0,"rating":8.4},{"title":"Recon","summary":"\nLocke sends Sawyer on a recon mission to the other island, where he runs into Charles Widmore and his submarine crew. In Los Angeles, Sawyer works as a police officer obsessed with finding the conman who destroyed his family.    ","episodeNumber":0,"rating":7.7},{"title":"Ab Aeterno","summary":"\nThe mysteries behind Richard Alpert\u0027s arrival to the island, his immortality, and his alliance with Jacob are revealed--plus more details about the purpose of the island and the relationship between Jacob and the smoke monster.    ","episodeNumber":0,"rating":9.2},{"title":"The Package","summary":"\nSun and Jin\u0027s search for each other is interrupted when Widmore\u0027s crew kidnaps Jin, and Locke heads to the other island to bring him back. In Los Angeles, Jin\u0027s job for Sun\u0027s father is sidetracked when his money is taken at customs.    ","episodeNumber":0,"rating":7.7},{"title":"Happily Ever After","summary":"\nCharles Widmore brings Desmond back to the island so that he can conduct a dangerous electromagnetic experiment, which sends him back to the alternate reality in Los Angeles, a reality where he has never met Penny.    ","episodeNumber":0,"rating":8.8},{"title":"Everybody Loves Hugo","summary":"\nMichael appears to Hurley and gives him a new mission, and Sayid captures Desmond and sends him to Locke. In Los Angeles, Desmond sets up a meeting between Libby and Hurley to further his assignment.    ","episodeNumber":0,"rating":8.4},{"title":"The Last Recruit","summary":"\nAs the battle between Locke and Widmore commences, Sawyer launches his plan to change allegiances. Back in Los Angeles, fate continues to intervene and bring the original survivors together.    ","episodeNumber":0,"rating":8.1},{"title":"The Candidate","summary":"\nWith Jack\u0027s help, Locke rescues the candidates from Widmore\u0027s compound, but their plans for leaving the island are forced to change. In Los Angeles, Jack tries to convince Locke to try an experimental surgery for his paralysis.    ","episodeNumber":0,"rating":8.9},{"title":"Across the Sea","summary":"\nThe story of how Jacob and his brother came to the island, their uneasy relationship with their \u0022mother,\u0022 their eventual falling-out, and revelation of what Jacob was on the island to protect.    ","episodeNumber":0,"rating":8.2},{"title":"What They Died For","summary":"\nJacob appears to the survivors of the submarine explosion and tells them what they were chosen for, while Ben joins forces with Locke as they both have a final showdown with Charles Widmore.    ","episodeNumber":0,"rating":8.6},{"title":"The End: Part 1","summary":"\nLocke searches for Desmond to achieve his goal of destroying the island. Jack, the newly-appointed \u0022protector\u0022 of the island, sets out to stop him. In Los Angeles, the survivors slowly reunite and recall their island experiences.    ","episodeNumber":0,"rating":8.2},{"title":"The End: Part 2","summary":"\nLocke puts his plan into action, which could liberate him from the island.    ","episodeNumber":0,"rating":9.0}]}]