[{"number":1,"episodes":[{"title":"Space Pilot 3000","summary":"\nA down-on-his-luck pizza delivery guy is accidentally frozen on New Year\u0027s Eve 1999, and wakes up in 2999.    ","episodeNumber":0,"rating":8.6},{"title":"The Series Has Landed","summary":"\nFor the crew\u0027s first mission, they must make a delivery to the moon, which is now home to a cheesy amusement park.    ","episodeNumber":0,"rating":8.0},{"title":"I, Roommate","summary":"\nFry is forced to choose between friendship and television when Bender\u0027s antenna impairs TV reception at their stylish new apartment building.    ","episodeNumber":0,"rating":8.2},{"title":"Love\u0027s Labours Lost in Space","summary":"\nWhile on a mission to save animals from a doomed planet, Leela finds herself the object of a starship captain\u0027s amorous advances.    ","episodeNumber":0,"rating":8.1},{"title":"Fear of a Bot Planet","summary":"\nFry and Leela disguise themselves as robots to find Bender after he fails to return from a delivery to a robot planet, only to learn that he has become a celebrity in a culture which fears humans.    ","episodeNumber":0,"rating":7.8},{"title":"A Fishful of Dollars","summary":"\nFry discovers his bank account interest has made him a billionaire and buys the one thing the year 3000 doesn\u0027t have: anchovies.    ","episodeNumber":0,"rating":8.2},{"title":"My Three Suns","summary":"\nDelivery Boy Philip J. Fry is promoted to Emperor after accidentally drinking his fluid-based predecessor.    ","episodeNumber":0,"rating":7.8},{"title":"A Big Piece of Garbage","summary":"\nWhen a big ball of garbage from the 20th Century returns to threaten New New York, Philip is the only expert on making the weapon to fight it.    ","episodeNumber":0,"rating":8.0},{"title":"Hell Is Other Robots","summary":"\nBender joins a robot church after fighting an addiction to electricity, but reverts to his pre-addictive behavior of cigars, booze and robot hookers, leading to a musical confrontation with the Robot Devil.    ","episodeNumber":0,"rating":8.0}]},{"number":2,"episodes":[{"title":"A Flight to Remember","summary":"\nThe crew takes a vacation cruise on the maiden voyage of the new space Titanic.    ","episodeNumber":0,"rating":8.2},{"title":"Mars University","summary":"\nFry matriculates at Mars University and competes with a monkey made smart by Prof. Farnsworth\u0027s latest invention while Bender tries to make the local chapter of his robot fraternity cool.    ","episodeNumber":0,"rating":7.7},{"title":"When Aliens Attack","summary":"\nA monumental attack from Lrrr of Omicron Persei 8 is precipitated by the loss of a television signal that Fry disrupted in 1999.    ","episodeNumber":0,"rating":8.0},{"title":"Fry and the Slurm Factory","summary":"\nFry wins a contest to visit the factory of his favorite addictive drink, but danger ensues when he accidentally discovers the real factory.    ","episodeNumber":0,"rating":8.3},{"title":"I Second That Emotion","summary":"\nBender flushes Nibbler down the toilet in a fit of jealousy, which prompts Professor Farnsworth to implant in him a chip that will allow him to feel empathy.    ","episodeNumber":0,"rating":7.7},{"title":"Brannigan, Begin Again","summary":"\nZapp Brannigan gets thrown out of the service for destroying a space meeting and as a result of this he begins to work for Planet Express.    ","episodeNumber":0,"rating":7.9},{"title":"A Head in the Polls","summary":"\nWhen a mine disaster causes the market value of titanium to soar, Bender becomes highly profitable and sells his body.    ","episodeNumber":0,"rating":7.7},{"title":"Xmas Story","summary":"\nFry learns how Christmas has changed and remained the same over the last 1000 years when a Robot Santa terrorizes New New York.    ","episodeNumber":0,"rating":8.1},{"title":"Why Must I Be a Crustacean in Love?","summary":"\nWhen the group begins to notice that Zoidberg is acting erratically, Professor Farnsworth deduces that it is mating season on his home planet.    ","episodeNumber":0,"rating":8.0},{"title":"Put Your Head on My Shoulders","summary":"\nAfter a horrendous accident requires his body to be rebuilt, Fry\u0027s head is attached to the shoulder of a co-worker while Bender opens a dating service just in time for Valentine\u0027s Day.    ","episodeNumber":0,"rating":7.5},{"title":"The Lesser of Two Evils","summary":"\nSuspicion falls on a new employee when a shipment goes missing.    ","episodeNumber":0,"rating":7.5},{"title":"Raging Bender","summary":"\nBender becomes a champion robot wrestler.    ","episodeNumber":0,"rating":7.6},{"title":"A Bicyclops Built for Two","summary":"\nAfter learning that there is a second Cyclops still in existence, Leela travels back to her home World to ensure that her species does not go extinct.    ","episodeNumber":0,"rating":8.0},{"title":"How Hermes Requisitioned His Groove Back","summary":"\nThe Bureaucracy loves Hermes less while loving Fry loads more.    ","episodeNumber":0,"rating":8.0},{"title":"A Clone of My Own","summary":"\nProf. Farnsworth reveals that he cloned himself years ago and introduces his clone to the Planet Express staff.    ","episodeNumber":0,"rating":7.5},{"title":"The Deep South","summary":"\nWhile stranded at the bottom of the Atlantic Ocean with the rest of the Planet Express crew, Fry meets a mermaid and quickly falls in love.    ","episodeNumber":0,"rating":7.8},{"title":"Bender Gets Made","summary":"\nBender gets inducted into the Robot mafia but has a crisis of conscience when their next score involves his friends on the Planet Express ship.    ","episodeNumber":0,"rating":7.6},{"title":"The Problem with Popplers","summary":"\nThe Planet Express crew discovers a delicious snack food on a remote planet, but Leela has a change of heart when she discovers a disturbing fact about the snack food that endangers Earth.    ","episodeNumber":0,"rating":8.5},{"title":"Mother\u0027s Day","summary":"\nWhen Mom of Mom\u0027s Robot Factory takes control of every robot on Earth, the only man who can save the planet is Prof. Farnsworth.    ","episodeNumber":0,"rating":7.8},{"title":"Anthology of Interest I","summary":"\nThe Professor\u0027s \u0022What If\u0022 machine answers 4 questions.    ","episodeNumber":0,"rating":8.5}]},{"number":3,"episodes":[{"title":"The Honking","summary":"\nWhen the inheritance Bender claims in the Old Country isn\u0027t quite what he expected, the Planet Express crew has to find the source of an age-old curse.    ","episodeNumber":0,"rating":7.5},{"title":"War Is the H-Word","summary":"\nFry and Bender enroll in the Army to receive military discounts, but a war breaks out and the two friends are forced to serve on the front lines.    ","episodeNumber":0,"rating":8.4},{"title":"The Cryonic Woman","summary":"\nFry discovers his 20th-century girlfriend at the cryogenics lab, but problems arise when she wants them both to be refrozen for another 1,000 years.    ","episodeNumber":0,"rating":7.4},{"title":"Parasites Lost","summary":"\nIngesting a bad egg-salad sandwich leads to Fry developing a colony of parasitic worms in his bowels, which set out to make him smarter and stronger.    ","episodeNumber":0,"rating":8.9},{"title":"Amazon Women in the Mood","summary":"\nGigantic feminist Amazons give Fry, Kif, and Zap a grueling workout.    ","episodeNumber":0,"rating":8.6},{"title":"Bendless Love","summary":"\nA sleep-walking Bender creates havoc with his uncontrollable bending and is sent to the Bending Factory where he meets Angelyne, a curvaceous fembot.    ","episodeNumber":0,"rating":7.2},{"title":"The Day the Earth Stood Stupid","summary":"\nWhen flying brains invade, Fry is the only one who can save the Earth from destruction.    ","episodeNumber":0,"rating":8.5},{"title":"That\u0027s Lobstertainment!","summary":"\nThe Planet Express staff is amazed to learn that Dr. Zoidberg is related to a famous comedian. Bender convinces a robot soap opera star to finance a movie in the hopes of getting an acting award.    ","episodeNumber":0,"rating":7.1},{"title":"The Birdbot of Ice-Catraz","summary":"\nThe professor decides to ship hazardous cargo to the outer reaches of space, but the ship travels through some environmentally sensitive areas, including the penguin refuge on Pluto.    ","episodeNumber":0,"rating":7.5},{"title":"The Luck of the Fryrish","summary":"\nFry goes on a quest to recover his lucky 7-leaf clover after being convinced that his brother took over his identity after he was frozen.    ","episodeNumber":0,"rating":9.4},{"title":"The Cyber House Rules","summary":"\nLeela returns to the Orphanarium and she meets with her friend Adlai Atkins after some years, and they begin to go out. Adlai is a surgeon and operates Leela to let her have two eyes, and Bender decides to adopt all the children at the Orphanarium to get money from the Government.    ","episodeNumber":0,"rating":7.7},{"title":"Insane in the Mainframe","summary":"\nFry and Bender are mistakenly convicted of robbing a bank and are both sent to a robot mental institution.    ","episodeNumber":0,"rating":8.1},{"title":"Bendin\u0027 in the Wind","summary":"\nAfter being crippled, Bender gets a new career as a folk rock singer. Fry, Leela, Amy and Dr. Zoidberg follow him around the country.    ","episodeNumber":0,"rating":7.3},{"title":"Time Keeps on Slipping","summary":"\nAfter being challenged to a game of basketball by the planet of the Globetrotters, Prof. Farnsworth creates a team of mutant, atomic supermen, but the side effects of their rapid growth endangers the universe.    ","episodeNumber":0,"rating":8.3},{"title":"I Dated a Robot","summary":"\nFry ignores the warnings of the Planet Express staff and starts dating a robot with the downloaded personality and holographic image of Lucy Liu. Leela and Bender make a disturbing discovery while trying to save Fry from his short-sighted decision.    ","episodeNumber":0,"rating":7.6}]},{"number":4,"episodes":[{"title":"Roswell That Ends Well","summary":"\nFry causes trouble for himself and the rest of the crew when he accidentally causes them all to be transported back in time to Roswell, New Mexico in 1947.    ","episodeNumber":0,"rating":9.1},{"title":"A Tale of Two Santas","summary":"\nWhen Fry, Leela and Bender make a delivery to Neptune, they run afoul of the robot Santa Claus. Bender takes his place, but the previous Santa\u0027s fearsome reputation makes his job difficult.    ","episodeNumber":0,"rating":7.7},{"title":"Anthology of Interest II","summary":"\nAn anthology of three \u0022what if\u0022 stories: what if Bender was human, what if life was more like a video game, and what if Leela found her true home.    ","episodeNumber":0,"rating":8.2},{"title":"Love and Rocket","summary":"\nWhen the Planet Express ship gets a selectable personality upgrade, Bender chooses one and falls in love... but too briefly.    ","episodeNumber":0,"rating":7.7},{"title":"Leela\u0027s Homeworld","summary":"\nThe Planet Express crew must suffer the wrath of the mutants who live under the city after disposing too much toxic waste into the sewers.    ","episodeNumber":0,"rating":8.6},{"title":"Where the Buggalo Roam","summary":"\nIntern Amy Wong\u0027s rich parents host the annual Mars Day picnic, but the original Martians have different plans, so Lieutenant Kif Kroker comes to the rescue.    ","episodeNumber":0,"rating":7.5},{"title":"A Pharaoh to Remember","summary":"\nBender worries that no one will remember him when he dies, but he encounters a chance to leave a legacy when he discovers a planet in need of a new pharaoh.    ","episodeNumber":0,"rating":7.6},{"title":"Godfellas","summary":"\nWhen Bender is lost in space, he becomes home and spiritual leader to a race of worshipers who misinterpret his wisdom.    ","episodeNumber":0,"rating":8.8},{"title":"Future Stock","summary":"\nFry bonds with a revived 1980s guy who takes over Planet Express and takes on Mom\u0027s Delivery Company, but has a crisis of conscience when his new mentor plans to sell the company.    ","episodeNumber":0,"rating":7.7},{"title":"A Leela of Her Own","summary":"\nA pickup game with the family-owned pizza place across the street leads to Leela being the first female Blernsball player, but she has to struggle to avoid being the worst player ever.    ","episodeNumber":0,"rating":7.0},{"title":"The 30% Iron Chef","summary":"\nBender goes on a quest to learn the secret of Ultimate Flavor so he can humiliate his former idol on television.    ","episodeNumber":0,"rating":7.6},{"title":"Where No Fan Has Gone Before","summary":"\nFry is placed on trial for his life because he traveled to the forbidden planet of Omega 3 to rescue all 79 episodes of \u0022Star Trek\u0022.    ","episodeNumber":0,"rating":8.2}]},{"number":5,"episodes":[{"title":"Crimes of the Hot","summary":"\nEarth is unable to offset its rising temperature through the usual process, which is the dropping of a giant ice cube into the ocean.    ","episodeNumber":0,"rating":7.9},{"title":"Jurassic Bark","summary":"\nFry discovers the intact fossilized remains of his pet dog from his old life. The Professor reveals he can clone the animal.    ","episodeNumber":0,"rating":9.5},{"title":"The Route of All Evil","summary":"\nProf. Farnsworth\u0027s and Hermes\u0027 12 year old sons combine forces to take over Planet Express, but their ambition is more than their ability and they need their fathers\u0027 help to save the day.    ","episodeNumber":0,"rating":7.3},{"title":"A Taste of Freedom","summary":"\nDr. Zoidberg\u0027s exuberant celebration of Freedom Day makes him Public Enemy #1.    ","episodeNumber":0,"rating":7.8},{"title":"Kif Gets Knocked Up a Notch","summary":"\nAmy is distressed when her alien boyfriend Kif becomes pregnant.    ","episodeNumber":0,"rating":7.5},{"title":"Less Than Hero","summary":"\nAfter using a tube of \u0022miracle cream\u0022 Fry and Leela gain super powers and form \u0022The New Justice Team\u0022 along with Bender.    ","episodeNumber":0,"rating":7.7},{"title":"Teenage Mutant Leela\u0027s Hurdles","summary":"\nAfter an overdose at a health club makes the Planet Express staff get younger and younger, they have to find a mysterious Fountain of Aging. Meanwhile, Leela experiences the teenage life she never had with her parents.    ","episodeNumber":0,"rating":8.3},{"title":"The Why of Fry","summary":"\nFry learns that his accidental freezing 1004 years earlier wasn\u0027t an accident and he is given a choice that could prevent its happening, but at a cost.    ","episodeNumber":0,"rating":8.7},{"title":"The Sting","summary":"\nSent on the same mission which caused the deaths of the previous Planet Express crew, Leela mourns the apparent death of Fry.    ","episodeNumber":0,"rating":9.1},{"title":"The Farnsworth Parabox","summary":"\nProf. Farnworth creates a box which contains an entire universe and sends Leela into it, where she discovers another Planet Express with a few notable differences.    ","episodeNumber":0,"rating":8.9},{"title":"Three Hundred Big Boys","summary":"\nEveryone on Earth gets $300 after the spoils of a military victory are distributed. The members of the Planet Express staff spend it on different things, with varying degrees of success.    ","episodeNumber":0,"rating":8.2},{"title":"Spanish Fry","summary":"\nAfter being abducted by \u0022human horn\u0022 poachers, Fry goes on a search for his missing nose.    ","episodeNumber":0,"rating":7.6},{"title":"Bend Her","summary":"\nBender enters the Olympics as a Fembot and has modifications to maintain the illusion, leading to a romantic encumbrance with a soap opera star.    ","episodeNumber":0,"rating":7.3},{"title":"Obsoletely Fabulous","summary":"\nThe introduction of a new type of robot makes Bender rethink his devotion to technology.    ","episodeNumber":0,"rating":7.7},{"title":"Bender Should Not Be Allowed on TV","summary":"\nBender becomes a star on his favorite soap opera by forgetting his lines and reverting to character, but becomes concerned about the effect he is having on the audience.    ","episodeNumber":0,"rating":7.5},{"title":"The Devil\u0027s Hands Are Idle Playthings","summary":"\nFry makes a deal with the Robot Devil so he can get robot hands to play the holophoner and impress Leela. In a twist of fate, Fry trades hands with the Robot Devil and writes a masterpiece opera about Leela. However, the Robot Devil has evil plans of his own.    ","episodeNumber":0,"rating":9.1}]},{"number":6,"episodes":[{"title":"Bender\u0027s Big Score: Part 1","summary":"\nThe crew fall for a scam while relaxing on the Nude Beach planet and end up losing both Planet Express and Bender. While Hermes has a nasty accident and Nibbler summons the Nibblonian forces to try save the day.    ","episodeNumber":0,"rating":7.8},{"title":"Bender\u0027s Big Score: Part 2","summary":"\nThe scammers start using time travel to steal valuable items from the past, Professor Farnsworth enlists the Globetrotters\u0027 help, Zoidberg tries to help Hermes recover, Leela goes on a date, and Bender is sent back in time to kill Fry.    ","episodeNumber":0,"rating":7.9},{"title":"Bender\u0027s Big Score: Part 3","summary":"\nFry lives his alternate life in the past, Bender returns to the crew having been released by the scammers. Hermes has another accident and Leela gets engaged during a rampage by Robot Santa, but will the wedding go smoothly.    ","episodeNumber":0,"rating":8.0},{"title":"Bender\u0027s Big Score: Part 4","summary":"\nWhen the Scammers pull a last scam to take ownership of Earth, everyone is forced off planet. Can they all band together to regain their home planet and also stop the numerous time paradox\u0027s causing a huge catastrophe?    ","episodeNumber":0,"rating":8.2},{"title":"The Beast with a Billion Backs: Part 1","summary":"\nAmy and Kif have a ceremony to become part of the same clan and Fry moves in with his new girlfriend discovering she has a very differing lifestyle to his. While the Earth\u0027s scientists debate what to do about the rift in space.    ","episodeNumber":0,"rating":7.3},{"title":"The Beast with a Billion Backs: Part 2","summary":"\nBender starts stalking Calculon and ends up introduced to a special group. A depressed Fry enters the rift, while Farnsworth teams up with rival Wernstrom to collaborate on the rift problem. And tragedy strikes close to home for the crew.    ","episodeNumber":0,"rating":7.3},{"title":"The Beast with a Billion Backs: Part 3","summary":"\nA tentacle monster bursts forth from the rift with Fry as it\u0027s mouthpiece and it intends to join with all people on Earth. The Planet Express crew plan to stop the takeover and rescue Fry but can they succeed and will Bender help them?    ","episodeNumber":0,"rating":7.3},{"title":"The Beast with a Billion Backs: Part 4","summary":"\nBender takes control of the League of Robots and makes a deal with the Robot Devil for an army. While everyone else makes a deal with Yivo to get along together, but things don\u0027t go smoothly for long when Bender attacks.    ","episodeNumber":0,"rating":7.2},{"title":"Bender\u0027s Game: Part 1","summary":"\nLeela has to work on her anger issues after being goaded into entering a Space Demolition Derby with the Planet Express ship and Bender has to work on his lack of imagination after seeing the kids have fun playing Dungeons and Dragons.    ","episodeNumber":0,"rating":7.2},{"title":"Bender\u0027s Game: Part 2","summary":"\nThe Planet Express crew learn Mom is profiting by creating a fake shortage of Dark Matter and set out to stop her but can the Professor recall where he put an important energy crystal. And Bender undergoes therapy at a Robot Insane Asylum.    ","episodeNumber":0,"rating":7.3},{"title":"Bender\u0027s Game: Part 3","summary":"\nWhen Bender\u0027s out of control imagination mixes with the Die of Power it creates an alternate Lord of the Rings influenced universe where the Planet Express crew must go on a journey across strange lands to destroy the Die of Power.    ","episodeNumber":0,"rating":7.3},{"title":"Bender\u0027s Game: Part 4","summary":"\nThe Planet Express crew continue their journey to destroy the Die of Power, which has a negative effect on Fry. Mom and her sons make a last gambit to get the Die for themselves and Leela tries to convince the Centaurs to join the battle.    ","episodeNumber":0,"rating":7.3},{"title":"Into the Wild Green Yonder: Part 1","summary":"\nWhen a new Mars Vegas is built, the crew wrangle invites to the opening weekend and the 3009 Universal Poker Championship. Fry discovers he has a new ability to read people\u0027s thoughts and Bender starts a secret affair with Donbot\u0027s wife.    ","episodeNumber":0,"rating":7.4},{"title":"Into the Wild Green Yonder: Part 2","summary":"\nLeo Wong is building a galaxy sized miniature golf course regardless of the damage it causes, so Leela joins some protesters to oppose him, while Fry joins a group with the same goal of stopping Leo, but President Nixon has other ideas.    ","episodeNumber":0,"rating":7.2},{"title":"Into the Wild Green Yonder: Part 3","summary":"\nBender and Zapp Brannigan team up to capture Leela by using an unwitting Fry. Fry learns more about the Dark Ones, who strike at a new victim. And the Nimbus chases the Feministas across the miniature golf course galaxy.    ","episodeNumber":0,"rating":7.3},{"title":"Into the Wild Green Yonder: Part 4","summary":"\nThe Feministas face the Supreme Court over their \u0027crimes\u0027 but Bender has his own ideas about their fate. As Leo Wong prepares to destroy the Violet Dwarf Star, Fry must decide what the right thing to do is. Then the Dark One arrives.    ","episodeNumber":0,"rating":7.5}]},{"number":7,"episodes":[{"title":"Rebirth","summary":"\nAfter the events of Over The Wild Green Yonder, Leela is put in an irreversible coma. Fry must find a way to cope with his loss, so he builds a robotic Leela.    ","episodeNumber":0,"rating":7.8},{"title":"In-A-Gadda-Da-Leela","summary":"\nZapp and Leela are alone on an unknown planet after their mission to destroy a death star fails, while the rest of the gang tries to save Earth from being the star\u0027s next victim.    ","episodeNumber":0,"rating":7.1},{"title":"Attack of the Killer App","summary":"\nFry and Bender compete to see who can get the most fans on their Twitter-like application on their new eyePhones, not knowing that it\u0027s actually part of Mom\u0027s evil conspiracy to unleash a new virus on people\u0027s brains.    ","episodeNumber":0,"rating":7.7},{"title":"Proposition Infinity","summary":"\nAmy gets together with Bender after she breaks up with Kif, which catches the ire of Dr. Farnsworth and others who oppose human/robot relationships.    ","episodeNumber":0,"rating":7.2},{"title":"The Duh-Vinci Code","summary":"\nProfessor Farnsworth accidentally uncovers the blueprint for a mysterious Leonardo da Vinci invention, and he and his crew travel to Rome for answers.    ","episodeNumber":0,"rating":7.3},{"title":"Lethal Inspection","summary":"\nBender discovers that he has no backup capabilities--meaning that he is mortal, and he and Hermes travel to Mexico so that he can take out his frustrations on his inspector.    ","episodeNumber":0,"rating":8.5},{"title":"The Late Philip J. Fry","summary":"\nFry agrees to travel one minute into the future in Farnsworth\u0027s new time machine right before a big date with Leela, but they wind up going far into the future with no way to go back in time.    ","episodeNumber":0,"rating":9.3},{"title":"That Darn Katz!","summary":"\nA sinister cat uses Amy\u0027s failed dissertation to launch his plan to save his home planet by destroying Earth.    ","episodeNumber":0,"rating":7.2},{"title":"A Clockwork Origin","summary":"\nAfter a dispute with creationists, Farnsworth flees with the others to a remote, uninhabited planet. Upon releasing microrobots in a pond, non-organic life begins to evolve on the planet.    ","episodeNumber":0,"rating":7.9},{"title":"The Prisoner of Benda","summary":"\nThe Professor\u0027s body swapping experiment produces a result he didn\u0027t have in mind.    ","episodeNumber":0,"rating":8.3},{"title":"Lrrreconcilable Ndndifferences","summary":"\nLrrr is being pressured to conquer Earth.    ","episodeNumber":0,"rating":7.2},{"title":"The Mutants Are Revolting","summary":"\nFry accidentally reveals that Leela is a mutant, so she is banished to the sewers where all mutants must live. Not willing to accept this, Leela and Fry organize the mutant uprising against this segregation.    ","episodeNumber":0,"rating":7.5},{"title":"The Futurama Holiday Spectacular","summary":"\nThree separate holiday stories: X-mas, Robanaca and Kwanzaa. 1. Once more Robot Santa comes to town. Besides the violence he spreads, this time he sings to the crew of the pine tree that are needed for a proper \u0022X-mas\u0022. The only problem is that the pine trees have been extinct for over 800 years. However they manage to get some seeds, reforesting the earth. As the oxygen levels explode Bender causes the whole earth to catch fire. 2. Several weeks later, out of laziness Bender insists on celebrating the fake \u0022Robanaca\u0022. For the traditional oil wrestling he needs ...    ","episodeNumber":0,"rating":6.4}]},{"number":8,"episodes":[{"title":"Neutopia","summary":"\nTo avoid an imminent bankruptcy, the \u0022Planet Express\u0022 is converted into an airline company, but on its the first flight the airliner crash-lands on a strange planet.    ","episodeNumber":0,"rating":7.5},{"title":"Benderama","summary":"\nProfessor invents a device that creates two half-sized duplicates of any object. Bender uses this device to create copies of himself, so he doesn\u0027t have to work, but things quickly get out of control.    ","episodeNumber":0,"rating":7.6},{"title":"Ghost in the Machines","summary":"\nFry believes that a human life is more important than a robot life, so Bender decides to kill himself again, only this time he really follows through. But instead of dying he turns into a ghost that haunts Fry.    ","episodeNumber":0,"rating":7.5},{"title":"Law and Oracle","summary":"\nFry realizes he\u0027s stuck in a dead-end job, so he quits and enrolls in the police academy.    ","episodeNumber":0,"rating":8.0},{"title":"The Silence of the Clamps","summary":"\nBender testifies in open court against Donbot, and has to go into Witness Relocation Program, because the entire robot mafia is now after him.    ","episodeNumber":0,"rating":7.5},{"title":"Yo Leela Leela","summary":"\nAgainst all odds, Leela manages to write a successful children story, which becomes a huge TV hit. But Leela\u0027s success comes with a secret.    ","episodeNumber":0,"rating":6.8},{"title":"All the Presidents\u0027 Heads","summary":"\nThe crew changes the outcome of the American revolution when they travel back in time.    ","episodeNumber":0,"rating":7.3},{"title":"Möbius Dick","summary":"\nWhile traveling through the Bermuda Tetrahedron, the crew encounters a giant 4-dimensional space whale.    ","episodeNumber":0,"rating":7.3},{"title":"Fry Am the Egg Man","summary":"\nLeela buys some alien eggs, and Fry decides to hatch one of them instead of eating it, hoping to get a pet bird, but gets something else instead.    ","episodeNumber":0,"rating":7.2},{"title":"The Tip of the Zoidberg","summary":"\nThe Professor consistently refuses to fire Zoidberg, despite his complete incompetence in medicine. The reason for such devotion is finally revealed.    ","episodeNumber":0,"rating":7.7},{"title":"Cold Warriors","summary":"\nFry gets the common cold, which is bad news for the 31st century Earth, where the common cold has been extinct for a long time, so no one is immune to it.    ","episodeNumber":0,"rating":7.7},{"title":"Overclockwise","summary":"\nCubert overclocks Bender\u0027s CPU to make him more powerful, but that creates some unexpected results. Meanwhile, Leela decides to dump Fry and move on.    ","episodeNumber":0,"rating":8.0},{"title":"Reincarnation","summary":"\nThe episode contains three separate stories. In the first, which parodies the 1930s B\u0026W cartoons, Fry wants to propose to Leela, so he blows up a comet made of \u0022dimondium\u0022 to make her a diamond ring. In the second, which parodies the 1980s video games, the Professor invents a microscope with an infinite magnification and learns all the secrets of the Universe, which puts him and other scientists out of business. In the third part, which parodies Japanese anime, the team must defend Earth from dancing aliens.    ","episodeNumber":0,"rating":7.9}]},{"number":9,"episodes":[{"title":"The Bots and the Bees","summary":"\nBender fathers a child with the office beverage machine.    ","episodeNumber":0,"rating":7.7},{"title":"A Farewell to Arms","summary":"\nEarth gets evacuated after a prediction of the end of the planet.    ","episodeNumber":0,"rating":7.6},{"title":"Decision 3012","summary":"\nThe Planet Express crew gets involved in the running campaigns for the new world presidency.    ","episodeNumber":0,"rating":7.5},{"title":"The Thief of Baghead","summary":"\nBender gets his friends in trouble by becoming a paparazzo.    ","episodeNumber":0,"rating":7.2},{"title":"Zapp Dingbat","summary":"\nLeela\u0027s parents break up and while Leela\u0027s mother starts dating, her father picks up his youth where he left it off.    ","episodeNumber":0,"rating":7.0},{"title":"The Butterjunk Effect","summary":"\nLeela and Amy get involved in the tough world of the Butterfly sport.    ","episodeNumber":0,"rating":7.0},{"title":"The Six Million Dollar Mon","summary":"\nAfter Hermes gets replaced by a machine he gets himself upgraded to become useful again for the company.    ","episodeNumber":0,"rating":7.3},{"title":"Fun on a Bun","summary":"\nWhen Fry gets trapped in ice during Oktoberfest he is mistaken for a caveman and accepted in the isolated world of the Neanderthals. Convinced he is a Neanderthal himself he decides to plot a war against the stuck up Homo Sapiens.    ","episodeNumber":0,"rating":7.6},{"title":"Free Will Hunting","summary":"\nAfter Bender realizes he has no power over the decisions he makes, he goes on a soul searching trip to liberate himself from the shackles of his pre-deterministic operation system.    ","episodeNumber":0,"rating":7.2},{"title":"Near-Death Wish","summary":"\nAfter Fry had a quarrel with Dr Farnsworth about family issues, Fry decides to look up Dr Farnsworths\u0027 parents to enjoy the family he never had.    ","episodeNumber":0,"rating":7.6},{"title":"Viva Mars Vegas","summary":"\nThe Planet Express crew goes gambling in Mars Vegas where they risk far more than losing their chips.    ","episodeNumber":0,"rating":7.5},{"title":"31st Century Fox","summary":"\nWhen Bender joins the local Fox Hunting Club ethical questions about killing things arise.    ","episodeNumber":0,"rating":7.1},{"title":"Naturama","summary":"\nA humorous mockumentary about nature.    ","episodeNumber":0,"rating":7.2}]},{"number":10,"episodes":[{"title":"2-D Blacktop","summary":"\nAfter Planet Express ship is scrapped, professor saves it from the junkyard and rebuilds it into a super racer. But an accident during a race sends the ship into a two-dimensional universe.    ","episodeNumber":0,"rating":7.2},{"title":"Fry and Leela\u0027s Big Fling","summary":"\nFry and Leela try to have some private time, but no matter where they go someone gets in their way. Finally they pay for a secluded romantic getaway, which turns out to be even worse.    ","episodeNumber":0,"rating":7.9},{"title":"T.: The Terrestrial","summary":"\nThe crew goes to Omicron Persei 8, where Fry is left behind, and rescued by a local boy, but his only wish is to go home.    ","episodeNumber":0,"rating":7.3},{"title":"Forty Percent Leadbelly","summary":"\nBender finally fulfills his dream of becoming a folk singer by creating a copy of a famous guitar, but then something goes terribly wrong.    ","episodeNumber":0,"rating":6.6},{"title":"The Inhuman Torch","summary":"\nBender accidentally becomes a firefighting hero, and loves it so much that he becomes a full-time firefighter. And he has plenty of opportunities to display his heroism, because fires mysteriously start everywhere he goes.    ","episodeNumber":0,"rating":7.2},{"title":"Saturday Morning Fun Pit","summary":"\nPresident Nixon is watching his favorite TV shows, which spoof three actual cartoon series using Futurama characters.    ","episodeNumber":0,"rating":6.8},{"title":"Calculon 2.0","summary":"\nFry and Bender resurrect Calculon to make \u0022All My Circuits\u0022 interesting again. But things don\u0027t go exactly as planned.    ","episodeNumber":0,"rating":7.1},{"title":"Assie Come Home","summary":"\nBender searches the entire universe for his shiny metal rear end.    ","episodeNumber":0,"rating":7.1},{"title":"Leela and the Genestalk","summary":"\nAfter a rare condition causes Leela to grow tentacles, she stumbles upon a secret genetic engineering facility.    ","episodeNumber":0,"rating":7.0},{"title":"Game of Tones","summary":"\nThe Planet Express crew journeys into Fry\u0027s dreams to pull off a mission in the year 1999.    ","episodeNumber":0,"rating":8.4},{"title":"Murder on the Planet Express","summary":"\nThe crew get trapped aboard the Planet Express ship with a horrific alien creature.    ","episodeNumber":0,"rating":8.5},{"title":"Stench and Stenchibility","summary":"\nZoidberg\u0027s budding romance with a flower shop owner who cannot smell his unpleasant odor is tested when he\u0027s given the opportunity to give her a nose transplant.    ","episodeNumber":0,"rating":7.9},{"title":"Meanwhile","summary":"\nProfessor Farnsworth invents a button that can take a person 10 seconds back in time, inadvertently causing major consequences.    ","episodeNumber":0,"rating":9.4}]}]