[{"number":1,"episodes":[{"title":"My First Day","summary":"\nThree interns - two medical and one surgical - kick off their first day at Sacred Heart teaching hospital.    ","episodeNumber":0,"rating":8.4},{"title":"My Mentor","summary":"\nSardonic Dr. Cox gets to J.D., who\u0027s in desperate need of acceptance; tactless Elliot irks Carla, who\u0027s being wooed by slick Turk.    ","episodeNumber":0,"rating":8.0},{"title":"My Best Friend\u0027s Mistake","summary":"\nJ.D, convinced that one of his patients is sick as a result of misconduct on Turk\u0027s behalf, questions not only his (Turk\u0027s) abilities as a surgeon but their friendship also. Elliot feels disrespected by Dr. Kelso after he refers to her as \u0027sweetheart\u0027 during rounds. In the meantime, J.D. misses his chance to kiss Elliot after being interrupted by Dr. Cox, leaving him 48 hours to get the kiss, in the fear that they will end up as just friends. Will he make it in time?    ","episodeNumber":0,"rating":7.9},{"title":"My Old Lady","summary":"\nThe whole crew learn their share about death when JD takes care of an old woman ready to die, Elliot and Carla watch over a woman who can\u0027t speak English, and Turk becomes too close with a patient.    ","episodeNumber":0,"rating":9.1},{"title":"My Two Dads","summary":"\nWhile J.D. continues to misinterpret Dr. Cox, Elliot discovers parts of her body may have magical healing properties. Turk tries to woo Carla but she may not be as impressed with his gift as he thinks she should be.    ","episodeNumber":0,"rating":8.1},{"title":"My Bad","summary":"\nJ.D. is assigned to look after a difficult, but beautiful, member of Sacred Heart\u0027s Board. Her ties to the hospital may not be the only thing that makes it difficult to treat her. Meanwhile Carla freaks out after her mother is injured when she left her to spend the night with Turk.    ","episodeNumber":0,"rating":8.1},{"title":"My Super Ego","summary":"\nJ.D. has a nemesis, Dr. Murdoch. Turk lies to Carla about freezing in surgery.    ","episodeNumber":0,"rating":7.9},{"title":"My Fifteen Minutes","summary":"\nWhen J.D. and Turk save a TV cameraman and become local heroes, J.D. embraces it but Turk finds all the attention uncomfortable. Meanwhile, Elliot feels like she doesn\u0027t fit in.    ","episodeNumber":0,"rating":8.1},{"title":"My Day Off","summary":"\nIt\u0027s Thanksgiving at Sacred Heart and J.D. is diagnosed with appendicitis. Dr. Cox tries to gain the attention of his former mentor, and former chief of medicine, Dr. Benson. Meanwhile, Elliot tries to become a \u0027warmer\u0027 doctor towards her patients.    ","episodeNumber":0,"rating":8.0},{"title":"My Nickname","summary":"\nJ.D. and Carla struggle as cracks appear in their friendship. Turk battles Kelso for a prime lunch spot and Cox and Elliot disagree over the discharging, or not, of a patient.    ","episodeNumber":0,"rating":8.0},{"title":"My Own Personal Jesus","summary":"\nIt is Christmas time and no one except Turk feels like celebrating. Cox gets J.D. to video the birth of a friend\u0027s baby, and once again, nothing seems to go right.    ","episodeNumber":0,"rating":7.8},{"title":"My Blind Date","summary":"\nJ.D. is helping Cox reach a 24-hour goal without losing one patient, but a woman slipped in the hospital and Kelso demands J.D. give her personal attention so she won\u0027t sue. Elliot would love to take over, but Cox doesn\u0027t acknowledge her.    ","episodeNumber":0,"rating":8.1},{"title":"My Balancing Act","summary":"\nBetween the ever increasing pages from the Hospital, J.D. and Alex can\u0027t seem to find a moment to be together, stifling their growing romance.    ","episodeNumber":0,"rating":7.8},{"title":"My Drug Buddy","summary":"\nSome pain killers have gone missing and Alex and Elliot argue over where they may have ended up. Turk discovers Cox may have inappropriate feelings for Carla.    ","episodeNumber":0,"rating":8.1},{"title":"My Bed Banter \u0026 Beyond","summary":"\nAfter spending a glorious day in bed together, J.D and Elliot expect to be able to keep their new romance a secret. But this is Sacred Heart and nothing is as it seems.    ","episodeNumber":0,"rating":8.4},{"title":"My Heavy Meddle","summary":"\nCarla makes it her mission to give a coma patient his wishes. Turk tries to get J.D and Elliot back together while J.D. looks after Cox as he loses control.    ","episodeNumber":0,"rating":7.7},{"title":"My Student","summary":"\nJD, Elliot, and Turk each get new students, and they each face difficulties.    ","episodeNumber":0,"rating":7.9},{"title":"My Tuscaloosa Heart","summary":"\nJ.D. struggles to treat a horrible patient. Elliot tries to confirm her suspicions that Kelso might be a rock and roll star. Cox finds himself torn between three women.    ","episodeNumber":0,"rating":7.8},{"title":"My Old Man","summary":"\nThe parents of the interns descend on Sacred Heart. Elliot is embarrassed by her parents, and Turk worries over how well his Mom and Carla will get on. J.D. wishes his father were more of a father.    ","episodeNumber":0,"rating":8.0},{"title":"My Way or the Highway","summary":"\nElliot falls for a patient who won\u0027t take the hint and ask her out. J.D. is frustrated by Turk\u0027s competitive nature.    ","episodeNumber":0,"rating":7.9},{"title":"My Sacrificial Clam","summary":"\nElliot finally has a boyfriend, but her relationship starts to get in the way of her internship. J.D. gets stuck by a needle and worries he may have contracted Hepatitis B.    ","episodeNumber":0,"rating":7.7},{"title":"My Occurrence","summary":"\nWhen Jordan\u0027s brother, Ben, comes in for a medical exam, Dr. Cox reveals his more compassionate side and J.D. must reluctantly deliver the bad news about Ben\u0027s health.    ","episodeNumber":0,"rating":9.0},{"title":"My Hero","summary":"\nBen\u0027s diagnosis sends shock waves throughout the staff at Sacred Heart. Surprisingly Cox is the man keeping everyone afloat.    ","episodeNumber":0,"rating":8.7},{"title":"My Last Day","summary":"\nThe interns try and make it through their last day as interns before they become residents; Carla and Turk discuss their relationship.    ","episodeNumber":0,"rating":8.7}]},{"number":2,"episodes":[{"title":"My Overkill","summary":"\nAs a result of Jordan\u0027s intervention, an enormous amount of tension is caused between characters at Sacred Heart. Will prolonged exposure to each other cause compromise?    ","episodeNumber":0,"rating":8.5},{"title":"My Nightingale","summary":"\nAs Residents on their first solo night shift, J.D., Turk and Elliot must work together to treat a patient. Thankfully for the patient, Carla is there to lend a hand. Cox realizes he still has feelings for his ex-wife.    ","episodeNumber":0,"rating":7.8},{"title":"My Case Study","summary":"\nEverybody in the hospital is struggling to find a case unique enough to be published in a medical journal for a chance to go to Reno.    ","episodeNumber":0,"rating":7.9},{"title":"My Big Mouth","summary":"\nJ.D. gets more than he bargained for after he convinces Carla to open up to him. Elliot still hasn\u0027t learned not to seek Cox\u0027s approval.    ","episodeNumber":0,"rating":7.8},{"title":"My New Coat","summary":"\nA nice shiny new Doctor\u0027s Coat doesn\u0027t have the miraculous affect on his skills as J.D. hoped it would. Elliot gets a new nickname following her one night stand with an e.r. doc.    ","episodeNumber":0,"rating":7.8},{"title":"My Big Brother","summary":"\nJD\u0027s ne\u0027er-do-well brother hits it off with Elliot.    ","episodeNumber":0,"rating":7.9},{"title":"My First Step","summary":"\nDr. Cox rails against drug companies while falling for the wiles of a beautiful pharmaceutical saleswoman.    ","episodeNumber":0,"rating":7.9},{"title":"My Fruit Cups","summary":"\nDr. Cox must choose between a sexy pharmaceutical representative and his ex-wife.    ","episodeNumber":0,"rating":8.2},{"title":"My Lucky Day","summary":"\nJ.D. inadvertently upstages Dr. Cox when he diagnoses a patient with a rare disease. Turk tells Carla that people don\u0027t always appreciate her advice. Meanwhile, a patient of Elliot\u0027s sues her for malpractice.    ","episodeNumber":0,"rating":8.0},{"title":"My Monster","summary":"\nJ.D.s mojo goes astray at the very worst time when he gets Gift Shop Girl to date him. Elliott is homeless and apparently friendless. And a pregnant Jordan takes more from Cox\u0027s offer to stay at his place then he intended.    ","episodeNumber":0,"rating":8.0},{"title":"My Sex Buddy","summary":"\nJ.D and Elliot agree to be \u0027Sex Buddies\u0027 - but J.D. may be falling into his own trap. Elliot becomes more and more frazzled and Turk has to bail her out.    ","episodeNumber":0,"rating":8.1},{"title":"My New Old Friend","summary":"\nJ.D. wants to tell Elliot about his feelings, but just can\u0027t seem to find a way. Cox has to deal with a man who comes to the hospital regularly, always thinking he has something new wrong with his health.    ","episodeNumber":0,"rating":8.0},{"title":"My Philosophy","summary":"\nJ.D. discusses the philosophy of death with a transplant patient. Elliot feels that having a unisex locker room at the hospital is unfair. Meanwhile, Turk proposes to Carla just before she leaves for 5 days to take care of her grieving mother, leaving him to ponder over what her answer will be.    ","episodeNumber":0,"rating":8.5},{"title":"My Brother, My Keeper","summary":"\nThe Janitor and his colleagues are assigned the task of \u0022taking care of\u0022 J.D. but not for long. Jordan comes in to the hospital for her ultrasound to reveal the sex of the baby. Turk\u0027s recently divorced brother comes to stay for the weekend. Meanwhile, an old friend of Kelso, Dr Townhend (Dick Van Dyke) puts a patient\u0027s life in jeopardy, causing Kelso to question his obsolete methods as a doctor.    ","episodeNumber":0,"rating":7.9},{"title":"His Story","summary":"\nWhere Perry talks to his psychiatrist about how Jordan wanted him to bond with her family but instead he preferred to stay home and invite some of the guys at the hospital to his place to watch a game, JD gives him the advice to give Kelso the check-up that the latter needs for his insurance and Perry actually listens.    ","episodeNumber":0,"rating":8.6},{"title":"My Karma","summary":"\nJ.D. and Turk play golf on the roof and apparently cause a car accident - could karma be to blame? Jordan reveals a life altering secret to J.D. on the day of the birth of her baby. Carla goes a little more crazy.    ","episodeNumber":0,"rating":8.0},{"title":"My Own Private Practice Guy","summary":"\nJD meets a doctor that used to be a resident under Cox and he takes his advice on how to deal with Dr. Cox and eventually finds out that the reason Cox hates that Dr. is because he slept with Jordan and that\u0027s why they got divorced. While Carla feels that she is not sexy anymore and finds out that it\u0027s because she\u0027s engaged.    ","episodeNumber":0,"rating":7.9},{"title":"My T.C.W.","summary":"\nPerry is jealous from the baby taking the attention of Jordan, Elliot tries to sabotage her relation with Paul, Turk and Carla are arguing more after they got engaged, in the middle of all this mess JD feels lonely and starts a weird relation with TCW which stands for Tasty Coma Wife, a wife of a patient in coma that starts to feel alone so goes out with JD but then they decide that she needs to take more time.    ","episodeNumber":0,"rating":8.5},{"title":"My Kingdom","summary":"\nJD is to start his surgical practice and he would do anything to be in the group, and anything DOES include selling his best friend. Perry -frustrated by the crappy computers Kelso gives them in order to buy fancy stuff for himself- takes advantage of Kelso being away and starts a rumor that Kelso died which makes everyone happy.    ","episodeNumber":0,"rating":7.9},{"title":"My Interpretation","summary":"\nT.C.W.\u0027s husband finally dies, and J.D. struggles to decide if he should seize the opportunity to pursue her. Turk has dirty dreams about Elliot and Cox bonds with Jordan\u0027s son.    ","episodeNumber":0,"rating":8.2},{"title":"My Drama Queen","summary":"\nJD is dating TCW but he finds out that she is a drama queen, just like Elliott told him. Refusing to admit to Elliott that she was right, he tries to keep the heat in his relation. Carla\u0027s mother dies while Carla is planning for the wedding. Overthrown by emotions, she decides to get married as soon as possible in a small wedding chapel in the hospital. Kelso makes the interns that mistreat patients take seminars from him to avoid lawsuits. When Dr. Cox is witnessed harassing a patient, he gets stuck with organizing the seminars.    ","episodeNumber":0,"rating":7.9},{"title":"My Dream Job","summary":"\nIt\u0027s the end of their 2nd year and everything starts to feel boring, but they have their college pal to cheer them up, and get them into trouble. Dr. Kelso is on his annual \u0022picking somebody to pick on so that everybody will be scared of him\u0022, he picks up Elliot for almost blinding him, almost gets her to quit. Perry discovers that he is the father of Jordan\u0027s child, he gets angry and tries to break up with Jordan but she won\u0027t let it happen ,then he tells JD that he is not mad at Jordan but he is actually scared from the idea of being a father.    ","episodeNumber":0,"rating":8.5}]},{"number":3,"episodes":[{"title":"My Own American Girl","summary":"\nCox and Kelso still have some issues since Cox punched him a week earlier, and Kelso is still squeaking. Although JD is now starting with the third year; he still needs Dr. Cox\u0027s help identifying a patients problem, so the four of them do every single test trying to figure it out. Elliot has some issues with her self confidence, so she buys a car, she meets Sean again, and she goes into a transformation moment that changes both her looks and behavior, so she provides some big help to JD in his patient\u0027s problem.    ","episodeNumber":0,"rating":8.0},{"title":"My Journey","summary":"\nTurk and Carla set a date for the wedding, so JD wants to take Turk out for dinner to celebrate the end of an era, Turk has a problem with being straight with his feelings, until he sees a gay couple in the hospital. Carla finds a urine sample without a tag; she tries to find its patient. Elliott and Sean are back together but starting things up again is really hard because Elliott has a problem finding time for him, because of her job.    ","episodeNumber":0,"rating":7.8},{"title":"My White Whale","summary":"\nFinding difficulties on training his interns, J.D. calls out to Elliot for some help. She indicates Sean, who gave Elliot great tips based on his dolphin training that fit perfectly for her interns.    ","episodeNumber":0,"rating":7.9},{"title":"My Lucky Night","summary":"\nSean isn\u0027t happy to hear that Elliott \u0026 J.D. have been intimate. It does, however, make it easier for him to break some news to her. Cox applies for a promotion. Jordan hires a babysitter. Carla embarrasses Turk in front of other surgeons.    ","episodeNumber":0,"rating":8.0},{"title":"My Brother, Where Art Thou?","summary":"\nDan decides to stay with J.D. for a while after their mom\u0027s new fiancée kicks him out, but after spending some quality time with him at the hospital, Dan isn\u0027t sure if he likes the cynical person his little brother has become.    ","episodeNumber":0,"rating":8.1},{"title":"My Advice to You","summary":"\nCarla\u0027s brother who hates Turk comes for a visit. J.D. tries to get over Elliott when he meets Danni who *seems* nice. Cox asks J.D. to back him up in front of others. Kelso declares a policy Cox disagrees with. Will J.D. be loyal to Cox?    ","episodeNumber":0,"rating":7.9},{"title":"My Fifteen Seconds","summary":"\nJD is dating Danni -Jordan\u0027s sister- and that means spending more time with Cox outside the hospital, and Perry doesn\u0027t very much like it. Danni tells JD that she is falling in love with him, but gets mad for the fact that he wasn\u0027t even listening, and while Jordan explains that even they are doctors they don\u0027t listen. When that happens, both JD and Cox realize that the patient -that they didn\u0027t know what\u0027s wrong with- actually tried to commit suicide.    ","episodeNumber":0,"rating":8.5},{"title":"My Friend the Doctor","summary":"\nThe janitor has three personalities. No, actually four, or five. Cox and Carla get satisfied with their conditions. The first is getting old and Carla\u0027s marrying someone who goes to the arcade. JD and Elliot get a little bit competitive.    ","episodeNumber":0,"rating":8.2},{"title":"My Dirty Secret","summary":"\nAfter Elliot gives a patient an orgasm during a pelvic exam and refers to patients \u0027private areas\u0027 using non-medical terms Dr. Kelso taunts her. Carla tells Turk that she doesn\u0027t think they should have sex again until their wedding night, the Janitor uses this information to his advantage to get back at Turk. Dr. Cox moves in with J.D. and Turk temporarily as a result of not being able to handle his relationship with Jordan.    ","episodeNumber":0,"rating":7.9},{"title":"My Rule of Thumb","summary":"\nDanni will move in -temporarily- to JD\u0027s. Carla and Elliot find out that a dying patient is still a virgin, and she wants to have sex before she dies, so they go out to find a man-whore. A patient of Perry\u0027s is getting a new liver, but Turk gives the opinion that the patient can\u0027t have the liver because he drinks.    ","episodeNumber":0,"rating":7.8},{"title":"My Clean Break","summary":"\nJD tries to break up with Danni, but he never broke up with anybody. While Perry -for the first time in a long time- is happy, and that reflects on his behavior in the hospital. Now he has the problem of not having anybody interested in his lessons and teaching because the only way he can teach is through fear, so he will have to \u0022scare them back to him\u0022. And Elliot finds out that the whole hospital -except the janitor- is making fun of her new look, and she has to lose it or not worry what they think.    ","episodeNumber":0,"rating":7.8},{"title":"My Catalyst","summary":"\nDr. Kevin Casey the medical attendant AND surgeon comes to the hospital to impress them with his extraordinary medical skills, and his severe obsessive compulsive disorder case He gives JD a hard time about his eternal search for a mentor He shocks Turk with his extraordinary surgical skills And takes Cox\u0027s position as the greatest-doctor-in-that-hospital    ","episodeNumber":0,"rating":8.9},{"title":"My Porcelain God","summary":"\nJD and Kevin Casey find out about the roof toilet -aka- the epiphany toilet- Elliot needs help regaining her intubating skills, so she turns to KEVIN CASEY who helped everyone else And Turk asked JD to be his best man, so will JD be the best best man?    ","episodeNumber":0,"rating":8.6},{"title":"My Screwup","summary":"\nIt\u0027s Jack\u0027s first birthday, so Jordan\u0027s siblings Dani and Ben are in town. Dr. Cox tells J.D. to leave a patient for half an hour and check up on Ben\u0027s leukemia, but when a patient dies, Dr. Cox blames J.D., and takes over his patients. Carla and Turk argue about Turk getting rid of his mole and Carla taking Turk\u0027s last name. The main theme is acceptance.    ","episodeNumber":0,"rating":9.7},{"title":"My Tormented Mentor","summary":"\nIt\u0027s a battle of the sexes when new female surgeon Dr Miller accuses Turk of being a \u0027sly sexist\u0027 and causes Elliot to question where exactly she stands in the feministic world. Carla is asked to teach a compulsory sexual harassment class with a few surprise students and a few not so surprise students. Meanwhile J.D inspires to help Dr. Cox grieve over his loss by asking Jordan\u0027s \u0027harpie\u0027 girlfriends to leave his house.    ","episodeNumber":0,"rating":8.0},{"title":"My Butterfly","summary":"\nAn ever present butterfly prompts the question of what could have happened differently while Turk searches for his missing lucky do-rag and Elliot hunts for her patient\u0027s stuffed toy.    ","episodeNumber":0,"rating":8.7},{"title":"My Moment of Un-Truth","summary":"\nJ.D. and Carla are becoming closer; furthermore, they are \u0022best friends\u0022. Dr. Ramirez, someone Carla used to like before he left the hospital, is back in town, and Carla goes out with him, not telling Turk. The Janitor is dressing up as his \u0022twin\u0022 brother, Roscoe, to trick J.D. and Turk, but they won\u0027t fall for it.    ","episodeNumber":0,"rating":7.9},{"title":"His Story II","summary":"\nJD dresses like a clown to fill into Elliot\u0027s shoes. Dr. Cox tries to have the hot Dr. Miller on his side in the war with Kelso. It\u0027s Turk\u0027s turn to take the narration -since JD is a clown and has nothing to say- and he is afraid of sending the invitations that mean that his wedding is finalized and there is no going back. But Carla makes him know that she is the right person to be with.    ","episodeNumber":0,"rating":8.0},{"title":"My Choosiest Choice of All","summary":"\nSean comes back and takes Elliot from JD. JD goes back to Danni. The janitor works now as a security guard. Cox finds out that he has a crush on Dr. Miller and is tormented between his crush and his new happy family.    ","episodeNumber":0,"rating":8.1},{"title":"My Fault","summary":"\nCox is furious with Kelso for launching a lucrative \u0022body scan\u0022 service at the hospital. Carla is becoming increasingly frantic about her impending marriage to Turk. Elliot is about to let Sean move in, but breaks up with him after J.D. confesses his love for her.    ","episodeNumber":0,"rating":8.3},{"title":"My Self-Examination","summary":"\nJ.D. wakes next to Elliott, with the chilling realisation that he doesn\u0027t actually love her. At the dress rehearsal for the wedding, Turk is tricked into a humiliating gaffe by Carla\u0027s brother. J.D. chooses that moment to come clean with Elliott - who responds by throwing him across a table. Elsewhere, Cox deliberately provokes an argument with Jordan to maintain the spark in their relationship.    ","episodeNumber":0,"rating":8.1},{"title":"My Best Friend\u0027s Wedding","summary":"\nTurk and Carla\u0027s wedding causes tension between guests, especially Elliot and J.D., whose relationship had taken a nose-dive the week before. Turk attempts to work a little later to have an extended honeymoon, but will he make his big day on time?    ","episodeNumber":0,"rating":8.5}]},{"number":4,"episodes":[{"title":"My Old Friend\u0027s New Friend","summary":"\nAs Turk and Carla return from their honeymoon, J.D. prepares for his first day as a qualified doctor. Elliot is still infuriated with him over their break-up. The hospital has a new psychiatrist, the somewhat dippy Dr Molly Clock. Dr Cox warns J.D. he still has much to learn.    ","episodeNumber":0,"rating":8.4},{"title":"My Office","summary":"\nDr. Clock tries to reconcile J.D. and Elliott, while waiting to see which one Dr. Cox will give the Chief Resident position.    ","episodeNumber":0,"rating":8.2},{"title":"My New Game","summary":"\nDr. Cox and Jordan find out they are still technically married, due to a legal mishap; respect eludes J.D. in his new residency role that has him battling with Elliot.    ","episodeNumber":0,"rating":8.0},{"title":"My First Kill","summary":"\nA risky procedure daunts J.D., intimidated by Cox\u0027s dire warning to residents that \u0022sometimes you will screw up [and] kill a patient.\u0022    ","episodeNumber":0,"rating":8.0},{"title":"Her Story","summary":"\nElliot, who thinks of Molly as her mentor, finds out that she isn\u0027t perfect. Carla gets tired of Turk waking her up when he enters the bedroom and enforces a bedtime on him. J.D. loses what little respect of his residents he had.    ","episodeNumber":0,"rating":8.0},{"title":"My Cake","summary":"\nJ.D.\u0027s brother Dan comes back to tell J.D. their father died.    ","episodeNumber":0,"rating":8.8},{"title":"My Common Enemy","summary":"\nJ.D. catches his brother with Elliot. Apparently it has been going on for two weeks. Kelso and Cox form an unholy alliance to try to break Molly down. Carla turns a promotion down.    ","episodeNumber":0,"rating":7.9},{"title":"My Last Chance","summary":"\nJ.D. makes-out with Molly at her going-away party. He then gets approval from Elliot to sleep with Molly before she moves away. Dr. Cox has to complete community service in an ambulance with a Paramedic who talks endlessly.    ","episodeNumber":0,"rating":8.7},{"title":"My Malpractical Decision","summary":"\nJ.D. is approached by a malpractice attorney, asking him to do a risky procedure on her father. Meanwhile, Elliot guides Doug to a new career path and Turk struggles to avoid a hypochondriac patient.    ","episodeNumber":0,"rating":8.1},{"title":"My Female Trouble","summary":"\nJD is still involved with the lawyer who is suing Turk. Turk tells him to end things but she won\u0027t let him. Elliot gets to treat a VIP but the guy is a chauvinist and thinks she\u0027s a nurse.    ","episodeNumber":0,"rating":8.2},{"title":"My Unicorn","summary":"\nJ.D. takes matters into his own hands, when searching for a relative for his favorite patient. Meanwhile, Elliot is fed-up with co-workers not taking her seriously, and discovers she can get her way by flaunting her femininity with some help from Carla and Jordan.    ","episodeNumber":0,"rating":8.3},{"title":"My Best Moment","summary":"\nWhen J.D. must address a bunch of pre-med students about what it\u0027s like to be a doctor, he strays off the beaten path and chooses to discuss his best moments as a doctor instead.    ","episodeNumber":0,"rating":8.7},{"title":"My Ocardial Infarction","summary":"\nJ.D. tries to pawn off Elliott as his \u0027sidekick\u0027 but is shocked to find that she figures out something before he does. Turk has a realization and tries to come to terms with his diabetes. Meanwhile, The Janitor tries to impress Elliott by gathering up the \u0027Brain Trust\u0027 to upstage Ted\u0027s band.    ","episodeNumber":0,"rating":7.9},{"title":"My Lucky Charm","summary":"\nA man injured in a bar fight teaches Turk and J.D. a lesson about living life to the fullest.    ","episodeNumber":0,"rating":8.2},{"title":"My Hypocritical Oath","summary":"\nWhile at a nightclub J.D. hits it off with the bartender who says she needs a doctor. She arrives at the hospital with her boyfriend who turns out to have gonorrhea. J.D. is bound by doctor patient confidentiality so can\u0027t tell his girlfriend.    ","episodeNumber":0,"rating":8.0},{"title":"My Quarantine","summary":"\nJD\u0027s date with Kylie doesn\u0027t go as planned, and when JD makes a mention of SARS, a quarantine begins. Carla and others tell about their horrible first dates, and Turk finds out that Carla once dated Dr. Cox. Ted and Doug fight over Danni, who\u0027s back in town, and the Janitor makes a bet with Dr. Kelso that lands him in a large debt. Laverne\u0027s birthday is spoiled when everybody else in the quarantine wants to get some of her fave cake, especially Kelso.    ","episodeNumber":0,"rating":8.0},{"title":"My Life in Four Cameras","summary":"\nThe discovery that his latest patient is a comedy writer tips J.D. into a sitcom fantasy, complete with the dreaded laugh track. Turk and Carla worry that the romance has left their marriage. Cox volunteers to trim $26,000 from the hospital budget to avoid Kelso firing a cafeteria worker.    ","episodeNumber":0,"rating":8.3},{"title":"My Roommates","summary":"\nCarla and Turk decide to ask J.D. to move out of the apartment, leaving J.D. temporarily homeless, but it isn\u0027t long before they start to miss having him around...thus resulting in them realizing something they hadn\u0027t expected. Dr. Cox\u0027s competitive high school friend Ron comes to visit, Dr. Cox discovers that his (Ron\u0027s) son is autistic.    ","episodeNumber":0,"rating":8.2},{"title":"My Best Laid Plans","summary":"\nJ.D, frustrated with how slow things are moving with Kylie, ditches their plans when Molly comes back into town. The Janitor enlists the help of Elliot to win a bet against Dr. Cox.    ","episodeNumber":0,"rating":8.4},{"title":"My Boss\u0027s Free Haircut","summary":"\nKelso dons SCR to prove a point to Cox, only to watch it backfire when an obnoxious patient refuses to listen to him; J.D. and Turk party while Carla struggles to find solace in Elliott.    ","episodeNumber":0,"rating":8.3},{"title":"My Lips Are Sealed","summary":"\nJ.D. intervenes when Carla and Turk have relationship problems, suggesting they go for a few drinks...yet J.D.\u0027s friendly gesture only makes things worse when he and Carla share a drunken kiss. The Janitor blackmails Dr. Cox when Jordan is unaware of how he (Dr. Cox) is treating their son. Meanwhile, Elliot deals with a patient with a strange (more than eyebrow raising) condition.    ","episodeNumber":0,"rating":8.0},{"title":"My Big Move","summary":"\nJ.D. and Carla\u0027s secret is out and Turk isn\u0027t reacting as they thought he would. Jordon\u0027s brush with botox gives Cox ammunition and the Janitor is not a big fan of his new uniform!    ","episodeNumber":0,"rating":8.2},{"title":"My Faith in Humanity","summary":"\nRats! Sacred Heart is overrun! Meanwhile Carla and Turk are trying couple\u0027s therapy and Elliot finds herself attracted to a patient\u0027s neighbor.    ","episodeNumber":0,"rating":7.8},{"title":"My Drive By","summary":"\nTurk claims that he does not desire attention like Cox. To prove him wrong, Cox takes the credit when Turk saves a man\u0027s life. Meanwhile, Elliot tries *not* to ruin her relationship, and it\u0027s a battle of wits between Kelso and the Janitor.    ","episodeNumber":0,"rating":7.9},{"title":"My Changing Ways","summary":"\nJ.D. is moving out. Kelso hiring Jordan makes Cox go nuts. Elliot realizes there is something wrong with her relationship. She also applies to another hospital, which upsets Carla, because she doesn\u0027t want her to leave.    ","episodeNumber":0,"rating":8.0}]},{"number":5,"episodes":[{"title":"My Intern\u0027s Eyes","summary":"\nLife has changed. J.D. is now an attending and has new interns to guide, but still lives in his old apartment, hiding from Carla. Elliot tries to project a confident image at her new job. Turk\u0027s trying to get Carla pregnant. Or is he?    ","episodeNumber":0,"rating":7.9},{"title":"My Rite of Passage","summary":"\nElliot has an annoying new colleague. Cox needs a break from Jordan and orders her to find friends at work. Carla gets the impression that Elliot is ashamed of her \u0022old\u0022 colleagues. J.D. realizes his interns find his jokes unfunny.    ","episodeNumber":0,"rating":7.8},{"title":"My Day at the Races","summary":"\nCarla\u0027s still the only one who knows Elliot\u0027s fellowship was canceled. J.D. is turning 30 and gets the urge to achieve something. Turk is fighting for an attending\u0027s spot. Elliot wants Jake to open up but isn\u0027t prepared to handle it.    ","episodeNumber":0,"rating":8.1},{"title":"My Jiggly Ball","summary":"\nJ.D. has to introduce Kelso at an awards banquet--a job made more difficult when he rejects a patient for a drug trial in favor of a richer patient. Meanwhile, the guys want to try to get Elliot\u0027s job back.    ","episodeNumber":0,"rating":8.4},{"title":"My New God","summary":"\nDr. Cox\u0027s sister arrives at the hospital. She\u0027s a born-again Christian who wants him to participate in his son\u0027s baptism. Perry, of course, wants nothing to do with it, and her for that matter.    ","episodeNumber":0,"rating":7.9},{"title":"My Missed Perception","summary":"\nJ.D. mistakes an elderly woman\u0027s happiness as her wish to stop treatment for a fatal illness. Turk and Elliot struggle to find the cause of a patient\u0027s body pain and Carla tries to organize the annual group photo.    ","episodeNumber":0,"rating":7.9},{"title":"My Way Home","summary":"\nOne hundredth episode. As a tribute to \u0022The Wizard of Oz\u0022, the four companions go on a similar journey. Turk needs a heart from a patient in order to be the first resident to assist performing an in-house heart transplant. Carla needs courage to have a child with Turk even though she can\u0027t stand babies. Elliot needs the brains to handle speaking in a medical seminar. And J.D, well, he just wants to get home...    ","episodeNumber":0,"rating":9.1},{"title":"My Big Bird","summary":"\nJ.D., Turk, Elliot and Carla are accused of neglect and must face an interrogation by Cox and Kelso, when a patient unexpectedly dies during their their watch.    ","episodeNumber":0,"rating":8.3},{"title":"My Half-Acre","summary":"\nWhen a potential new girlfriend enters J.D.\u0027s life, Elliot offers J.D. relationship advice and tries to help break his bad habit of ruining romantic moments by uttering really inappropriate things. Meanwhile, Jordan and Carla each have problems with Dr. Cox, and Turk joins the hospital air band.    ","episodeNumber":0,"rating":8.6},{"title":"Her Story II","summary":"\nWhen Carla begins to feel old, she drags her friends to a college club and decides to take a fertility test, among other things. And while all of J.D.\u0027s friends love Julie, they begin to worry that J.D. is going to ruin the relationship after he begins saying his thoughts aloud.    ","episodeNumber":0,"rating":8.3},{"title":"My Buddy\u0027s Booty","summary":"\nThe Sacred Heart staffers each try different ways to take their minds off the fact that a favorite patient, Mrs. Wilk, has to undergo an extremely risky procedure. While J.D. and Elliot try to get lucky in love, or maybe just find themselves booty calls, Dr. Cox finds a new drinking buddy in the Janitor, and Carla encourages Turk to fight for a female-friendly hospital gym.    ","episodeNumber":0,"rating":7.9},{"title":"My Cabbage","summary":"\nJ.D.\u0027s dislike for and resentment towards intern Keith increases to the point where J.D. tries to get him dismissed from Sacred Heart, but the plan backfires. Elsewhere, Elliot and Turk misplace their patient\u0027s deathbed statement to his children; and the Janitor attempts to keep a pet bird in the hospital without Dr. Kelso knowing it.    ","episodeNumber":0,"rating":8.2},{"title":"My Five Stages","summary":"\nGrief counseling is offered to Mrs. Wilk, whose condition has worsened considerably. As she comes to accept her fate with help from a quirky therapist, J.D. and Dr. Cox surprisingly turn to each other for support as they face losing their favorite patient. Elsewhere, Ted and the Janitor team up to give bitter Kelso a taste of his own medicine, and Elliot\u0027s relationship with Keith changes.    ","episodeNumber":0,"rating":8.4},{"title":"My Own Personal Hell","summary":"\nElliot gets upset with J.D. when he doesn\u0027t defend her after she\u0027s accused by the other interns of giving preferential treatment to Keith. Meanwhile, Dr. Cox is stuck caring for one of Dr. Kelso\u0027s old, miserable, and demanding friends, and Carla resorts to trickery to find out if Turk is sterile.    ","episodeNumber":0,"rating":7.9},{"title":"My Extra Mile","summary":"\nWhen Dr. Cox scoffs at reading lines with a patient preparing for a play, J.D. urges his fellow doctors to do special, unconventional things for their patients. But when J.D. scores a date with a hot babe who loves his hair, he\u0027s not sure he can shave his head for a woman undergoing chemo. Turk and Carla attempt to eliminate all stress to better their chances of conceiving, but Turk has to compete for a surgical resident spot and Carla loses Dr. Kelso\u0027s VIP patient. Meanwhile, Elliot showers Keith with stupid gifts.    ","episodeNumber":0,"rating":8.2},{"title":"My Bright Idea","summary":"\nTurk finds out that Carla is pregnant.    ","episodeNumber":0,"rating":8.4},{"title":"My Chopped Liver","summary":"\nWhen J.D. rearranges his schedule to allow himself more time with Turk, Turk secretly resents hanging out with J.D. because it interferes with his own \u0022Turk Time.\u0022 Meanwhile, Cox and Jordan go on a double date with Elliot and Keith, and Carla covers for Kelso at work as he grieves for his dead dog. Later, a patient almost dies after giving up part of his liver for his brother, and the hospital staff learns about making sacrifices for the people they really care about.    ","episodeNumber":0,"rating":8.0},{"title":"My New Suit","summary":"\nJ.D. is forced to show his brother Dan some tough love when he shows up in town. Carla and Turk pick baby names. Dr. Cox realizes the consequences of making negative comments about Kelso\u0027s son.    ","episodeNumber":0,"rating":7.8},{"title":"His Story III","summary":"\nThe hospital is seen from the perspective of The Janitor, who\u0027s out to prove he can make a difference after getting rid of J.D. for the day. Also, Turk sees his \u0022blackness\u0022 called into question by Dr. Cox, and Elliot\u0027s intern\u0027s mistakes begin to frustrate her.    ","episodeNumber":0,"rating":8.6},{"title":"My Lunch","summary":"\nJ.D. accidentally runs into Dr. Cox in a store, who both then run into annoying former suicidal patient Jill Tracy. Meanwhile Elliot and Carla do a little investigating and find out that Todd hasn\u0027t actually slept with anyone in the hospital - they jump to conclusions about his sexuality.    ","episodeNumber":0,"rating":9.6},{"title":"My Fallen Idol","summary":"\nCarla persuades all her coworkers to rally around a despondent Dr. Cox, after three of his patients die because of his mistake. Everyone participates except J.D., who thinks his selfish reaction crossed the line.    ","episodeNumber":0,"rating":9.2},{"title":"My Déjà Vu, My Déjà Vu","summary":"\nDr. Cox returns to the hospital, but Elliot quickly learns the hard way that he\u0027s still his same old obnoxious self. And Carla forces Turk to also give up the things she has to give up while she\u0027s pregnant.    ","episodeNumber":0,"rating":7.9},{"title":"My Urologist","summary":"\nJ.D. challenges a urologist\u0027s assessment on a consult for a patient who might need a risky surgical procedure, feeling that she\u0027s playing it safe professionally and personally, since he also starts to fall for her. Along the same lines, Elliot considers breaking up with her boyfriend/intern Keith for being too weak, especially when he\u0027s being picked on by Dr. Cox.    ","episodeNumber":0,"rating":8.1},{"title":"My Transition","summary":"\nJ.D. tries to plan the perfect date for Dr. Briggs, but Elliot keeps getting in the way. Elliot plans a baby shower for Carla while two other women also discover they\u0027re pregnant.    ","episodeNumber":0,"rating":8.4}]},{"number":6,"episodes":[{"title":"My Mirror Image","summary":"\nIn the sixth season opener, J.D. deals with the news that he\u0027s going to be a father, Dr. Cox worries about how his anger is going to affect his offspring, and The Janitor wonders whether his personal vendetta against J.D. is a waste of time. Also, Elliot decides she too wants children.    ","episodeNumber":0,"rating":8.0},{"title":"My Best Friend\u0027s Baby\u0027s Baby and My Baby\u0027s Baby","summary":"\nJ.D. and Kim start contemplating about their future and their baby\u0027s future.    ","episodeNumber":0,"rating":8.1},{"title":"My Coffee","summary":"\nCarla is finding the decision to return to work after having the baby tough. Elliot treats another doctor, which is always tough going. JD and Kim try to figure out how much they have in common.    ","episodeNumber":0,"rating":7.8},{"title":"My House","summary":"\nJ.D. is trying to keep his girlfriend from taking the job that would take her away from him for four months while Dr. Cox tries to solve a \u0022medical mystery\u0022.    ","episodeNumber":0,"rating":8.1},{"title":"My Friend with Money","summary":"\nCarla is still struggling with postpartum depression, Cox and janitor take advantage of the new hospital luxury suite, and Elliot has to deal with being called a private-practice \u0022sellout.\u0022    ","episodeNumber":0,"rating":7.7},{"title":"My Musical","summary":"\nA patient hears singing from everyone, turning Sacred Heart into a musical extravaganza. Meanwhile, Elliot determines whether or not J.D. should move in with her, and Carla determines whether or not to go back to work.    ","episodeNumber":0,"rating":8.9},{"title":"His Story IV","summary":"\nDr. Kelso\u0027s thoughts narrate this episode in which he takes a special interest in a patient who is an Iraqi War veteran. The presence of the veteran brings about a political debate amongst the staff regarding the War.    ","episodeNumber":0,"rating":8.1},{"title":"My Road to Nowhere","summary":"\nTurk convinces J.D. that he needs to go to Tacoma for Kim\u0027s first ultra sound -- which results in an impromptu road trip for the Sacred Heart crew. After commandeering Dr. Kelso\u0027s new RV Eliot, Carla, Keith, Ted and the Janitor join the father to be on his journey. Meanwhile, Dr. Cox and Jordan face some concern when her ultrasound reveals that their unborn child will need to have surgery.    ","episodeNumber":0,"rating":8.5},{"title":"My Perspective","summary":"\nWhen J.D. develops vasovagal syncope, a condition which results in fainting or blackouts, he finds himself not only having to deal with losing his girlfriend and his apartment, but also his consciousness.    ","episodeNumber":0,"rating":8.0},{"title":"My Therapeutic Month","summary":"\nJ.D. falls for a sexy new physical therapist but because of his unfortunate circumstances he finds it difficult to ask her out. Meanwhile, Turk breaks his arm and Dr. Kelso sends him back to residency where, with the help of Dr. Cox, he realizes that he knows less about actual medicine than he thought he did. Elsewhere, Eliot invites Keith to move in with her, but isn\u0027t quite ready to compromise her house rules. All the while Carla provides each of the doctors with guidance while they get over their fear, ignorance and stubbornness.    ","episodeNumber":0,"rating":7.9},{"title":"My Night to Remember","summary":"\nWhile helping a patient regain his memory, the staff at Sacred Heart stir up some memories of their own. J.D., Elliot, Turk, Carla, Dr. Cox, Dr. Kelso and Janitor take a trip down memory lane.    ","episodeNumber":0,"rating":5.4},{"title":"My Fishbowl","summary":"\nPrivate Dancer is being released from the hospital. But when he finds out he can\u0027t join the army, he tries to commit suicide.    ","episodeNumber":0,"rating":7.9},{"title":"My Scrubs","summary":"\nDr. Kelso\u0027s friend is admitted in the hospital, but what he doesn\u0027t know is that she doesn\u0027t have any insurance. He also notices that the staff is stealing scrubs from the hospital. Meanwhile, Carla is being blackmailed by the Janitor.    ","episodeNumber":0,"rating":8.2},{"title":"My No Good Reason","summary":"\nDr. Cox and Nurse Roberts argue about whether there is a reason for things happening.    ","episodeNumber":0,"rating":8.7},{"title":"My Long Goodbye","summary":"\nLaverne was in a car accident and is in a coma. Everyone has a hard time dealing with it. Jordan is having her baby, but Dr. Cox doesn\u0027t want everybody knowing about it. J.D is the only one who knows about the birth and is obsessed with becoming the baby\u0027s godfather.    ","episodeNumber":0,"rating":9.0},{"title":"My Words of Wisdom","summary":"\nAfter saying goodbye to Nurse Roberts, the Sacred Heart staff institutes some of her lessons into their lives. Though Carla thinks they\u0027ve all forgotten, Dr. Cox takes time to reflect on his purpose; Elliot opens her heart to Keith; and J.D. and Turk learn compassion.    ","episodeNumber":0,"rating":8.2},{"title":"Their Story","summary":"\nIn a unique twist, J.D. turns his narrating duties over to Ted, Todd and Jordan -- as this episode focuses on the lives of the supporting players at Sacred Heart Hospital. Ted juggles fantasies in which he has a full head of hair and a reality where he is helping the nursing staff fight for a raise; Todd meets his future son and helps Turk preserve his reputation and Jordan puts aside her knack for causing misery to help Elliot and Keith\u0027s relationship.    ","episodeNumber":0,"rating":8.4},{"title":"My Turf War","summary":"\nJ.D. feels a little left out when Eliot\u0027s wild sorority sister, Melody comes to town. Not able to deal with being the third wheel he turns the girls against each other in the hopes that he will once again be Eliot\u0027s priority friend and, if he is lucky, that he might get to \u0022mack\u0022 it with Melody.    ","episodeNumber":0,"rating":7.9},{"title":"My Cold Shower","summary":"\nElliot makes Keith re-propose to her so that everything will be exactly the way she imagined it, but how will JD take the news of their engagement?    ","episodeNumber":0,"rating":8.5},{"title":"My Conventional Wisdom","summary":"\nAs Elliot begins to plan her wedding with Keith, J.D. continues to question his true feelings for her. In an attempt to ease his best friend\u0027s mind Turk takes him to a surgeon\u0027s convention in Phoenix, but the plan backfires when J.D. runs into his ex-girlfriend Kim and comes face to face with the unexpected. Meanwhile, Kelso and his cronies party it up at the convention while unbeknown to him the Janitor takes on the role of Chief of Medicine back at Sacred Heart.    ","episodeNumber":0,"rating":8.5},{"title":"My Rabbit","summary":"\nKim moves in with J.D. in order to raise their child together. J.D. learns from Turk and Dr. Cox that fatherhood changes the way of how to see things. Carla complains to Elliot about her being a control freak when they prepare the bachelorette party.    ","episodeNumber":0,"rating":8.1},{"title":"My Point of No Return","summary":"\nIn the season finale, J.D. and Elliot start thinking about their future and if they both made a mistake in not being with each other. The Janitor activates the \u0022Brain Trust\u0022 to come up with the perfect wedding gift for Elliot.    ","episodeNumber":0,"rating":8.5}]},{"number":7,"episodes":[{"title":"My Own Worst Enemy","summary":"\nIn the aftermath of their near-indiscretion, Elliot realizes she doesn\u0027t want to be with Keith and J.D. resolves to stop sabotaging himself. Meanwhile, Dr. Cox and Turk find a patient they both like who is in danger of being discharged.    ","episodeNumber":0,"rating":8.1},{"title":"My Hard Labor","summary":"\nKim and JD break up right before their baby is born because he doesn\u0027t love her. Turk can\u0027t be by JD\u0027s side until he finishes a video game, and Perry tries to find another doctor besides himself to give his infant daughter a shot.    ","episodeNumber":0,"rating":7.9},{"title":"My Inconvenient Truth","summary":"\nJ.D\u0027s brother Dan returns and delivers a few home truths to his little brother.    ","episodeNumber":0,"rating":7.8},{"title":"My Identity Crisis","summary":"\nTurk tries to assure a worried Carla that their daughter will acknowledge her Latin heritage. The Janitor challenges J.D. to identify everyone in the hospital, when it is discovered that he uses nicknames, because he doesn\u0027t know the people\u0027s actual names.    ","episodeNumber":0,"rating":7.9},{"title":"My Growing Pains","summary":"\nThe Sacred Heart staff has to deal with their inner child, when J.D. and Turk remember their first prank, Dr. Cox has a ten year old Leukemia patient and Dr. Kelso celebrates his birthday.    ","episodeNumber":0,"rating":7.9},{"title":"My Number One Doctor","summary":"\nThough Elliot boasts that through private practice she gets to get to know her patients, nobody seems to care. Carla is amazed at how the Janitor was able to score such an attractive girlfriend.    ","episodeNumber":0,"rating":8.0},{"title":"My Bad Too","summary":"\nJ.D.\u0027s teenage burn patient gives him a hard decision to make when he wants to go to his high school graduation.    ","episodeNumber":0,"rating":7.7},{"title":"My Manhood","summary":"\nWhen Dr. Kelso tells the Janitor that nobody cares what he thinks, he starts a newspaper called \u0022The Janitorial\u0022 to prove him wrong. J.D. and Turk fight over their manhood issues, while Dr. Kelso is too proud to ask for help about one of his problems.    ","episodeNumber":0,"rating":7.9},{"title":"My Dumb Luck","summary":"\nCarla and Elliot try to round up support to fight against Dr. Kelso\u0027s forced retirement, but they aren\u0027t getting many takers. J.D. and Turk accidentally figure out one of Dr. Cox\u0027s patient\u0027s mystery ailments.    ","episodeNumber":0,"rating":8.5},{"title":"My Waste of Time","summary":"\nElliot and J.D. discover a major change in their relationship, when they spend time together looking for a former patient.    ","episodeNumber":0,"rating":7.9},{"title":"My Princess","summary":"\nDr. Cox tells his son the story about a typical day at Sacred Heart in the form of a bedtime fairy tale.    ","episodeNumber":0,"rating":8.1}]},{"number":8,"episodes":[{"title":"My Jerks","summary":"\nThe new chief of medicine turns out to be as callous as Dr. Kelso, J.D. gives up on his intern class after they let him down, and Eliot is too self-absorbed to realize that Keith is still hurt from their breakup.    ","episodeNumber":0,"rating":8.0},{"title":"My Last Words","summary":"\nJ.D. and Turk skip \u0022steak night\u0022 to hang out with a dying patient who has no next of kin.    ","episodeNumber":0,"rating":9.2},{"title":"My Saving Grace","summary":"\nDr. Cox grudgingly asks for Dr. Kelso\u0027s assistance in getting rid of Dr. Maddox, and Carla tries to get a troublesome intern in line.    ","episodeNumber":0,"rating":7.7},{"title":"My Happy Place","summary":"\nJ.D. and Elliot begin contemplating whether they\u0027re back together, or whether they even want to consider going down that road. Meanwhile, Dr. Cox\u0027s mistrust of surgeons reaches the tipping point for Turk.    ","episodeNumber":0,"rating":8.1},{"title":"My ABC\u0027s","summary":"\nJ.D., Eliot, and Dr. Cox all choose the intern that they will take under their wing for the year, only to be sorely disappointed by each of their choices.    ","episodeNumber":0,"rating":8.2},{"title":"My Cookie Pants","summary":"\nDr. Cox is up for the Chief of Medicine position, but he\u0027s not sure if he wants it. Meanwhile, J.D. confronts his intern about her callousness toward patients, and Eliot asks for Turk\u0027s help in her love life with J.D..    ","episodeNumber":0,"rating":8.1},{"title":"My New Role","summary":"\nDr. Cox has trouble adjusting to his new job as Chief of Medicine, and Carla gets in trouble with the other nurses because of her relationship with the doctors.    ","episodeNumber":0,"rating":7.9},{"title":"My Lawyer\u0027s in Love","summary":"\nDr. Cox has trouble delegating authority in his new position, and Ted falls in love with a singer at the hospital.    ","episodeNumber":0,"rating":8.3},{"title":"My Absence","summary":"\nElliot misses J.D. while he is away. Turk announces that he and Carla are having a second baby, but nobody seems to care. Dr. Cox begins to wonder if Carla\u0027s attitude toward her job and her patients has changed.    ","episodeNumber":0,"rating":7.5},{"title":"My Comedy Show","summary":"\nJ.D. and Turk direct the intern comedy show, but are mortified to discover that the biggest joke of the night is at their expense. Meanwhile, Elliot tries to get Denise to hang out with the other interns.    ","episodeNumber":0,"rating":7.6},{"title":"My Nah Nah Nah","summary":"\nTurk is inspired to perform an experimental procedure on a paralyzed teen by a story on SportsCenter, Jordan is mad that Perry is wearing a wedding band, and the janitor thinks his new relationship is in trouble.    ","episodeNumber":0,"rating":7.5},{"title":"Their Story II","summary":"\nWhile Turk becomes jealous of J.D. because of his new position of power at Sacred Heart, some of the interns share their stories and experiences.    ","episodeNumber":0,"rating":7.6},{"title":"My Full Moon","summary":"\nElliot and Turk are left with four cocky interns and a number of difficult patients on the night of a full moon.    ","episodeNumber":0,"rating":7.7},{"title":"My Soul on Fire: Part 1","summary":"\nEverybody goes to the Bahamas to surprise the Janitor and Lady and attend their wedding. While there, J.D., Turk, and Dr. Cox come to the realization that their relationships are in trouble.    ","episodeNumber":0,"rating":7.9},{"title":"My Soul on Fire: Part 2","summary":"\nAs Janitor and Lady\u0027s wedding approaches, J.D., Dr. Cox, and Turk try to address the issues that are hurting their relationships.    ","episodeNumber":0,"rating":8.2},{"title":"My Cuz","summary":"\nJD and Elliot are disturbed when Kim and Sean begin dating, and JD\u0027s son appears to like Sean more than him. Meanwhile, Dr. Cox has reservations about promoting Turk to Chief of Surgery, and Kelso admits himself into the hospital.    ","episodeNumber":0,"rating":7.7},{"title":"My Chief Concern","summary":"\nJ.D. is mad at Turk when he overrules him on a medical decision in his new role as chief surgeon. But did he do it just because J.D. is moving away to be close to his son and taking a new job at another hospital?    ","episodeNumber":0,"rating":8.1},{"title":"My Finale: Part 1","summary":"\nIt\u0027s JD\u0027s last day at Sacred Heart, but the day is not the special one that he had envisioned and hoped for.    ","episodeNumber":0,"rating":9.1},{"title":"My Finale: Part 2","summary":"\nJ.D. continues his last day at Sacred Heart, and tries to hold out hope for a great sendoff.    ","episodeNumber":0,"rating":9.7}]},{"number":9,"episodes":[{"title":"Our First Day of School","summary":"\nThe doctors reunite to teach med school to a new set of students, but J.D. is not sure after his first day whether he can make a difference and connect with any of his students.    ","episodeNumber":0,"rating":6.5},{"title":"Our Drunk Friend","summary":"\nLucy ignores Dr. Cox\u0027s advice not to get emotionally invested in her patients, and learns her lesson the hard way. Meanwhile, Denise is hurt when she becomes emotionally involved with an intern who is only in it for the sex.    ","episodeNumber":0,"rating":6.5},{"title":"Our Role Models","summary":"\nWhen Drew lets Dr. Cox down, he is then forced to turn to JD for help. Meanwhile, Lucy asks Dr. Mahoney to be her mentor, but she is too preoccupied with her own issues as a doctor to help.    ","episodeNumber":0,"rating":6.5},{"title":"Our Histories","summary":"\nJ. D. and Turk show up in costume at a med student\u0027s party. Meanwhile, Kelso bids a fond farewell to Ted and Gooch.    ","episodeNumber":0,"rating":6.6},{"title":"Our Mysteries","summary":"\nJD spends his final day as a teacher trying to find out who gave him a negative review, Lucy looks for a \u0022blood buddy,\u0022 and Dr. Cox tries to convince Denise that Drew has taken charge of their relationship.    ","episodeNumber":0,"rating":6.3},{"title":"Our New Girl-Bro","summary":"\nWhile Turk struggles to find a replacement best friend, Elliott offers some sound advice and guidance to an over-worked and exhausted Lucy.    ","episodeNumber":0,"rating":6.1},{"title":"Our White Coats","summary":"\nCole reveals Drew\u0027s most embarrassing moment when Drew beats him out as the speaker at the white coat ceremony, while Denise turns to Turk and Eliot for more relationship advice.    ","episodeNumber":0,"rating":6.3},{"title":"Our Couples","summary":"\nLucy struggles to acknowledge that she likes Cole, Dr. Cox and Dr. Turk\u0027s rivalry is put aside for a gravely ill patient, and Denise plays a prank on the security guards at the hospital.    ","episodeNumber":0,"rating":5.9},{"title":"Our Stuff Gets Real","summary":"\nJ.D. and Elliot\u0027s sex life disappears as they get closer to the birth of their child, Dr. Cox refuses to sign his will after a patient dies, and Lucy is terrified of cutting a familiar cadaver for a group exam.    ","episodeNumber":0,"rating":6.5},{"title":"Our True Lies","summary":"\nDr. Cox tries to find out which member of Lucy\u0027s study group cheated on a test, Drew gets in trouble when he tells Denise he loves her and then makes the situation worse, and a patient irrationally chooses surgery over treatment.    ","episodeNumber":0,"rating":6.3},{"title":"Our Dear Leaders","summary":"\nTurk is jealous when he is upstaged by a talented visiting surgeon, and the study group falls apart when Dr. Cox removes Drew from the group so that Drew can shadow him.    ","episodeNumber":0,"rating":5.9},{"title":"Our Driving Issues","summary":"\nCole is depressed when nobody but Lucy shows up for his melanoma procedure, Dr. Kelso loses some of personal independence after some tests, and Drew discovers that Dr. Mahoney has the same personality as Dr. Cox.    ","episodeNumber":0,"rating":6.0},{"title":"Our Thanks","summary":"\nThe med students are thankful when Cole identifies his true calling.    ","episodeNumber":0,"rating":6.1}]}]