[{"number":1,"episodes":[{"title":"Simpsons Roasting on an Open Fire","summary":"\nHomer is forced to become a department store Santa when Marge spends the family\u0027s Christmas savings on removing Bart\u0027s tattoo.    ","episodeNumber":0,"rating":8.1},{"title":"Bart the Genius","summary":"\nBart ends up at a school for gifted children after cheating on an IQ test.    ","episodeNumber":0,"rating":7.7},{"title":"Homer\u0027s Odyssey","summary":"\nAfter losing his job, Homer contemplates ending it all, until he discovers a new life path as a safety advocate.    ","episodeNumber":0,"rating":7.3},{"title":"There\u0027s No Disgrace Like Home","summary":"\nAfter being embarrassed by the rest of the family at a company picnic, Homer becomes obsessed with improving their behavior towards each other.    ","episodeNumber":0,"rating":7.7},{"title":"Bart the General","summary":"\nAfter being beaten up by Nelson Muntz one too many times, Bart turns to Grampa for help, and soon leads a rebellion against the school bully.    ","episodeNumber":0,"rating":7.9},{"title":"Moaning Lisa","summary":"\nA depressed Lisa\u0027s spirit is lifted when she meets a jazz-man, Bleeding Gums Murphy.    ","episodeNumber":0,"rating":7.6},{"title":"The Call of the Simpsons","summary":"\nHomer takes the family camping, but it soon becomes a misadventure when they lose their equipment and Homer is mistaken for Bigfoot.    ","episodeNumber":0,"rating":7.7},{"title":"The Telltale Head","summary":"\nBart gets more than he bargained for when he saws the head off a statue of the town\u0027s founder.    ","episodeNumber":0,"rating":7.6},{"title":"Life on the Fast Lane","summary":"\nMarge contemplates an affair with a handsome bowling instructor.    ","episodeNumber":0,"rating":7.4},{"title":"Homer\u0027s Night Out","summary":"\nAfter a photograph of Homer canoodling with an exotic dancer is distributed throughout Springfield, he finds himself kicked out of the house by Marge.    ","episodeNumber":0,"rating":7.3},{"title":"The Crepes of Wrath","summary":"\nBart is sent to France on a student exchange program, where he\u0027s treated like a slave; An Albanian student takes Bart\u0027s place in the family.    ","episodeNumber":0,"rating":7.7},{"title":"Krusty Gets Busted","summary":"\nAfter Krusty is found guilty of robbing the Kwik-E-Mart following Homer\u0027s eyewitness testimony, Bart and Lisa set out to prove his innocence.    ","episodeNumber":0,"rating":8.3},{"title":"Some Enchanted Evening","summary":"\nHomer and Marge enjoy a night on the town, leaving the kids with a diabolical babysitter, with a surprising secret.    ","episodeNumber":0,"rating":7.7}]},{"number":2,"episodes":[{"title":"Bart Gets an F","summary":"\nMrs. Krabappel, fed up with Bart\u0027s lackadaisical approach to his studies, gives him an ultimatum: shape up or repeat the fourth grade.    ","episodeNumber":0,"rating":8.2},{"title":"Simpson and Delilah","summary":"\nHomer lies on a medical insurance form in order to obtain a miracle hair restoring drug.    ","episodeNumber":0,"rating":8.2},{"title":"Treehouse of Horror","summary":"\nThe Simpsons move into a cursed house, then are abducted by aliens, before Homer is ensconced in a tale by Edgar Allen Poe.    ","episodeNumber":0,"rating":8.2},{"title":"Two Cars in Every Garage and Three Eyes on Every Fish","summary":"\nAfter the power plant experiences bad publicity and is threatened with closure, Mr. Burns decides to run for Governor in order to have power over the law.    ","episodeNumber":0,"rating":8.0},{"title":"Dancin\u0027 Homer","summary":"\nHomer\u0027s heckling of the Springfield Isotopes baseball team during one of their games inadvertently leads to his appointment as the new team mascot.    ","episodeNumber":0,"rating":7.3},{"title":"Dead Putting Society","summary":"\nIn an attempt to show up Ned Flanders, Homer pits Bart against Ned\u0027s son, Todd, in a miniature golf competition.    ","episodeNumber":0,"rating":7.9},{"title":"Bart vs. Thanksgiving","summary":"\nOn Thanksgiving, Bart runs away after fighting with Lisa.    ","episodeNumber":0,"rating":7.7},{"title":"Bart the Daredevil","summary":"\nAfter seeing a motorcycle daredevil at a monster truck show, Bart becomes a death-defying daredevil skateboarder.    ","episodeNumber":0,"rating":8.3},{"title":"Itchy \u0026 Scratchy \u0026 Marge","summary":"\nMarge becomes a crusader against cartoon violence after \u0022Itchy and Scratchy\u0022 seemingly inspires Maggie to attack Homer.    ","episodeNumber":0,"rating":8.1},{"title":"Bart Gets Hit by a Car","summary":"\nWhile skateboarding down the street, Bart is hit by a car driven by Mr. Burns. Homer turns down Mr. Burns\u0027 token offer of $100, and instead hires ambulance-chaser Lionel Hutz to bring an outrageous lawsuit against the millionaire.    ","episodeNumber":0,"rating":7.7},{"title":"One Fish, Two Fish, Blowfish, Blue Fish","summary":"\nAfter apparently consuming poison blowfish, Homer is told that he only has 24 hours to live.    ","episodeNumber":0,"rating":8.8},{"title":"The Way We Was","summary":"\nHomer and Marge tell the story of how they met and fell in love in high school.    ","episodeNumber":0,"rating":8.2},{"title":"Homer vs. Lisa and the 8th Commandment","summary":"\nHomer gets a crooked cable guy to install free cable in the Simpson home, and as a result, Lisa faces an ethical crisis over her family\u0027s stealing.    ","episodeNumber":0,"rating":8.0},{"title":"Principal Charming","summary":"\nHomer tries to set Selma up with Principal Skinner, only for him to fall for Patty instead.    ","episodeNumber":0,"rating":7.4},{"title":"Oh Brother, Where Art Thou?","summary":"\nAfter Grampa is hospitalized, he reveals that Homer has a half-brother, and the family set out to find him.    ","episodeNumber":0,"rating":8.3},{"title":"Bart\u0027s Dog Gets an F","summary":"\nAfter an uncontrollable Santa\u0027s Little Helper destroys several important Simpson possessions, Homer announces that he will be thrown out of the house unless he completes obedience training.    ","episodeNumber":0,"rating":7.4},{"title":"Old Money","summary":"\nAfter Grampa\u0027s new girlfriend dies and leaves him $106,000 in her will, he tries to decide what to do with it.    ","episodeNumber":0,"rating":7.6},{"title":"Brush with Greatness","summary":"\nAfter rekindling her artistic talents, Marge is commissioned to paint a portrait of Mr. Burns; Homer vows to lose weight after getting trapped in a water slide.    ","episodeNumber":0,"rating":7.9},{"title":"Lisa\u0027s Substitute","summary":"\nLisa has a crush on her substitute teacher; Bart decides to run for class president.    ","episodeNumber":0,"rating":8.6},{"title":"The War of the Simpsons","summary":"\nHomer must decide whether he should complete marriage counseling or skip out to catch a legendary catfish; Bart and Lisa take advantage of Grampa\u0027s ignorance of the house rules.    ","episodeNumber":0,"rating":7.8},{"title":"Three Men and a Comic Book","summary":"\nBart, Milhouse and Martin each pitch in to buy an expensive comic book, which soon has a disastrous effect on their friendship.    ","episodeNumber":0,"rating":8.3},{"title":"Blood Feud","summary":"\nAfter Bart saves Mr. Burns\u0027 life with a blood transfusion, Homer vows revenge when they receive only a \u0022thank you\u0022 card as compensation.    ","episodeNumber":0,"rating":7.8}]},{"number":3,"episodes":[{"title":"Stark Raving Dad","summary":"\nHomer accidentally lands in a mental hospital and ends up sharing a room with a white man who thinks he is Michael Jackson.    ","episodeNumber":0,"rating":8.6},{"title":"Mr. Lisa Goes to Washington","summary":"\nAfter winning a political essay contest, Lisa is invited to Washington, D.C., but she soon becomes upset after discovering how policy-making really works.    ","episodeNumber":0,"rating":7.7},{"title":"When Flanders Failed","summary":"\nAfter wishing for Flanders to lose his business, Homer discovers that his neighbor is actually about to go bankrupt and decides to help him out.    ","episodeNumber":0,"rating":8.2},{"title":"Bart the Murderer","summary":"\nAfter having a horrible day, Bart gets a job tending bar for a group of gangsters and becomes the prime suspect when Principal Skinner mysteriously disappears.    ","episodeNumber":0,"rating":8.6},{"title":"Homer Defined","summary":"\nHomer is a hero after averting a nuclear meltdown that he nearly caused, but he doesn\u0027t want to tell anyone that he stopped it completely by accident.    ","episodeNumber":0,"rating":8.4},{"title":"Like Father, Like Clown","summary":"\nBart and Lisa try to reunite Krusty the Clown with his father.    ","episodeNumber":0,"rating":7.6},{"title":"Treehouse of Horror II","summary":"\nThe Simpson family receives a severed monkey\u0027s paw which can grant wishes, Bart gains magical powers which he uses to turn Homer into a Jack-in-the-box, and Mr. Burns uses Homer\u0027s brain to create a robot.    ","episodeNumber":0,"rating":8.2},{"title":"Lisa\u0027s Pony","summary":"\nHomer buys Lisa a pony that the family can ill afford.    ","episodeNumber":0,"rating":7.9},{"title":"Saturdays of Thunder","summary":"\nAfter Homer fails a fathering test, he decides to help Bart build his Soap Box Derby racer.    ","episodeNumber":0,"rating":7.9},{"title":"Flaming Moe\u0027s","summary":"\nMoe claims a drink that Homer invented is his own, with the drink making the bar a local hot spot, but threatens his friendship with Homer.    ","episodeNumber":0,"rating":8.8},{"title":"Burns Verkaufen der Kraftwerk","summary":"\nBurns decides to retire and sells the power plant to a German consortium for an exorbitant price. Homer\u0027s laziness and inefficiency are quickly exposed by his new bosses, and he is laid off.    ","episodeNumber":0,"rating":8.2},{"title":"I Married Marge","summary":"\nAs Marge goes to the doctor for a pregnancy test, Homer tells the children of the events leading up to his marriage, and Bart\u0027s birth.    ","episodeNumber":0,"rating":8.3},{"title":"Radio Bart","summary":"\nAfter Bart receives a microphone which can transmit through radios, he decides to pull a series of pranks and eventually convinces the town that a boy has fallen down a well.    ","episodeNumber":0,"rating":8.5},{"title":"Lisa the Greek","summary":"\nHomer uses Lisa (and her prognostic skills) to help him bet on football games.    ","episodeNumber":0,"rating":8.0},{"title":"Homer Alone","summary":"\nWhile Marge spends a couple of days at Rancho Relaxo after she has a breakdown, Bart and Lisa stay with Patty and Selma, and Homer stays at home to take care of Maggie.    ","episodeNumber":0,"rating":8.0},{"title":"Bart the Lover","summary":"\nAfter Mrs. Krabappel gives Bart a month of detention, he gets his revenge by responding to her newspaper singles ad; Homer uses a swear jar to cut down on his cursing.    ","episodeNumber":0,"rating":8.3},{"title":"Homer at the Bat","summary":"\nHomer and his co-workers qualify for the plant softball team\u0027s league final, but Mr. Burns hires nine professional MLB players in order to win a $1 million bet.    ","episodeNumber":0,"rating":8.7},{"title":"Separate Vocations","summary":"\nLisa and Bart take an examination at the school that is supposed to determine what they will be when they grow up, but the kids are not so sure.    ","episodeNumber":0,"rating":8.2},{"title":"Dog of Death","summary":"\nAfter the Simpsons regret paying for an expensive surgery for Santa\u0027s Little Helper, he runs away from home and is trained by Mr. Burns to become an attack dog.    ","episodeNumber":0,"rating":7.7},{"title":"Colonel Homer","summary":"\nHomer becomes the manager of a beautiful young country singer and finds himself almost attracted to her, sparking Marge\u0027s jealousy.    ","episodeNumber":0,"rating":8.0},{"title":"Black Widower","summary":"\nSideshow Bob gets out of jail and plots to take his revenge on Bart by marrying his Aunt Selma and killing her.    ","episodeNumber":0,"rating":8.3},{"title":"The Otto Show","summary":"\nAfter Otto loses his job as school bus driver because he does not have a license, Bart convinces Homer and Marge to let Otto stay with them until he gets back on his feet.    ","episodeNumber":0,"rating":7.7},{"title":"Bart\u0027s Friend Falls in Love","summary":"\nBart becomes jealous when Milhouse falls in love with a new student named Samantha; Homer accidentally receives a vocabulary-building tape instead of a weight-loss one.    ","episodeNumber":0,"rating":7.7},{"title":"Brother, Can You Spare Two Dimes?","summary":"\nAfter Homer \u0022wins\u0022 a $2000 settlement with the plant for radiation affecting his sperm count, his brother Herb comes to Springfield with an idea that could help him get his fortune back.    ","episodeNumber":0,"rating":8.2}]},{"number":4,"episodes":[{"title":"Kamp Krusty","summary":"\nBart and Lisa attend \u0022Kamp Krusty\u0022 but it is nothing like they thought it would be; Homer\u0027s hair grows back and he loses weight while the kids are away.    ","episodeNumber":0,"rating":8.5},{"title":"A Streetcar Named Marge","summary":"\nMarge stars in a musical adaptation of A Streetcar Named Desire, but is angry with Homer\u0027s lack of interest; Maggie squares off with her strict new daycare owner.    ","episodeNumber":0,"rating":8.1},{"title":"Homer the Heretic","summary":"\nHomer decides to stay at home every Sunday while the rest of the family continues to attend church, and soon finds himself in an ominous situation.    ","episodeNumber":0,"rating":8.9},{"title":"Lisa the Beauty Queen","summary":"\nHomer enters Lisa in the Little Miss Springfield pageant to build her self-esteem.    ","episodeNumber":0,"rating":7.7},{"title":"Treehouse of Horror III","summary":"\nAn evil Krusty the Clown doll tries to kill Homer; Marge is captured by a giant ape who falls in love with her; Bart inadvertently raises the dead.    ","episodeNumber":0,"rating":8.4},{"title":"Itchy \u0026 Scratchy: The Movie","summary":"\nWith Bart continually getting in trouble, Homer bans him from seeing the new Itchy \u0026 Scratchy movie.    ","episodeNumber":0,"rating":8.2},{"title":"Marge Gets a Job","summary":"\nWhen Marge takes a job at the power plant, Mr. Burns falls in love with her; Bart \u0022cries wolf\u0022 to avoid taking a test.    ","episodeNumber":0,"rating":7.8},{"title":"New Kid on the Block","summary":"\nBart develops a crush on his new neighbor, only to discover that she\u0027s dating Jimbo Jones; Homer sues an all-you-can-eat restaurant after he\u0027s kicked out.    ","episodeNumber":0,"rating":8.2},{"title":"Mr. Plow","summary":"\nHomer opens a successful snow-plowing business, only to inspire Barney to start a rival outfit that puts him out of work.    ","episodeNumber":0,"rating":8.8},{"title":"Lisa\u0027s First Word","summary":"\nWhile trying to coax Maggie into saying her first word, Homer and Marge talk about how Lisa spoke hers.    ","episodeNumber":0,"rating":8.7},{"title":"Homer\u0027s Triple Bypass","summary":"\nYears of poor eating habits catch up with Homer when he suffers a massive heart attack, but the family can\u0027t afford the triple bypass operation he needs.    ","episodeNumber":0,"rating":8.6},{"title":"Marge vs. the Monorail","summary":"\nAfter receiving a considerable donation of money, Springfield builds a monorail system with Homer as the conductor, unaware they\u0027ve just boarded a one-way train to Hell.    ","episodeNumber":0,"rating":9.1},{"title":"Selma\u0027s Choice","summary":"\nSelma starts to feel broody, but after taking Bart and Lisa to Duff Gardens, she changes her mind.    ","episodeNumber":0,"rating":8.0},{"title":"Brother from the Same Planet","summary":"\nWhen Bart gets tired of Homer\u0027s horrible parenting skills, he enrolls in the \u0022Bigger Brother\u0022 program where he\u0027s assigned a fantastic role model.    ","episodeNumber":0,"rating":8.1},{"title":"I Love Lisa","summary":"\nLisa gives Ralph a Valentine\u0027s card out of pity, but soon regrets it when he develops an unwanted crush on her.    ","episodeNumber":0,"rating":8.4},{"title":"Duffless","summary":"\nAfter Homer loses his license for DUI, Marge pressures him to give up beer for a month; Lisa attempts to prove that Bart is less intelligent than a hamster.    ","episodeNumber":0,"rating":8.3},{"title":"Last Exit to Springfield","summary":"\nWhen Mr. Burns revokes the plant\u0027s dental plan, forcing Lisa to be fitted with cheap, ugly braces, Homer leads its union into going on strike.    ","episodeNumber":0,"rating":9.0},{"title":"So It\u0027s Come to This: A Simpsons Clip Show","summary":"\nAs Homer recovers in hospital due to Bart\u0027s disastrous April Fool\u0027s Day prank, the family reminiscences over earlier hardships.    ","episodeNumber":0,"rating":7.0},{"title":"The Front","summary":"\nBart and Lisa convince Grampa to let them use his name for episodes of \u0022Itchy and Scratchy\u0022 they have written; Homer re-takes a test he failed in high school.    ","episodeNumber":0,"rating":8.1},{"title":"Whacking Day","summary":"\nMarge home-schools Bart after he is expelled from Springfield Elementary; Lisa protests a barbaric local holiday centered around clubbing snakes to death.    ","episodeNumber":0,"rating":8.1},{"title":"Marge in Chains","summary":"\nA misunderstanding leads to Marge being imprisoned for shoplifting, with her absence soon descending the family, and eventually, the town into chaos.    ","episodeNumber":0,"rating":7.7},{"title":"Krusty Gets Kancelled","summary":"\nWhen Krusty\u0027s show is canceled after losing viewers to a ventriloquist and his dummy, Bart and Lisa organize a celebrity-filled comeback special for their favorite Clown.    ","episodeNumber":0,"rating":8.1}]},{"number":5,"episodes":[{"title":"Homer\u0027s Barbershop Quartet","summary":"\nAfter the kids find a record with Homer\u0027s picture on it, he recalls the story of how he achieved fame in the 1980s with his barbershop quartet, The Be Sharps.    ","episodeNumber":0,"rating":8.5},{"title":"Cape Feare","summary":"\nAfter being released from prison on parole, Sideshow Bob plots to murder Bart.    ","episodeNumber":0,"rating":9.2},{"title":"Homer Goes to College","summary":"\nWhen a surprise inspection of the nuclear power plant reveals that Homer is not qualified to do his job, he is forced to go to college.    ","episodeNumber":0,"rating":8.6},{"title":"Rosebud","summary":"\nAfter his birthday party goes wrong, Mr. Burns begins to want his childhood toy, a teddy bear named Bobo; Homer finds that Maggie is in possession of the doll.    ","episodeNumber":0,"rating":8.8},{"title":"Treehouse of Horror IV","summary":"\nHomer sells his soul to the Devil for a donut, Bart contends with a gremlin on the side of the school bus which only he can see, and the family discovers that Mr. Burns is a vampire.    ","episodeNumber":0,"rating":8.8},{"title":"Marge on the Lam","summary":"\nA girls\u0027 night out turns into a high speed chase when Marge learns her friend is driving a stolen car.    ","episodeNumber":0,"rating":8.0},{"title":"Bart\u0027s Inner Child","summary":"\nBrad Goodman, a self-help guru, encourages Springfield to act more like Bart, with disastrous results.    ","episodeNumber":0,"rating":7.6},{"title":"Boy Scoutz \u0027n the Hood","summary":"\nAfter joining the Junior Campers while on a sugar high, Bart reluctantly invites Homer to accompany him on the group\u0027s annual father-son rafting trip, which soon goes awry.    ","episodeNumber":0,"rating":8.6},{"title":"The Last Temptation of Homer","summary":"\nHomer\u0027s marriage is in trouble when he develops an attraction to a new co-worker; Bart undergoes medical treatments that make him look like a nerd.    ","episodeNumber":0,"rating":8.5},{"title":"$pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling)","summary":"\nMr. Burns builds a casino when Springfield decides to legalize gambling, with Marge becoming addicted to the slot machines.    ","episodeNumber":0,"rating":8.6},{"title":"Homer the Vigilante","summary":"\nAn outbreak of burglaries inspires Homer to lead a vigilante group.    ","episodeNumber":0,"rating":8.2},{"title":"Bart Gets Famous","summary":"\nBart becomes an overnight sensation as the \u0022I didn\u0027t do it\u0022 boy on Krusty the Clown\u0027s show.    ","episodeNumber":0,"rating":8.1},{"title":"Homer and Apu","summary":"\nApu moves in with the Simpsons after losing his job when Homer gets ill from the contaminated food; James Woods takes over the Kwik-E-Mart.    ","episodeNumber":0,"rating":8.2},{"title":"Lisa vs. Malibu Stacy","summary":"\nAngered by the vacuous phrases her Malibu Stacy doll utters, Lisa works with Malibu Stacy\u0027s original designer to create a doll with admirable traits.    ","episodeNumber":0,"rating":8.1},{"title":"Deep Space Homer","summary":"\nIn an effort to increase the dismal television ratings for their space launches, NASA decides to send an ordinary man into space, and Homer is chosen for the task.    ","episodeNumber":0,"rating":8.8},{"title":"Homer Loves Flanders","summary":"\nAfter Flanders invites Homer to a football game, the pair become friends, but Homer\u0027s possessiveness and loutish behaviour slowly turns Ned against him.    ","episodeNumber":0,"rating":8.5},{"title":"Bart Gets an Elephant","summary":"\nAfter Bart receives an elephant as a prize for calling in to a radio station, the animal proves to be too costly to care for and Homer decides to sell it.    ","episodeNumber":0,"rating":7.8},{"title":"Burns\u0027 Heir","summary":"\nAfter coming close to death, Mr. Burns decides than it\u0027s time to find an heir to his empire, and chooses Bart because of his truly devious nature.    ","episodeNumber":0,"rating":8.3},{"title":"Sweet Seymour Skinner\u0027s Baadasssss Song","summary":"\nBart accidentally gets Principal Skinner fired on inspection day, with Ned Flanders taking over as his replacement.    ","episodeNumber":0,"rating":8.3},{"title":"The Boy Who Knew Too Much","summary":"\nBart witnesses the alleged assault of a waiter by Mayor Quimby\u0027s nephew, but coming forward will mean admitting to skipping class, and face the consequences.    ","episodeNumber":0,"rating":8.3},{"title":"Lady Bouvier\u0027s Lover","summary":"\nGrampa falls in love with Marge\u0027s mother, but must compete with Mr. Burns for her heart.    ","episodeNumber":0,"rating":7.5},{"title":"Secrets of a Successful Marriage","summary":"\nHomer begins teaching a class on how to have a successful marriage, but jeopardizes his own marriage by revealing secrets about himself and Marge.    ","episodeNumber":0,"rating":8.0}]},{"number":6,"episodes":[{"title":"Bart of Darkness","summary":"\nConfined to his room with a broken leg, Bart suspects Ned Flanders of murdering Maude; the family\u0027s new swimming pool earns Lisa popularity among the neighborhood kids.    ","episodeNumber":0,"rating":8.7},{"title":"Lisa\u0027s Rival","summary":"\nLisa is jealous when a new girl in class is smarter than she is; Homer obtains a giant mound of sugar.    ","episodeNumber":0,"rating":8.1},{"title":"Another Simpsons Clip Show","summary":"\nThe family recalls past tales of lost love.    ","episodeNumber":0,"rating":5.8},{"title":"Itchy \u0026 Scratchy Land","summary":"\nA family vacation to Itchy \u0026 Scratchy Land turns disastrous when the robots malfunction and turn on the tourists.    ","episodeNumber":0,"rating":8.6},{"title":"Sideshow Bob Roberts","summary":"\nWhen Sideshow Bob is released from prison and is elected Mayor of Springfield, Bart and Lisa suspect foul play and are determined to expose his corruption.    ","episodeNumber":0,"rating":8.2},{"title":"Treehouse of Horror V","summary":"\nThe family\u0027s job at Mr. Burns\u0027 country estate goes awry when Homer goes mad; Homer\u0027s attempt to repair a toaster results in inadvertent time travel; The school staff turn cannibalistic.    ","episodeNumber":0,"rating":9.2},{"title":"Bart\u0027s Girlfriend","summary":"\nBart falls for Reverend Lovejoy\u0027s daughter and is surprised when she becomes a bad influence on him.    ","episodeNumber":0,"rating":8.0},{"title":"Lisa on Ice","summary":"\nSibling rivalry between Bart and Lisa ensues when they become the star players of their respective ice hockey teams.    ","episodeNumber":0,"rating":8.6},{"title":"Homer Badman","summary":"\nHomer accidentally lands himself in trouble with the law and with the kids\u0027 babysitter after stealing a gummy replica at a candy convention.    ","episodeNumber":0,"rating":8.9},{"title":"Grampa vs. Sexual Inadequacy","summary":"\nHomer and Abe hit the road to sell Abe\u0027s miraculous aphrodisiac.    ","episodeNumber":0,"rating":8.0},{"title":"Fear of Flying","summary":"\nMarge goes into therapy to cure her of her traumatizing fear of flying.    ","episodeNumber":0,"rating":7.7},{"title":"Homer the Great","summary":"\nHomer becomes a member of a mysterious organization called the Stonecutters and is heralded as \u0022the chosen one\u0022.    ","episodeNumber":0,"rating":9.0},{"title":"And Maggie Makes Three","summary":"\nHomer recounts the story of Maggie\u0027s birth when the kids ask why there are no photos of her in the family album.    ","episodeNumber":0,"rating":8.8},{"title":"Bart\u0027s Comet","summary":"\nBart discovers a comet that is on a collision course with Springfield.    ","episodeNumber":0,"rating":8.6},{"title":"Homie the Clown","summary":"\nHomer becomes a Krusty the Clown stand-in, but is mistaken for the real Krusty by the Springfield mafia.    ","episodeNumber":0,"rating":8.6},{"title":"Bart vs. Australia","summary":"\nAfter he makes a collect call to Australia and refuses to pay for it, Bart sparks an international incident, with the Simpsons forced to travel to the country in order to repair political relations.    ","episodeNumber":0,"rating":8.5},{"title":"Homer vs. Patty and Selma","summary":"\nDesperate for money, Homer takes a loan from Patty and Selma; Bart discovers a natural talent for ballet.    ","episodeNumber":0,"rating":7.8},{"title":"A Star Is Burns","summary":"\nThe citizens of Springfield host their own film festival, with popular movie critic Jay Sherman arriving from New York to judge.    ","episodeNumber":0,"rating":8.5},{"title":"Lisa\u0027s Wedding","summary":"\nA fortune teller gives Lisa a look at her wedding in the year 2010.    ","episodeNumber":0,"rating":8.3},{"title":"Two Dozen and One Greyhounds","summary":"\nSanta\u0027s Little Helper\u0027s new mate has puppies, and Mr. Burns schemes to steal them and make them into a coat.    ","episodeNumber":0,"rating":8.1},{"title":"The PTA Disbands","summary":"\nBart manipulates Mrs. Krabappel into leading a teachers\u0027 strike against Principal Skinner, but is perturbed when Marge becomes his substitute.    ","episodeNumber":0,"rating":8.0},{"title":"\u0027Round Springfield","summary":"\nWhen Bart is hospitalized, Lisa runs into her mentor Bleeding Gums Murphy, who is also a patient, and becomes devastated when he dies soon after.    ","episodeNumber":0,"rating":8.1},{"title":"The Springfield Connection","summary":"\nMarge deals with corruption and crime when she joins the Springfield police force.    ","episodeNumber":0,"rating":8.2},{"title":"Lemon of Troy","summary":"\nWhen a group of Shelbyville kids steal Springfield\u0027s sacred lemon tree, Bart and his friends venture there to get the tree back.    ","episodeNumber":0,"rating":8.7},{"title":"Who Shot Mr. Burns? Part One","summary":"\nAfter Mr. Burns steals oil from Springfield Elementary and blocks out the sun, an unknown person shoots him.    ","episodeNumber":0,"rating":9.2}]},{"number":7,"episodes":[{"title":"Who Shot Mr. Burns? Part Two","summary":"\nMr. Burns is laying in the hospital while the investigation into his shooter begins. Every citizen has motivation, but it\u0027s Simpson DNA that has been found.    ","episodeNumber":0,"rating":9.0},{"title":"Radioactive Man","summary":"\nMilhouse is cast as Radioactive Man\u0027s sidekick in a Hollywood production of the comic book.    ","episodeNumber":0,"rating":8.3},{"title":"Home Sweet Home-Dum-Diddly Doodily","summary":"\nMarge and Homer lose custody of the kids, who are sent to live at the Flanders\u0027 house.    ","episodeNumber":0,"rating":8.4},{"title":"Bart Sells His Soul","summary":"\nBart casually sells his soul to Milhouse for $5 but soon regrets it; Moe converts his dank bar into a family restaurant.    ","episodeNumber":0,"rating":8.8},{"title":"Lisa the Vegetarian","summary":"\nA trip to a local petting zoo convinces Lisa to give up meat, despite excessive pressure to convince her not to do so.    ","episodeNumber":0,"rating":8.5},{"title":"Treehouse of Horror VI","summary":"\nA lightning storm causes giant advertising mascots to come to life; The children are terrorized by Groundskeeper Willie in their dreams; Homer finds himself trapped in another dimension.    ","episodeNumber":0,"rating":8.6},{"title":"King Size Homer","summary":"\nHomer intentionally gains more weight in order to qualify for disability and work from home, but soon realizes that being morbidly obese comes with its own problems.    ","episodeNumber":0,"rating":9.0},{"title":"Mother Simpson","summary":"\nAfter faking his own death, Homer is reunited with his mother, who harbors a deep secret.    ","episodeNumber":0,"rating":8.7},{"title":"Sideshow Bob\u0027s Last Gleaming","summary":"\nSideshow Bob again escapes from prison and takes control of a TV screen at an air show, demanding all television stations immediately go off the air.    ","episodeNumber":0,"rating":8.0},{"title":"The Simpsons 138th Episode Spectacular!","summary":"\nTroy McClure hosts a retrospective of the first 137 episodes of The Simpsons (1989).    ","episodeNumber":0,"rating":7.4},{"title":"Marge Be Not Proud","summary":"\nMarge\u0027s relationship with Bart is strained when he is caught shoplifting before Christmas.    ","episodeNumber":0,"rating":8.5},{"title":"Team Homer","summary":"\nHomer starts a bowling team with Moe, Apu and Otto, but Mr. Burns insists on joining after learning that the team was funded with his money; Springfield Elementary introduces uniforms.    ","episodeNumber":0,"rating":8.3},{"title":"Two Bad Neighbors","summary":"\nFormer President George Bush and his wife, Barbara, move into the Simpsons\u0027 neighborhood and soon clash with Bart and Homer.    ","episodeNumber":0,"rating":8.5},{"title":"Scenes from the Class Struggle in Springfield","summary":"\nAfter buying a Chanel suit at a bargain price, Marge finds herself invited to a country club by a former schoolmate. Taken in by the opulence of the place, she is soon overcome by a desperation to fit in.    ","episodeNumber":0,"rating":7.7},{"title":"Bart the Fink","summary":"\nKrusty the Clown is left almost broke after Bart inadvertently rats him out to the IRS, forcing Krusty to take drastic action.    ","episodeNumber":0,"rating":7.6},{"title":"Lisa the Iconoclast","summary":"\nLisa may figure out what to do when she discovers that Springfield\u0027s founding father was actually a murderous thief while researching for an essay.    ","episodeNumber":0,"rating":8.1},{"title":"Homer the Smithers","summary":"\nWhen Smithers is forced to take a vacation, he appoints Homer as his temporary replacement.    ","episodeNumber":0,"rating":8.8},{"title":"The Day the Violence Died","summary":"\nBart and Lisa meet a vagabond who claims to be the creator of Itchy from \u0022Itchy and Scratchy.\u0022    ","episodeNumber":0,"rating":8.0},{"title":"A Fish Called Selma","summary":"\nWashed-up movie star Troy McClure starts dating Selma in an attempt to silence bizarre rumors about his personal life and resuscitate his career.    ","episodeNumber":0,"rating":8.2},{"title":"Bart on the Road","summary":"\nBart makes a fake driver\u0027s license and takes Milhouse, Martin and Nelson on a huge road trip; Lisa spends time with Homer at the power plant.    ","episodeNumber":0,"rating":8.6},{"title":"22 Short Films About Springfield","summary":"\nA series of vignettes highlights a day in the life of various Springfield residents.    ","episodeNumber":0,"rating":8.9},{"title":"Raging Abe Simpson and His Grumbling Grandson in \u0027The Curse of the Flying Hellfish\u0027","summary":"\nOne of Grampa\u0027s old war buddies dies, and it\u0027s revealed that Mr. Burns is the only other living member of his WWII squad and things go sour quickly.    ","episodeNumber":0,"rating":8.5},{"title":"Much Apu About Nothing","summary":"\nAnti-immigration fever sweeps Springfield, which threatens to lead to the deportation of Apu, until Homer decides to reject the mob mentality and help him become a legal citizen.    ","episodeNumber":0,"rating":8.1},{"title":"Homerpalooza","summary":"\nIn an attempt to prove to his kids that es a cool dad, Homer takes them to a music festival but ends up embarrassing them after being hired in a sideshow.    ","episodeNumber":0,"rating":7.9},{"title":"Summer of 4\u00272\u0022","summary":"\nAfter realizing how unpopular she is, a disillusioned Lisa sees the vacation to Ned Flanders\u0027 beach house as an opportunity to reinvent herself.    ","episodeNumber":0,"rating":8.4}]},{"number":8,"episodes":[{"title":"Treehouse of Horror VII","summary":"\nBart\u0027s Siamese twin swells in the attic; Lisa\u0027s science experiment creates a miniature universe of advanced civilization; aliens possess Clinton and Dole.    ","episodeNumber":0,"rating":8.4},{"title":"You Only Move Twice","summary":"\nAfter moving to another town for a new job, Homer must decide whether or not to stay when the family have a hard time with the transfer.    ","episodeNumber":0,"rating":9.2},{"title":"The Homer They Fall","summary":"\nHomer becomes a boxer after Moe discovers his amazing ability to take a punch.    ","episodeNumber":0,"rating":8.1},{"title":"Burns, Baby Burns","summary":"\nThe Simpsons try to reunite Mr. Burns with Larry, his slovenly long-lost son.    ","episodeNumber":0,"rating":7.6},{"title":"Bart After Dark","summary":"\nMarge leads a crusade against a local burlesque house after she discovers Bart working there.    ","episodeNumber":0,"rating":8.3},{"title":"A Milhouse Divided","summary":"\nHomer questions the state of his marriage after Luann Van Houten demands a divorce from Kirk.    ","episodeNumber":0,"rating":8.1},{"title":"Lisa\u0027s Date with Density","summary":"\nLisa develops a crush on Nelson, and tries to reform him; Homer gets an autodialer and decides to make easy money with a telemarketing scam.    ","episodeNumber":0,"rating":7.8},{"title":"Hurricane Neddy","summary":"\nAfter a hurricane destroys Ned Flanders\u0027 house, he suffers a nervous breakdown and is forced to confront repressed problems from his childhood.    ","episodeNumber":0,"rating":8.7},{"title":"El Viaje Misterioso de Nuestro Jomer","summary":"\nAfter eating insanity peppers at a chili cook-off, Homer has a hallucination of a talking coyote urging him to find his soulmate.    ","episodeNumber":0,"rating":8.6},{"title":"The Springfield Files","summary":"\nSpecial Agents Mulder and Scully arrive in Springfield after Homer claims to have seen an alien.    ","episodeNumber":0,"rating":9.0},{"title":"The Twisted World of Marge Simpson","summary":"\nMarge enters the pretzel vending business, but when she fails, Homer recruits some help from the mob.    ","episodeNumber":0,"rating":7.7},{"title":"Mountain of Madness","summary":"\nHomer and Mr. Burns get trapped in a snowed-in cabin during a company retreat.    ","episodeNumber":0,"rating":8.5},{"title":"Simpsoncalifragilisticexpiala(Annoyed Grunt)cious","summary":"\nMarge is stressed from motherhood and hires a British nanny to help out around the house, who struggles to teach Bart and Lisa how to behave.    ","episodeNumber":0,"rating":7.6},{"title":"The Itchy \u0026 Scratchy \u0026 Poochie Show","summary":"\nHomer is cast as Poochie, a new \u0022Itchy and Scratchy\u0022 character designed to reverse declining ratings; a hip college student moves in with the Simpsons.    ","episodeNumber":0,"rating":7.9},{"title":"Homer\u0027s Phobia","summary":"\nAfter Marge befriends John, a gay store owner, Homer worries that his presence will have a negative effect on Bart\u0027s sexuality.    ","episodeNumber":0,"rating":8.8},{"title":"Brother from Another Series","summary":"\nBart suspects a paroled Sideshow Bob is up to his old tricks when he is hired by his brother Cecil to assist in the construction of a dam.    ","episodeNumber":0,"rating":8.2},{"title":"My Sister, My Sitter","summary":"\nBart is outraged when Lisa becomes his babysitter.    ","episodeNumber":0,"rating":7.9},{"title":"Homer vs. the 18th Amendment","summary":"\nAfter alcohol is banned in Springfield, Homer adopts the moniker of the \u0022Beer Baron\u0022 to bootleg liquor, prompting an investigation from an uptight Treasury agent.    ","episodeNumber":0,"rating":8.8},{"title":"Grade School Confidential","summary":"\nBart discovers Principal Skinner and Mrs Krabappel kissing, and it\u0027s not long before the whole town knows of their secret affair.    ","episodeNumber":0,"rating":8.2},{"title":"The Canine Mutiny","summary":"\nWhen the items Bart purchased with a fake credit card are repossessed, he claims that Santa\u0027s Little Helper is the dog he bought instead of his new pet, Laddie.    ","episodeNumber":0,"rating":7.6},{"title":"The Old Man and the Lisa","summary":"\nBurns loses his fortune and recruits Lisa to help him get it back.    ","episodeNumber":0,"rating":7.9},{"title":"In Marge We Trust","summary":"\nMarge becomes a church counselor; Homer discovers his face on a Japanese detergent logo.    ","episodeNumber":0,"rating":8.1},{"title":"Homer\u0027s Enemy","summary":"\nHomer\u0027s laziness begets the ire of his industrious but arrogant new co-worker Frank Grimes; Bart buys a run-down factory for a dollar.    ","episodeNumber":0,"rating":9.3},{"title":"The Simpsons Spin-Off Showcase","summary":"\nTroy McClure presents three spinoffs: \u0022Chief Wiggins, P.I.,\u0022 \u0022The Love-Matic Grandpa,\u0022 and \u0022The Simpson Family Smile-Time Variety Hour.\u0022    ","episodeNumber":0,"rating":7.1},{"title":"The Secret War of Lisa Simpson","summary":"\nBart is sent to a military school to be disciplined; Lisa, seeking a challenge, enrolls with him, but faces discrimination as the school\u0027s only girl cadet.    ","episodeNumber":0,"rating":7.8}]},{"number":9,"episodes":[{"title":"The City of New York vs. Homer Simpson","summary":"\nHomer must travel to New York to get his car back, which is illegally parked at World Trade Center Plaza.    ","episodeNumber":0,"rating":9.0},{"title":"The Principal and the Pauper","summary":"\nAt his 20th anniversary celebration as school principal, Principal Skinner is discovered to be an imposter of the real Seymour Skinner.    ","episodeNumber":0,"rating":6.9},{"title":"Lisa\u0027s Sax","summary":"\nHomer recounts the story of Bart\u0027s first day of school, which corresponds with the story of how Lisa got her saxophone.    ","episodeNumber":0,"rating":8.1},{"title":"Treehouse of Horror VIII","summary":"\nHomer battles mutants after Springfield is annihilated by a neutron bomb; Bart has his DNA mixed with a fly; Marge is revealed to be a witch in colonial Springfield.    ","episodeNumber":0,"rating":8.2},{"title":"The Cartridge Family","summary":"\nAfter a massive soccer riot, Homer purchases a gun to protect the family.    ","episodeNumber":0,"rating":8.2},{"title":"Bart Star","summary":"\nA damning report on childhood obesity in Springfield leads to the formation of a pee-wee football team. After belittling Ned Flanders, Homer ends up coaching the team, but his favoring of Bart makes him unpopular.    ","episodeNumber":0,"rating":7.7},{"title":"The Two Mrs. Nahasapeemapetilons","summary":"\nApu receives a letter from his mother stating that it\u0027s time for him fulfilled his arranged marriage obligation, he pretends Marge is his wife.    ","episodeNumber":0,"rating":7.7},{"title":"Lisa the Skeptic","summary":"\nTownspeople believe Lisa has unearthed the fossiled remains of a angel.    ","episodeNumber":0,"rating":8.1},{"title":"Realty Bites","summary":"\nMarge becomes a real-estate agent.    ","episodeNumber":0,"rating":7.6},{"title":"Miracle on Evergreen Terrace","summary":"\nWhen Bart accidentally burns down the family\u0027s Christmas tree and gifts, he claims that a robber stole everything. As a result, the town gets them a new tree and pitches in to raise funds.    ","episodeNumber":0,"rating":7.6},{"title":"All Singing, All Dancing","summary":"\nHomer is disappointed when the western he rented turns out to be a musical, so the family reminds him of the musical moments in the show\u0027s history.    ","episodeNumber":0,"rating":5.0},{"title":"Bart Carny","summary":"\nBart and Homer befriend two carnies and invite them to stay with them, but the carnies soon swindle the Simpsons out of their house.    ","episodeNumber":0,"rating":7.6},{"title":"The Joy of Sect","summary":"\nAn evil cult called the Movementarians brainwashes the citizens of Springfield and it\u0027s up to Marge to get them back.    ","episodeNumber":0,"rating":8.3},{"title":"Das Bus","summary":"\nWhile the kids become stranded on a desert island, Homer attempts to cash in on the Internet.    ","episodeNumber":0,"rating":8.2},{"title":"The Last Temptation of Krust","summary":"\nAfter a disastrous performance, Krusty changes his image and becomes an edgy stand-up.    ","episodeNumber":0,"rating":7.4},{"title":"Dumbbell Indemnity","summary":"\nHomer and Moe attempt insurance fraud so that Moe can support his new girlfriend. When Homer ends up in jail, Moe has to decide whether or not to come forward.    ","episodeNumber":0,"rating":7.6},{"title":"Lisa the Simpson","summary":"\nLisa fears she is losing her intelligence when she learns about the fabled Simpson gene. Meanwhile, Jasper freezes himself in the Kwik-E-Mart freezer.    ","episodeNumber":0,"rating":8.0},{"title":"This Little Wiggy","summary":"\nBart is reluctant to hang out with Ralph Wiggum, until he gains access to Chief Wiggum\u0027s master key to the city.    ","episodeNumber":0,"rating":7.8},{"title":"Simpson Tide","summary":"\nHomer causes an international incident after he joins the Naval reserves.    ","episodeNumber":0,"rating":8.1},{"title":"The Trouble with Trillions","summary":"\nHomer is forced to spy for the IRS after an audit. But when he is asked to retrieve a trillion dollar bill from Mr. Burns, he switches sides and the two flee to Cuba for refuge.    ","episodeNumber":0,"rating":7.8},{"title":"Girly Edition","summary":"\nBart and Lisa become locked in competition when they anchor a children\u0027s news program; Homer adopts a helper monkey.    ","episodeNumber":0,"rating":7.8},{"title":"Trash of the Titans","summary":"\nHomer becomes the sanitation commissioner for Springfield. His ineptitude pollutes the town and leads to a drastic solution.    ","episodeNumber":0,"rating":8.4},{"title":"King of the Hill","summary":"\nAfter humiliating Bart at a church picnic, Homer resolves to get in shape. Soon, he is contacted by an energy bar company that wants him to climb a mountain as a promotion.    ","episodeNumber":0,"rating":8.2},{"title":"Lost Our Lisa","summary":"\nLisa gets lost after she tries to take a bus to a museum.    ","episodeNumber":0,"rating":7.7},{"title":"Natural Born Kissers","summary":"\nHomer and Marge\u0027s attempt to spice up their marriage leads to the couple being chased naked through Springfield.    ","episodeNumber":0,"rating":8.0}]},{"number":10,"episodes":[{"title":"Lard of the Dance","summary":"\nHomer and Bart try to start their own grease business; Lisa organizes a school dance.    ","episodeNumber":0,"rating":7.6},{"title":"The Wizard of Evergreen Terrace","summary":"\nHomer\u0027s midlife crisis leads to a disastrous attempt at being an inventor.    ","episodeNumber":0,"rating":8.1},{"title":"Bart the Mother","summary":"\nWhen Bart accidentally kills a mother bird, he tries to make amends by raising the eggs.    ","episodeNumber":0,"rating":7.6},{"title":"Treehouse of Horror IX","summary":"\nHomer receives an evil hair transplant; Bart and Lisa get trapped in an Itchy and Scratchy cartoon; Maggie is revealed to be an alien.    ","episodeNumber":0,"rating":8.0},{"title":"When You Dish Upon a Star","summary":"\nHomer becomes a Hollywood insider when he befriends Alec Baldwin and Kim Basinger.    ","episodeNumber":0,"rating":7.2},{"title":"D\u0027oh-in\u0027 in the Wind","summary":"\nHomer becomes a hippie after a revelation about his middle name.    ","episodeNumber":0,"rating":7.5},{"title":"Lisa Gets an \u0027A\u0027","summary":"\nWhen Lisa cheats on a test, she has a moral crisis when her perfect score qualifies the school for grant money; Homer adopts a lobster as a pet.    ","episodeNumber":0,"rating":8.1},{"title":"Homer Simpson in: \u0027Kidney Trouble\u0027","summary":"\nHomer gets cold feet before a transplant operation which could save Grampa\u0027s life.    ","episodeNumber":0,"rating":7.3},{"title":"Mayored to the Mob","summary":"\nHomer deals with corruption when he becomes Mayor Quimby\u0027s bodyguard.    ","episodeNumber":0,"rating":8.1},{"title":"Viva Ned Flanders","summary":"\nWhen Homer takes Ned to Las Vegas in an attempt to get him to loosen up, the two end up drunkenly marrying a pair of cocktail waitresses.    ","episodeNumber":0,"rating":7.8},{"title":"Wild Barts Can\u0027t Be Broken","summary":"\nThe children of Springfield revolt after a curfew is enforced.    ","episodeNumber":0,"rating":7.7},{"title":"Sunday, Cruddy Sunday","summary":"\nHomer and his friends head to the Super Bowl, but are forced to sneak in when they discover their tickets are counterfeit.    ","episodeNumber":0,"rating":7.0},{"title":"Homer to the Max","summary":"\nHomer changes his name to \u0022Max Power\u0022 after discovering that he shares his name with a dimwitted TV character.    ","episodeNumber":0,"rating":7.7},{"title":"I\u0027m with Cupid","summary":"\nThe husbands of Springfield plot revenge after Apu outshines them on Valentine\u0027s Day.    ","episodeNumber":0,"rating":7.3},{"title":"Marge Simpson in: \u0027Screaming Yellow Honkers\u0027","summary":"\nMarge\u0027s new SUV gives her a potent case of road rage.    ","episodeNumber":0,"rating":7.3},{"title":"Make Room for Lisa","summary":"\nLisa feels that her relationship with her father will never be close, and she develops stress-induced stomach pains; Marge inadvertently knocks out Milhouse.    ","episodeNumber":0,"rating":7.5},{"title":"Maximum Homerdrive","summary":"\nHomer takes Bart with him on a cross-country delivery on behalf of a trucker who died before completing it; Marge and Lisa experience problems with their new novelty doorbell.    ","episodeNumber":0,"rating":7.7},{"title":"Simpsons Bible Stories","summary":"\nThree famous religious stories are retold Simpsons style as the family nods off at church.    ","episodeNumber":0,"rating":7.3},{"title":"Mom and Pop Art","summary":"\nHomer becomes the talk of the Springfield art community when a failed barbecue pit he worked on is mistaken for an art project.    ","episodeNumber":0,"rating":7.6},{"title":"The Old Man and the \u0027C\u0027 Student","summary":"\nBart is punished with community service at the Retirement Castle after he ruins Springfield\u0027s chances of hosting the Olympics.    ","episodeNumber":0,"rating":7.3},{"title":"Monty Can\u0027t Buy Me Love","summary":"\nWhen a wealthy man moves to Springfield, Mr. Burns begins to feel that he is losing his grasp on the citizens and decides to enlist the help of Homer.    ","episodeNumber":0,"rating":7.1},{"title":"They Saved Lisa\u0027s Brain","summary":"\nLisa is invited to join the Springfield chapter of MENSA and after Mayor Quimby flees, the group ends up running the city. Meanwhile, Homer poses for a series of erotic photos.    ","episodeNumber":0,"rating":7.3},{"title":"Thirty Minutes Over Tokyo","summary":"\nThe Simpsons must perform on a Japanese game show after Homer loses their money on a vacation.    ","episodeNumber":0,"rating":8.0}]},{"number":11,"episodes":[{"title":"Beyond Blunderdome","summary":"\nConvinced he\u0027s the only man with guts to tell him the truth, Mel Gibson insists Homer accompanies him in Hollywood to help fix his newest film project.    ","episodeNumber":0,"rating":7.3},{"title":"Brother\u0027s Little Helper","summary":"\nBart is put on medication to control his behavior, but the pills cause him to become paranoid and insane.    ","episodeNumber":0,"rating":7.5},{"title":"Guess Who\u0027s Coming to Criticize Dinner?","summary":"\nWhen Homer is hired as a local food critic by a newspaper in Springfield, he finds himself in deep trouble after his reviews turn out to be too critical.    ","episodeNumber":0,"rating":7.6},{"title":"Treehouse of Horror X","summary":"\nThe Simpsons attempt to cover up their accidental murder of Ned Flanders. Bart and Lisa acquire super powers. An electronic apocalypse threatens Springfield.    ","episodeNumber":0,"rating":7.8},{"title":"E-I-E-I-(Annoyed Grunt)","summary":"\nHomer cowards out of a pistol-duel and hides out with the rest of the family on a country farm.    ","episodeNumber":0,"rating":7.8},{"title":"Hello Gutter, Hello Fadder","summary":"\nHomer becomes a minor celebrity around Springfield after bowling a perfect game.    ","episodeNumber":0,"rating":7.3},{"title":"Eight Misbehavin\u0027","summary":"\nApu struggles with fatherhood after Manjula gives birth to octuplets.    ","episodeNumber":0,"rating":7.0},{"title":"Take My Wife, Sleaze","summary":"\nHomer\u0027s attempt at creating a motorcycle gang attracts a real gang, who kidnap Marge.    ","episodeNumber":0,"rating":7.1},{"title":"Grift of the Magi","summary":"\nA toy company purchases Springfield Elementary and uses the student body as a focus group for their new Christmas toy Funzo.    ","episodeNumber":0,"rating":7.3},{"title":"Little Big Mom","summary":"\nLisa finds out how rough Marge has it when her mom is in traction and she becomes the woman of the house. Homer and Bart\u0027s antics get her so worked up she conspires to teach them a lesson.    ","episodeNumber":0,"rating":7.4},{"title":"Faith Off","summary":"\nBart is led to believe he has special healing powers after a tent revival.    ","episodeNumber":0,"rating":6.8},{"title":"The Mansion Family","summary":"\nHomer receives responsibility for Mr. Burns\u0027 mansion when he is on leave and takes Burns\u0027 yacht to international waters to have a party.    ","episodeNumber":0,"rating":7.3},{"title":"Saddlesore Galactica","summary":"\nThe Simpsons get an abused horse and make him a contender in horse racing. Homer finds out a secret conspiracy about jockeys. Lisa tries to reach President Clinton when the results of a school band talent competition seem tainted.    ","episodeNumber":0,"rating":6.5},{"title":"Alone Again, Natura-Diddly","summary":"\nNed deals with his grief after Maude\u0027s untimely death.    ","episodeNumber":0,"rating":7.7},{"title":"Missionary: Impossible","summary":"\nWhen Homer is wanted dead for reneging on a 10,000 dollar pledge to PBS, Reverend Lovejoy sets him up for missionary work in the South Pacific until the heat dies down.    ","episodeNumber":0,"rating":7.3},{"title":"Pygmoelian","summary":"\nPlastic surgery not only transforms Moe the Bartender from ugly to hunky, it helps gets him a job on a hit daytime drama.    ","episodeNumber":0,"rating":7.3},{"title":"Bart to the Future","summary":"\nBart gets a glimpse of the future while the family is on vacation at an Indian casino.    ","episodeNumber":0,"rating":7.1},{"title":"Days of Wine and D\u0027oh\u0027ses","summary":"\nHomer doesn\u0027t like it when Barney quits drinking; Bart and Lisa get into trouble when they enter a photo contest for the new phone book cover.    ","episodeNumber":0,"rating":7.4},{"title":"Kill the Alligator and Run","summary":"\nFearing he only has three years to live, Homer takes the family on a vacation to Florida, where they become fugitives after seemingly killing a famous alligator.    ","episodeNumber":0,"rating":6.6},{"title":"Last Tap Dance in Springfield","summary":"\nLisa has difficulties learning to tap dance; Bart and Milhouse ditch summer camp to spend a week living in the mall.    ","episodeNumber":0,"rating":7.1},{"title":"It\u0027s a Mad, Mad, Mad, Mad Marge","summary":"\nEverybody loves the new Simpsons\u0027 house guest Becky. Except Marge, who thinks Becky wants to kill her.    ","episodeNumber":0,"rating":7.1},{"title":"Behind the Laughter","summary":"\nFans are invited to take a behind-the-scenes look at \u0022The Simpsons,\u0022 revisiting some of the most memorable experiences the family has been through.    ","episodeNumber":0,"rating":7.9}]},{"number":12,"episodes":[{"title":"Treehouse of Horror XI","summary":"\nHomer must do one good deed to get into Heaven; Bart and Lisa encounter a witch in a gingerbread house; Super-intelligent dolphins strike back at humanity.    ","episodeNumber":0,"rating":7.6},{"title":"A Tale of Two Springfields","summary":"\nSpringfield is split in two when Homer revolts because his area code is changed; the new town walls itself off from the neighbors.    ","episodeNumber":0,"rating":7.4},{"title":"Insane Clown Poppy","summary":"\nAfter he learns he has a daughter, Krusty turns to Homer for parenting advice.    ","episodeNumber":0,"rating":7.0},{"title":"Lisa the Treehugger","summary":"\nLisa\u0027s crush on an environmental activist inspires her to live in a tree threatened by loggers.    ","episodeNumber":0,"rating":7.2},{"title":"Homer vs. Dignity","summary":"\nDesperate for money, Homer accepts payment from Mr. Burns in exchange for humiliating himself.    ","episodeNumber":0,"rating":7.0},{"title":"The Computer Wore Menace Shoes","summary":"\nHomer\u0027s gossip website becomes a huge hit, but when his information runs out he resorts to making up news.    ","episodeNumber":0,"rating":7.7},{"title":"The Great Money Caper","summary":"\nThe whole town of Springfield conspires to teach Homer and Bart a lesson after the pair begin running confidence scams.    ","episodeNumber":0,"rating":7.3},{"title":"Skinner\u0027s Sense of Snow","summary":"\nA freak blizzard traps the students of Springfield Elementary inside their school. Their lives at stake, they are at the mercy of the rescue efforts of a woozy Homer and Ned.    ","episodeNumber":0,"rating":7.9},{"title":"HOMR","summary":"\nAn X-ray reveals a crayon lodged in Homer\u0027s brain. After the crayon is removed, Homer experiences a sudden surge in intelligence, making him closer to Lisa and isolated from his friends.    ","episodeNumber":0,"rating":8.1},{"title":"Pokey Mom","summary":"\nMarge befriends a convict with an artistic streak. Meanwhile, Homer battles the chiropractic industry after he creates a miracle back pain cure.    ","episodeNumber":0,"rating":7.1},{"title":"Worst Episode Ever","summary":"\nBart and Milhouse are left in charge of the comic book store after Comic Book Guy is hospitalized.    ","episodeNumber":0,"rating":7.4},{"title":"Tennis the Menace","summary":"\nHomer installs a tennis court in the backyard, but his lousy playing creates a rift in the family.    ","episodeNumber":0,"rating":6.8},{"title":"Day of the Jackanapes","summary":"\nWhen a new television game show grows in popularity and begins to draw away Krusty\u0027s TV audience e decided to retire from the television business.    ","episodeNumber":0,"rating":7.1},{"title":"New Kids on the Blecch","summary":"\nA music producer offers Bart and his friends a chance to participate in an up-and-coming boyband, but the boys are not up to it after making a discovery.    ","episodeNumber":0,"rating":7.2},{"title":"Hungry Hungry Homer","summary":"\nHomer is forced to go on a hunger strike by the Springfield Isotopes after uncovering a secret plan to have the baseball team moved to New Mexico.    ","episodeNumber":0,"rating":7.5},{"title":"Bye Bye Nerdy","summary":"\nProblems with a bully lead Lisa to examine just what makes bullies aggressive. Meanwhile, Homer gets into the baby-proofing business.    ","episodeNumber":0,"rating":6.7},{"title":"Simpson Safari","summary":"\nThe Simpsons win a trip to Africa after Homer finds a golden animal cracker from the 60\u0027s in the loft.    ","episodeNumber":0,"rating":6.8},{"title":"Trilogy of Error","summary":"\nHomer\u0027s rush to the hospital to re-attach his severed thumb, Lisa\u0027s rush to school to win the science fair, and Bart\u0027s run-in with an illegal fireworks scheme interconnect from their point of view.    ","episodeNumber":0,"rating":8.6},{"title":"I\u0027m Goin\u0027 to Praiseland","summary":"\nWith Homer\u0027s help, Flanders tries to establish a Christian theme park based on drawings in Maude\u0027s sketch book.    ","episodeNumber":0,"rating":7.2},{"title":"Children of a Lesser Clod","summary":"\nAfter a debilitating injury forces him to stay indoors, Homer begins a daycare center.    ","episodeNumber":0,"rating":7.2},{"title":"Simpsons Tall Tales","summary":"\nA hobo tells the Simpsons tall tales on a train ride to Delaware. In the first story, Homer is outcast from society as Paul Bunyan. Then, Lisa travels the country planting trees as Connie Appleseed. Finally, Bart and Nelson raft down the Mississippi as Tom Sawyer and Huck Finn.    ","episodeNumber":0,"rating":6.9}]},{"number":13,"episodes":[{"title":"Treehouse of Horror XII","summary":"\nA gypsy puts a curse on Homer; The Simpsons\u0027 new automated house malfunctions and tries to kill Homer; Bart and Lisa attend a school for wizards.    ","episodeNumber":0,"rating":7.6},{"title":"The Parent Rap","summary":"\nAfter Bart takes a joyride in a police car, a judge orders him to be tethered to Homer at all times.    ","episodeNumber":0,"rating":7.1},{"title":"Homer the Moe","summary":"\nHomer and his friends are forced to drink in the Simpsons\u0027 garage after Moe the Bartender renovates his shady bar into a hipster hangout.    ","episodeNumber":0,"rating":7.1},{"title":"A Hunka Hunka Burns in Love","summary":"\nMr. Burns falls in love with a younger woman and recruits Homer to help him impress her.    ","episodeNumber":0,"rating":7.1},{"title":"The Blunder Years","summary":"\nA hypnotist uncovers a traumatic experience from Homer\u0027s childhood.    ","episodeNumber":0,"rating":7.6},{"title":"She of Little Faith","summary":"\nHomer and Bart get careless with a model rocket and accidentally do damage to Springfield\u0027s church, but when Mr. Burns offers to commercialize it to repair the destruction, Lisa leaves Christianity behind to become a Buddhist.    ","episodeNumber":0,"rating":7.1},{"title":"Brawl in the Family","summary":"\nA social services officer brings unity to the Simpson family, but their newfound happiness is threatened when the cocktail waitress Homer married in Vegas shows up at their door.    ","episodeNumber":0,"rating":6.8},{"title":"Sweets and Sour Marge","summary":"\nMarge rallies for a ban on sugar after Springfield is declared America\u0027s fattest city.    ","episodeNumber":0,"rating":6.9},{"title":"Jaws Wired Shut","summary":"\nMarge can\u0027t deal with the quiet after Homer has his jaws wired shut.    ","episodeNumber":0,"rating":7.3},{"title":"Half-Decent Proposal","summary":"\nMarge\u0027s high school sweetheart Artie Ziff returns and offers Homer a million dollars to spend a weekend with Marge.    ","episodeNumber":0,"rating":7.3},{"title":"The Bart Wants What It Wants","summary":"\nBart breaks up with his new girlfriend Greta, but gets jealous when she begins dating Milhouse.    ","episodeNumber":0,"rating":7.0},{"title":"The Lastest Gun in the West","summary":"\nBart meets a retired cowboy movie star and convinces him to make a comeback on The Krusty the Clown Show.    ","episodeNumber":0,"rating":6.5},{"title":"The Old Man and the Key","summary":"\nAbe gets his driver\u0027s license back to impress a new woman at the retirement home.    ","episodeNumber":0,"rating":6.5},{"title":"Tales from the Public Domain","summary":"\nHomer reads three stories from an overdue library book, imagining himself as Odysseus, Lisa as Joan of Arc and Bart as Hamlet.    ","episodeNumber":0,"rating":7.2},{"title":"Blame It on Lisa","summary":"\nLisa sponsors an orphan in Brazil, and when he goes missing she convinces the family to go to Brazil to find him. While there, Homer is kidnapped.    ","episodeNumber":0,"rating":7.0},{"title":"Weekend at Burnsie\u0027s","summary":"\nAfter a traumatizing eye injury, Homer becomes a habitual user of medical marijuana.    ","episodeNumber":0,"rating":7.7},{"title":"Gump Roast","summary":"\nIn this clip show, the citizens of Springfield honor Homer Simpsons with a Roast, but the festivities take a turn for the worst when aliens crash it.    ","episodeNumber":0,"rating":5.4},{"title":"I Am Furious Yellow","summary":"\nBart\u0027s comic about Homer becomes a hit on-line, prompting Homer to attempt to control his anger.    ","episodeNumber":0,"rating":7.7},{"title":"The Sweetest Apu","summary":"\nApu\u0027s marriage is on the rocks after Manjula finds out he cheated on her.    ","episodeNumber":0,"rating":6.8},{"title":"Little Girl in the Big Ten","summary":"\nLisa pretends to be a college student when she befriends two college girls; Bart is forced to live in a plastic bubble after being bit by a mosquito.    ","episodeNumber":0,"rating":7.1},{"title":"The Frying Game","summary":"\nHomer and Marge find themselves on death row after they are framed for murder.    ","episodeNumber":0,"rating":7.0},{"title":"Papa\u0027s Got a Brand New Badge","summary":"\nHomer becomes chief of police after a scandal forces Wiggum out.    ","episodeNumber":0,"rating":7.8}]},{"number":14,"episodes":[{"title":"Treehouse of Horror XIII","summary":"\nHomer clones himself with a magic hammock; Zombie cowboys come back from the dead after Springfield bans guns; The Simpsons family take a vacation on an island where Dr. Hibbert can turn people into animals.    ","episodeNumber":0,"rating":7.6},{"title":"How I Spent My Strummer Vacation","summary":"\nWhen Homer is secretly videotaped complaining about his family in a taxi, they send him off to a rock and roll fantasy camp so he can try to live his dream.    ","episodeNumber":0,"rating":7.4},{"title":"Bart vs. Lisa vs. 3rd Grade","summary":"\nBart and Lisa are respectively held back and moved forward one grade, putting them in the same class.    ","episodeNumber":0,"rating":7.1},{"title":"Large Marge","summary":"\nMarge accidentally gets breast implants.    ","episodeNumber":0,"rating":7.1},{"title":"Helter Shelter","summary":"\nThe Simpsons family must participate in a reality television show in which they try to live in the same way that the families did in the 1800s.    ","episodeNumber":0,"rating":6.7},{"title":"The Great Louse Detective","summary":"\nHomer has to use Sideshow Bob in order to track down a potential assassin.    ","episodeNumber":0,"rating":7.3},{"title":"Special Edna","summary":"\nAfter Skinner once again has let Mrs. Krabappel down, Bart takes her to the cinema. To cheer her up, Bart nominates Krabappel for the \u0027teacher of the year\u0027 award. The nominations is accepted, and soon the Simpsons family and Mrs. Krabappel are going to the award ceremony in Orlando, Florida, where Skinner tries to get back Krabappel by asking her to marry him.    ","episodeNumber":0,"rating":7.0},{"title":"The Dad Who Knew Too Little","summary":"\nHomer hires a private detective to learn more about Lisa.    ","episodeNumber":0,"rating":7.3},{"title":"The Strong Arms of the Ma","summary":"\nMarge takes up body-building to boost her self-esteem after being mugged at the Kwik-E-Mart.    ","episodeNumber":0,"rating":6.8},{"title":"Pray Anything","summary":"\nHomer turns to religion to help him get what he wants, and is soon awarded the church in an injury settlement. Homer then turns the church into his personal party pad, and Reverend Lovejoy leaves Springfield to wallow in its hedonism.    ","episodeNumber":0,"rating":6.7},{"title":"Barting Over","summary":"\nAfter finding out Homer squandered his money from a baby commercial, Bart moves out into a loft, and meets skateboarding legend Tony Hawk.    ","episodeNumber":0,"rating":6.7},{"title":"I\u0027m Spelling as Fast as I Can","summary":"\nLisa participates in the Spellympics, but Homer is busy traveling cross-country as Krusty Burger test-markets a new sandwich. Lisa is confident that she will win, until she learns that the contest is rigged against her.    ","episodeNumber":0,"rating":7.2},{"title":"A Star Is Born Again","summary":"\nNed Flanders starts dating a famous movie star, but has difficulties with the tabloids following them everywhere.    ","episodeNumber":0,"rating":6.9},{"title":"Mr. Spritz Goes to Washington","summary":"\nThe family makes Krusty run for Congress because of air traffic being redirected to fly dangerously close to their house.    ","episodeNumber":0,"rating":6.8},{"title":"C.E.D\u0027oh","summary":"\nHomer takes over the power plant after tricking Mr. Burns into making him the official owner of the power plant.    ","episodeNumber":0,"rating":7.1},{"title":"\u0027Scuse Me While I Miss the Sky","summary":"\nLisa becomes interested in astronomy and starts fighting the light pollution which is preventing her from being able to enjoy her new hobby.    ","episodeNumber":0,"rating":7.1},{"title":"Three Gays of the Condo","summary":"\nWhen Homer finds an old note revealing Marge only married him because she was pregnant with Bart, he moves into a condo with two gay guys.    ","episodeNumber":0,"rating":7.2},{"title":"Dude, Where\u0027s My Ranch?","summary":"\nHomer writes a Christmas carol called \u0022Everybody Hates Ned Flanders,\u0022 which soon becomes so popular that the family decides to leave town for a while.    ","episodeNumber":0,"rating":6.9},{"title":"Old Yeller-Belly","summary":"\nHomer throws out Santa\u0027s Little Helper for not saving him from a fire, but soon the dog becomes Duff\u0027s new mascot.    ","episodeNumber":0,"rating":6.6},{"title":"Brake My Wife, Please","summary":"\nBecause of Homer losing his driver\u0027s license, Marge has to drive everyone everywhere, which is so stressful for her that she accidentally runs over Homer leading to the two seeing a marriage counselor.    ","episodeNumber":0,"rating":6.7},{"title":"The Bart of War","summary":"\nBart and Milhouse are forced into community service after destroying Flanders\u0027 memorial and join separate community groups, pitting themselves against each other.    ","episodeNumber":0,"rating":6.6},{"title":"Moe Baby Blues","summary":"\nAfter saving Maggie\u0027s life, Moe develops a special bond with her, much to Homer\u0027s dismay.    ","episodeNumber":0,"rating":7.6}]},{"number":15,"episodes":[{"title":"Treehouse of Horror XIV","summary":"\nFirst, Homer kills the Grim Reaper and takes his place in Reaper Madness. Then, Professor Frink\u0027s father is revived, only to kill people and steal their organs in Frinkenstein. Finally, Bart and Milhouse get a stop watch that can stop time in Stop the World, I Want To Goof Off.    ","episodeNumber":0,"rating":7.5},{"title":"My Mother the Carjacker","summary":"\nHomer\u0027s mother returns to Springfield, and the city pardons her from the charges against her. Mr Burns is furious about this and makes a plan to get Mona Simpson in prison.    ","episodeNumber":0,"rating":7.2},{"title":"The President Wore Pearls","summary":"\nLisa feuds with Principal Skinner after being elected school president.    ","episodeNumber":0,"rating":6.9},{"title":"The Regina Monologues","summary":"\nPrime minister Tony Blair welcomes the Simpsons to England where they run into author J.K. Rowling and actor Ian McKellen.    ","episodeNumber":0,"rating":7.0},{"title":"The Fat and the Furriest","summary":"\nAt the dump Homer is videotaped while being attacked by a bear. The town regards him a coward, so Homer decides to strike back at the bear.    ","episodeNumber":0,"rating":7.1},{"title":"Today, I Am a Clown","summary":"\nKrusty decides to do what he never did when he was thirteen years old - have a Bar Mitzvah.    ","episodeNumber":0,"rating":6.4},{"title":"\u0027Tis the Fifteenth Season","summary":"\nAfter spending all his money on an expensive gift for himself, and the family thinking he should be less of an egoist, Homer decides to change his ways.    ","episodeNumber":0,"rating":7.0},{"title":"Marge vs. Singles, Seniors, Childless Couples and Teens and Gays","summary":"\nA concert for babies ends in a riot, so the childless adults of Springfield gather to make the town less child-friendly.    ","episodeNumber":0,"rating":6.6},{"title":"I, (Annoyed Grunt)-Bot","summary":"\nHomer pretends to be a robot and competes in Robot Wars to win Bart\u0027s affection; Lisa has cat trouble.    ","episodeNumber":0,"rating":7.3},{"title":"Diatribe of a Mad Housewife","summary":"\nMarge is inspired to write a novel, but the storyline of the book (a fat, mean husband, and a handsome, sweet neighbor) makes Homer jealous.    ","episodeNumber":0,"rating":7.2},{"title":"Margical History Tour","summary":"\nMarge tells Lisa, Bart and Millhouse three history stories because the library doesn\u0027t have any.    ","episodeNumber":0,"rating":7.1},{"title":"Milhouse Doesn\u0027t Live Here Anymore","summary":"\nMilhouse moves to Capitol City, and therefore Lisa and Bart become best friends.    ","episodeNumber":0,"rating":7.2},{"title":"Smart \u0026 Smarter","summary":"\nWhen Maggie is revealed to have an IQ of 167, Lisa is no longer the genius of the family, causing a rivalry between the sisters.    ","episodeNumber":0,"rating":7.1},{"title":"The Ziff Who Came to Dinner","summary":"\nArtie Ziff is discovered hiding out in the Simpsons\u0027 attic.    ","episodeNumber":0,"rating":6.7},{"title":"Co-Dependent\u0027s Day","summary":"\nMarge takes up heavy drinking to spend more time with Homer. Bart and Lisa confront a famous movie director about the drop in quality his films have taken.    ","episodeNumber":0,"rating":6.7},{"title":"The Wandering Juvie","summary":"\nAfter playing a prank on the whole town, Bart is sentenced to six months of juvenile detention. There he meets Gina, who forces Bart to escape with her.    ","episodeNumber":0,"rating":7.0},{"title":"My Big Fat Geek Wedding","summary":"\nMrs. Krabapel falls for Comic Book Guy and they plan a Star Trek like wedding. Principal Skinner plans to prevent it.    ","episodeNumber":0,"rating":6.6},{"title":"Catch \u0027Em If You Can","summary":"\nHomer and Marge try to have a vacation without the kids but Bart and Lisa follow them everywhere they go.    ","episodeNumber":0,"rating":7.1},{"title":"Simple Simpson","summary":"\nHomer becomes a costumed vigilante who uses pies for weapons after witnessing Lisa get humiliated at a competition at the state fair.    ","episodeNumber":0,"rating":7.3},{"title":"The Way We Weren\u0027t","summary":"\nMarge and Homer find out that they actually kissed each other at age 10 without knowing they were each other\u0027s first kisses, and tell the story about this.    ","episodeNumber":0,"rating":7.2},{"title":"Bart-Mangled Banner","summary":"\nAn accidental photo showing Bart mooning the American flag makes the Simpsons the most hated family in town.    ","episodeNumber":0,"rating":6.3},{"title":"Fraudcast News","summary":"\nAfter Mr. Burns is erroneously reported as dead, he buys all of he media outlets in order to prevent them from writing scathing articles about him.    ","episodeNumber":0,"rating":7.2}]},{"number":16,"episodes":[{"title":"Treehouse of Horror XV","summary":"\nNed gains the power to foresee people\u0027s deaths; Maggie is shrunk inside a vitamin capsule and swallowed; Eliza Simpson and her sidekick hunt down a murderer.    ","episodeNumber":0,"rating":7.4},{"title":"All\u0027s Fair in Oven War","summary":"\nHomer buys Marge a new kitchen, and Marge likes cooking in the new kitchen so much she attends the Ovenfresh Bakeoff.    ","episodeNumber":0,"rating":6.9},{"title":"Sleeping with the Enemy","summary":"\nBecause she thinks her own children do not appreciate her anymore, Marge becomes a mother figure for Nelson.    ","episodeNumber":0,"rating":7.2},{"title":"She Used to Be My Girl","summary":"\nMarge becomes jealous when Lisa begins idolizing her old high school friend, Chloe Talbot, a famous reporter.    ","episodeNumber":0,"rating":6.5},{"title":"Fat Man and Little Boy","summary":"\nBart begins designing T-shirt slogans, and his T-shirts become very popular among the citizens of Springfield.    ","episodeNumber":0,"rating":7.0},{"title":"Midnight Rx","summary":"\nHomer goes to Canada with Apu and Ned to purchase Grampa\u0027s medication, but the three have problems getting home because the border guard thinks Apu is a terrorist.    ","episodeNumber":0,"rating":7.1},{"title":"Mommie Beerest","summary":"\nHomer gives Moe an enormous amount of money so he doesn\u0027t have to close down.    ","episodeNumber":0,"rating":6.9},{"title":"Homer and Ned\u0027s Hail Mary Pass","summary":"\nA video of Homer dancing becomes so popular that all major sports players hires Homer to design celebration dances for them.    ","episodeNumber":0,"rating":6.3},{"title":"Pranksta Rap","summary":"\nBart went to a rap concert Marge told him not to go to. In order to avoid punishment from Marge, he makes Marge and Homer believe he has been kidnapped.    ","episodeNumber":0,"rating":6.6},{"title":"There\u0027s Something About Marrying","summary":"\nA townsperson comes out of the closet when Springfield legalized same-sex marriages in a plot to bolster tourism; Homer uses the Internet to become a minister.    ","episodeNumber":0,"rating":6.9},{"title":"On a Clear Day I Can\u0027t See My Sister","summary":"\nAfter bullying her, Bart is restricted by court order to come too close to Lisa.    ","episodeNumber":0,"rating":6.7},{"title":"Goo Goo Gai Pan","summary":"\nSelma decides to adopt a child, so the whole family goes to China.    ","episodeNumber":0,"rating":7.0},{"title":"Mobile Homer","summary":"\nAfter a garage-cleaning accident, Marge wants Homer to get life insurance. Instead, the family gets an RV.    ","episodeNumber":0,"rating":6.8},{"title":"The Seven-Beer Snitch","summary":"\nSpringfield builds an opera house, but since no-one attends it they convert it into a prison. Old and forgotten laws are used to fill the prison, and therefore Homer goes to jail for kicking a can five times in a row. In jail, Homer becomes a snitch    ","episodeNumber":0,"rating":6.8},{"title":"Future-Drama","summary":"\nBart and Lisa see into the future where their lives have changed.    ","episodeNumber":0,"rating":7.3},{"title":"Don\u0027t Fear the Roofer","summary":"\nHomer meets a new friend, Ray the Roofer, but gets confined to a mental institution when his friends and family think he made him up.    ","episodeNumber":0,"rating":7.5},{"title":"The Heartbroke Kid","summary":"\nBart starts living on food from the new candy machine in school only, but he becomes so overweight that he has to go to a fat camp.    ","episodeNumber":0,"rating":7.1},{"title":"A Star Is Torn","summary":"\nLisa attends a singing competition for children, and Homer becomes her manager because of his skill to write songs that the crowd loves.    ","episodeNumber":0,"rating":6.7},{"title":"Thank God It\u0027s Doomsday","summary":"\nHomer hears about the Rapture, and by using numerology to calculate when the Rapture is coming he learns that it is only one week away.    ","episodeNumber":0,"rating":7.2},{"title":"Home Away from Homer","summary":"\nAfter Homer humiliates Ned Flanders, Ned, Rod, and Todd decides to leave Springfield and live in Humbleton, Pennsylvania.    ","episodeNumber":0,"rating":7.1},{"title":"The Father, the Son, and the Holy Guest Star","summary":"\nBart is expelled from Springfield Elementary, and Bart is therefore enrolled in St. Jerome\u0027s Catholic School.    ","episodeNumber":0,"rating":7.3}]},{"number":17,"episodes":[{"title":"The Bonfire of the Manatees","summary":"\nWhen Marge leaves Homer because he allowed an adult movie being shot in their house, she seeks self fulfillment in protecting manatees.    ","episodeNumber":0,"rating":6.2},{"title":"The Girl Who Slept Too Little","summary":"\nA new cemetery right outside the window of Lisa\u0027s room makes Lisa suffer from many sleepless nights.    ","episodeNumber":0,"rating":6.8},{"title":"Milhouse of Sand and Fog","summary":"\nWhen Kirk and Luann van Houten plan to get back together, Milhouse realizes they are too interested in each other, so he and Bart try to break them up, only for the plan to backfire and cause Homer and Marge to break up yet again.    ","episodeNumber":0,"rating":6.9},{"title":"Treehouse of Horror XVI","summary":"\nAn android son replaces Bart; Homer and friends are the quarry in Mr. Burns\u0027 hunting tournament; a witch turns townsfolk into their Halloween costumes.    ","episodeNumber":0,"rating":7.3},{"title":"Marge\u0027s Son Poisoning","summary":"\nMarge and Bart start spending more time together, and make a tradition of cycling to a tea house in a small village outside Springfield.    ","episodeNumber":0,"rating":6.9},{"title":"See Homer Run","summary":"\nWhen a recall election puts Mayor Quimby\u0027s job up for grabs, Homer seizes the opportunity to win office and gain his daughter\u0027s love.    ","episodeNumber":0,"rating":6.8},{"title":"The Last of the Red Hat Mamas","summary":"\nMilhouse tutors Lisa in Italian, and Marge joins the Cheery Red Tomatoes, a group that plans to rob Mr. Burns of one million dollars worth of Fabergé eggs.    ","episodeNumber":0,"rating":6.6},{"title":"The Italian Bob","summary":"\nThe Simpsons become lost in Italy, finding their way to a small town that Sideshow Bob has become the mayor of.    ","episodeNumber":0,"rating":7.1},{"title":"Simpsons Christmas Stories","summary":"\nHomer tells the tale of the first Christmas ever, while Grandpa pursues his decade-old feud with Santa.    ","episodeNumber":0,"rating":6.8},{"title":"Homer\u0027s Paternity Coot","summary":"\nWhen a frozen mailman from the 60\u0027s is found in a Springfield glacier, doubts arise about whether Abe really is Homer\u0027s father.    ","episodeNumber":0,"rating":6.6},{"title":"We\u0027re on the Road to D\u0027ohwhere","summary":"\nWhen Homer is on his way to Vegas to meet up with his friends, he has to make a detour to take Bart to an education camp. Meanwhile, Marge has discovered a surprising source of income.    ","episodeNumber":0,"rating":6.9},{"title":"My Fair Laddy","summary":"\nBart and Lisa bet whether Lisa can turn Groundskeeper Willie into a proper gentleman.    ","episodeNumber":0,"rating":6.5},{"title":"The Seemingly Never-Ending Story","summary":"\nIn this story within a story within a story within a story, a cave-exploring expedition, an angry sheep and a lovestruck Moe become inextricably entwined.    ","episodeNumber":0,"rating":7.6},{"title":"Bart Has Two Mommies","summary":"\nMarge starts babysitting the Flanders boys, leading Homer to spend more time with Bart and Lisa. Bart gets kidnapped by a lonely movie chimpanzee.    ","episodeNumber":0,"rating":7.0},{"title":"Homer Simpson, This Is Your Wife","summary":"\nAs part of a new Fox show, the Simpsons participate in a wife-swap.    ","episodeNumber":0,"rating":6.5},{"title":"Million Dollar Abie","summary":"\nAfter blowing Springfield\u0027s chances for an NFL franchise, Grandpa goes to an assisted-suicide center, then becomes a bullfighter.    ","episodeNumber":0,"rating":6.3},{"title":"Kiss Kiss, Bang Bangalore","summary":"\nHomer gets sent to India when the power plant is relocated there. Selma and Patty kidnap Richard Dean Anderson after he spurns their MacGyver fan club.    ","episodeNumber":0,"rating":7.2},{"title":"The Wettest Stories Ever Told","summary":"\nWhile waiting for the dinner at the Frying Dutchman, the family starts telling three stories about ships: \u0022Journey on the Mayflower\u0022, \u0022Mutiny on the Bounty\u0022, and \u0022The Neptune Adventure\u0022.    ","episodeNumber":0,"rating":6.7},{"title":"Girls Just Want to Have Sums","summary":"\nSpringfield Elementary is divided into two separate schools (one for boys, one for girls) following Principal Skinner\u0027s demotion. Concerned that the boys are receiving a higher standard of education, Lisa disguises herself as a boy.    ","episodeNumber":0,"rating":7.1},{"title":"Regarding Margie","summary":"\nAfter hitting her head on a stool Marge suffers from amnesia. Slowly but surely memories are starting to come back, except memories about Homer.    ","episodeNumber":0,"rating":6.7},{"title":"The Monkey Suit","summary":"\nAfter seeing a museum exhibit on evolution, in which creation is labeled a myth, an outraged Ned Flanders teams with Reverend Lovejoy to blackmail Principal Skinner into requiring creationism to be taught in classrooms, eventually at the expense of any mention of evolution. Lisa becomes outraged herself, and forms a student organization to teach evolution, leading to a creationism vs. evolution trial, a la Inherit the Wind.    ","episodeNumber":0,"rating":7.1},{"title":"Homer and Marge Turn a Couple Play","summary":"\nMarge and Homer try their luck at celebrity marriage counselling.    ","episodeNumber":0,"rating":6.4}]},{"number":18,"episodes":[{"title":"The Mook, the Chef, the Wife and Her Homer","summary":"\nWhen Fat Tony has to take a time-out due to a whacking attempt, Homer and Bart take over the business.    ","episodeNumber":0,"rating":7.6},{"title":"Jazzy \u0026 The Pussycats","summary":"\nLisa becomes depressed when Bart becomes a better jazz musician than her. So she decides to set up an animal shelter in the Simpsons\u0027 attic.    ","episodeNumber":0,"rating":6.7},{"title":"Please Homer, Don\u0027t Hammer \u0027Em","summary":"\nMarge begins her own carpentry business, but Homer becomes the face of the business because nobody will take a female carpenter seriously. And Bart uses Principal Skinner\u0027s peanut allergy to his advantage.    ","episodeNumber":0,"rating":6.8},{"title":"Treehouse of Horror XVII","summary":"\nA meteorite turns Homer into a rampaging blob with a voracious appetite; Bart brings a Golem to life; an alien invasion hoax turns real.    ","episodeNumber":0,"rating":6.8},{"title":"G.I. (Annoyed Grunt)","summary":"\nHomer is duped into signing up for the Army, and his hijinks after basic training ultimately results in a military occupation of Springfield.    ","episodeNumber":0,"rating":6.8},{"title":"Moe\u0027N\u0027a Lisa","summary":"\nLisa helps Moe become a distinguished poet, but she turns on him when he takes all the credit for his newfound greatness.    ","episodeNumber":0,"rating":6.7},{"title":"Ice Cream of Margie (with the Light Blue Hair)","summary":"\nHomer becomes an ice cream man after being fired from the plant, and Marge uses his leftover Popsicle sticks to create folk art figures.    ","episodeNumber":0,"rating":6.9},{"title":"The Haw-Hawed Couple","summary":"\nBart and Nelson become best friends, but Bart surprisingly discovers that the fringe benefits aren\u0027t worth Nelson\u0027s neediness.    ","episodeNumber":0,"rating":7.2},{"title":"Kill Gil, Vol. 1 \u0026 2","summary":"\nThe Simpsons let Gil stay with them during Christmas. However, he stays for 11 months because Marge can\u0027t tell him \u0022no.\u0022    ","episodeNumber":0,"rating":6.3},{"title":"The Wife Aquatic","summary":"\nHomer returns Marge to Barnacle Bay, where she spent her beloved summer vacations. But when they get there, they discover that it is no longer a tourist spot.    ","episodeNumber":0,"rating":6.6},{"title":"Revenge Is a Dish Best Served Three Times","summary":"\nWhile Homer tries to get revenge on a driver who cut him off, his family warns him of the folly of revenge by telling stories based on \u0022The Count of Monte Cristo,\u0022 \u0022Revenge of the Nerds,\u0022 and \u0022Batman.\u0022    ","episodeNumber":0,"rating":7.0},{"title":"Little Big Girl","summary":"\nLisa embellishes her family heritage as Native American for a school project; Bart gets a driver\u0027s license and develops a relationship with an older girl.    ","episodeNumber":0,"rating":6.7},{"title":"Springfield Up","summary":"\nA parody of the \u0022Up Series\u0022 of British documentaries, in which a filmmaker follows Homer and his friends from grade school into their 40s.    ","episodeNumber":0,"rating":7.3},{"title":"Yokel Chords","summary":"\nIn this parody of The Sound of Music (1965), Lisa becomes a tutor for Cletus\u0027 seven children, until Krusty tries to exploit them as entertainers. Meanwhile, Bart becomes emotionally attached to his school-appointed psychiatrist.    ","episodeNumber":0,"rating":6.8},{"title":"Rome-old and Juli-eh","summary":"\nSelma and Grampa fall in love and end up getting married, a marriage both Homer and Patty are against.    ","episodeNumber":0,"rating":6.3},{"title":"Homerazzi","summary":"\nHomer becomes a successful Paparazzi, but Springfield\u0027s celebrities decide to get their revenge on him.    ","episodeNumber":0,"rating":7.1},{"title":"Marge Gamer","summary":"\nMarge decides to find out what their Internet has to offer and soon gets hooked on an online role-playing game; Homer referees Lisa\u0027s soccer game.    ","episodeNumber":0,"rating":7.3},{"title":"The Boys of Bummer","summary":"\nBart becomes the most hated person in Springfield after he is the goat in a championship baseball game, and Homer\u0027s new job as a mattress salesman ruins his and Marge\u0027s sex life.    ","episodeNumber":0,"rating":6.0},{"title":"Crook and Ladder","summary":"\nHomer, Moe, Apu and Principal Skinner become volunteer firefighters. But just because they\u0027re not getting paid doesn\u0027t mean that they can\u0027t find a way to receive compensation.    ","episodeNumber":0,"rating":6.9},{"title":"Stop, or My Dog Will Shoot!","summary":"\nHomer unwittingly drags the family into a cornfield maze after attempting to leave a boring Harvest fest that Marge brought them to. When everyone except Homer escapes, Santa\u0027s Little Helper rescues him and becomes the town hero. So the Simpsons enroll him in Police Dog Academy where he\u0027s teamed with Lou.    ","episodeNumber":0,"rating":6.8},{"title":"24 Minutes","summary":"\nBart and Lisa join forces to stop the school bullies from setting off a stink bomb at the school bake sale.    ","episodeNumber":0,"rating":8.1},{"title":"You Kent Always Say What You Want","summary":"\nAfter Kent Brockman is fired as a news anchor, he and Lisa use the Internet to expose the Fox News Conspiracy.    ","episodeNumber":0,"rating":7.2}]},{"number":19,"episodes":[{"title":"He Loves to Fly and He D\u0027ohs","summary":"\nHomer falls in love with private planes after taking a flight to Chicago with Mr. Burns. So Marge hires Homer a \u0022life manager\u0022 to help him think positively and find a job that will allow him to fly for a living.    ","episodeNumber":0,"rating":6.6},{"title":"Homer of Seville","summary":"\nHomer becomes an opera star after an injury improves his singing voice. His newfound popularity forces him to hire a personal assistant, who turns out to be an obsessed stalker.    ","episodeNumber":0,"rating":6.5},{"title":"Midnight Towboy","summary":"\nHomer becomes the most hated man in town after he becomes a tow truck driver, and Marge teaches Maggie to not be an over-dependent baby.    ","episodeNumber":0,"rating":7.1},{"title":"I Don\u0027t Wanna Know Why the Caged Bird Sings","summary":"\nMarge promises to visit a convicted bank robber in prison, but is afraid to follow through. But when the convict escapes from prison, Marge is the first person he pays a visit to.    ","episodeNumber":0,"rating":6.7},{"title":"Treehouse of Horror XVIII","summary":"\nThe eighteenth Simpsons Halloween Special features parodies of the movies \u0022E.T.\u0022 and \u0022Mr. and Mrs. Smith.\u0022    ","episodeNumber":0,"rating":6.9},{"title":"Little Orphan Millie","summary":"\nMilhouse\u0027s parents are lost at sea, which causes him to become a troubled loner. But his new persona makes him the new most popular kid at school, which sparks jealousy in Bart.    ","episodeNumber":0,"rating":6.6},{"title":"Husbands and Knives","summary":"\nWhen Marge becomes a successful businesswoman, Homer becomes worried that she will dump him for a trophy husband. Therefore, he decides to have plastic surgery to make himself look like a hunk.    ","episodeNumber":0,"rating":6.9},{"title":"Funeral for a Fiend","summary":"\nBart is responsible for Sideshow Bob\u0027s death after his latest attempt at revenge is foiled, but is his death actually part of the plan?    ","episodeNumber":0,"rating":7.1},{"title":"Eternal Moonshine of the Simpson Mind","summary":"\nHomer goes to Dr. Frink to help him recover his memories from the night before, and he discovers, based on his interpretation of the memories, that Marge is having an affair.    ","episodeNumber":0,"rating":8.2},{"title":"E Pluribus Wiggum","summary":"\nSpringfield becomes the site of the first presidential primary. The townspeople soon get sick of all of the presidential candidates sucking up to them, and decide to support their own write-in candidate: Ralph Wiggum.    ","episodeNumber":0,"rating":6.8},{"title":"That \u002790s Show","summary":"\nHomer and Marge tell the kids about their life in the early 1990s before they were born, when Marge was enrolled in Springfield College and Homer was the lead singer of a grunge rock band.    ","episodeNumber":0,"rating":6.3},{"title":"Love, Springfieldian Style","summary":"\nA series of romantic Valentine\u0027s Day parodies based on \u0022Bonnie and Clyde,\u0022 \u0022Lady and the Tramp,\u0022 and \u0022Sid and Nancy.\u0022    ","episodeNumber":0,"rating":6.5},{"title":"The DeBarted","summary":"\nThe new prankster in Bart\u0027s fourth grade class actually turns out to be a mole brought in by Principal Skinner to infiltrate Bart\u0027s inner circle. Homer falls in love with his loaner car after Marge wrecks their old one.    ","episodeNumber":0,"rating":7.6},{"title":"Dial \u0027N\u0027 for Nerder","summary":"\nOne of Bart\u0027s pranks results in Martin\u0027s death, but Lisa doesn\u0027t want him to confess because she would be considered an accomplice. Marge hires a television crew to find out if Homer is cheating on his diet.    ","episodeNumber":0,"rating":7.4},{"title":"Smoke on the Daughter","summary":"\nMarge has Lisa take up ballet, mainly to have Lisa live out her own childhood dreams. Lisa then succumbs to peer pressure from her ballet mates and takes up smoking. Meanwhile, Homer and Bart try to start their own beef jerky business.    ","episodeNumber":0,"rating":6.6},{"title":"Papa Don\u0027t Leech","summary":"\nWhen the Simpsons discover that Lurleen Lumpkin is on the skids, Marge reluctantly agrees to take her in and help her find her deadbeat dad who abandoned her 30 years ago.    ","episodeNumber":0,"rating":6.1},{"title":"Apocalypse Cow","summary":"\nBart tries to save the cow he raised for his 4-H club from the slaughterhouse, and in the process winds up getting accidentally engaged to one of Cletus\u0027s daughters.    ","episodeNumber":0,"rating":6.8},{"title":"Any Given Sundance","summary":"\nLisa\u0027s documentary about her family is accepted into the Sundance Film Festival. However, her family gets upset with her when they discover that the film is far from flattering.    ","episodeNumber":0,"rating":7.0},{"title":"Mona Leaves-a","summary":"\nHomer\u0027s mom dies, and as part of her will, she asks him to spread her ashes. However, her request turns out to be part of her final act of rebellion against the system.    ","episodeNumber":0,"rating":7.0},{"title":"All About Lisa","summary":"\nIn a parody of \u0022All About Eve,\u0022 Lisa stabs Krusty in the back, takes his job, and wins a prestigious award. Meanwhile, Homer and Bart take up coin collecting.    ","episodeNumber":0,"rating":6.4}]},{"number":20,"episodes":[{"title":"Sex, Pies and Idiot Scrapes","summary":"\nHomer and Ned go into business together as bounty hunters, and Marge takes a job at an erotic bakery.    ","episodeNumber":0,"rating":7.2},{"title":"Lost Verizon","summary":"\nBart gets in trouble with Marge after she finds out that he has Denis Leary\u0027s cell phone and is using it to make prank phone calls.    ","episodeNumber":0,"rating":6.8},{"title":"Double, Double, Boy in Trouble","summary":"\nBart trades lives with his multi-millionaire lookalike, but discovers that his lookalike\u0027s life isn\u0027t all he thought it would be.    ","episodeNumber":0,"rating":6.8},{"title":"Treehouse of Horror XIX","summary":"\nThe Simpsons\u0027 19th Halloween Special, with parodies of \u0022Transformers,\u0022 \u0022Mad Men,\u0022 and \u0022It\u0027s the Great Pumpkin, Charlie Brown.\u0022    ","episodeNumber":0,"rating":7.1},{"title":"Dangerous Curves","summary":"\nThe Simpsons take a Fourth of July vacation to a cabin hotel, which cause Homer and Marge to reminisce about two episodes from their past where they stayed in the cabin.    ","episodeNumber":0,"rating":6.6},{"title":"Homer and Lisa Exchange Cross Words","summary":"\nHomer gets a job breaking up couples, and Lisa becomes an expert crossword puzzle solver, but Homer bets against her in a competition.    ","episodeNumber":0,"rating":7.1},{"title":"MyPods and Boomsticks","summary":"\nHomer suspects that the family of Bart\u0027s new Muslim friend from Jordan is part of a terrorist plot, and Lisa becomes obsessed with her new MyPod.    ","episodeNumber":0,"rating":7.1},{"title":"The Burns and the Bees","summary":"\nMr. Burns wins a professional basketball team in a poker game, and the new arena he plans to have Springfield build for the team threatens to interfere with Lisa\u0027s new bee sanctuary.    ","episodeNumber":0,"rating":6.5},{"title":"Lisa the Drama Queen","summary":"\nLisa and her new best friend create their own fantasy world, but Marge doesn\u0027t want Lisa to see her friend anymore after she finds out that they\u0027re too far gone in it.    ","episodeNumber":0,"rating":6.0},{"title":"Take My Life, Please","summary":"\nHomer finds out that he actually won the senior class president election, and he gets an opportunity to find out how his life would have been different if it had happened.    ","episodeNumber":0,"rating":6.9},{"title":"How the Test Was Won","summary":"\nBart and his fellow underachievers are taken on a \u0022field trip\u0022 to Capital City so that they can miss the standardized test, and Homer makes sure that nothing bad happens until their insurance goes back into effect.    ","episodeNumber":0,"rating":7.0},{"title":"No Loan Again, Naturally","summary":"\nThe Simpsons lose their house, but Flanders buys it and offers to rent it back to them. But when they turn out to be less-than-reliable renters, Flanders kicks them out.    ","episodeNumber":0,"rating":6.8},{"title":"Gone Maggie Gone","summary":"\nIn order to rescue Maggie from a Catholic orphanage, Lisa must solve a series of puzzles to reveal the identity of a gem that will bring peace to Springfield.    ","episodeNumber":0,"rating":7.2},{"title":"In the Name of the Grandfather","summary":"\nThe Simpsons take Grandpa to Ireland so he can go back to visit a pub he went to during the war, but Grandpa and Homer get suckered into buying the bar.    ","episodeNumber":0,"rating":6.3},{"title":"Wedding for Disaster","summary":"\nHomer is kidnapped moments before he and Marge are supposed to re-renew their vows. However, Marge comes to the conclusion that Homer left her at the altar.    ","episodeNumber":0,"rating":6.6},{"title":"Eeny Teeny Maya Moe","summary":"\nMoe begins dating a little person he met on the Internet, while Maggie is being bullied at the playground next to Moe\u0027s where Homer is leaving her.    ","episodeNumber":0,"rating":7.2},{"title":"The Good, the Sad and the Drugly","summary":"\nBart gets Milhouse to take the rap for a prank at school, and then blows him off when he falls for a cute 5th grade do-gooder, prompting Milhouse\u0027s wrath. Meanwhile, Lisa begins taking \u0022happy pills\u0022 to improve her negative outlook.    ","episodeNumber":0,"rating":7.2},{"title":"Father Knows Worst","summary":"\nHomer becomes a \u0022helicopter parent\u0022 at Springfield Elementary by helping Bart finish a class project and helping Lisa become popular, and Marge finds a secret sauna in their house.    ","episodeNumber":0,"rating":6.9},{"title":"Waverly Hills, 9021-D\u0027Oh","summary":"\nThe Simpsons set up a fake residence in Waverly Hills so that Bart and Lisa can attend school there.    ","episodeNumber":0,"rating":7.1},{"title":"Four Great Women and a Manicure","summary":"\nA series of parodies based on four strong women: Queen Elizabeth, Snow White, Lady MacBeth, and Ayn Rand.    ","episodeNumber":0,"rating":6.4},{"title":"Coming to Homerica","summary":"\nTownspeople build a wall around Springfield to keep \u0022immigrants\u0022 from Ogdenville from relocating to their town.    ","episodeNumber":0,"rating":7.2}]},{"number":21,"episodes":[{"title":"Homer the Whopper","summary":"\nA Hollywood studio makes a movie based on Comic Book Guy\u0027s comic book character \u0022Everyman,\u0022 and Homer is cast in the lead. However, Homer\u0027s weight fluctuations cause problems for the production.    ","episodeNumber":0,"rating":7.1},{"title":"Bart Gets a \u0027Z\u0027","summary":"\nWhen Bart\u0027s prank gets Ms. Krabappel fired from Springfield Elementary School, he tries to make it up to her without letting her know that he was responsible.    ","episodeNumber":0,"rating":6.6},{"title":"The Great Wife Hope","summary":"\nMarge takes on the owner of an ultimate fighting league in the ring in order to get the sport banned in Springfield.    ","episodeNumber":0,"rating":6.3},{"title":"Treehouse of Horror XX","summary":"\nLisa becomes livid with Miss Hoover, and in a series of homages to classic Hitchcock sets out for deadly revenge. Next, Krusty\u0027s latest fast-food sandwich transforms news anchor Kent Brockman into an enraged zombie and twenty-eight days later, cannibal zombies have overrun Springfield. In the final frightening fable, Homer accidentally falls through a trapdoor in Moe\u0027s tavern and impales himself on the pipes of Moe\u0027s microbrewery. Moe serves the barflies a glass of delicious beer flavored with Homer\u0027s blood and Homer, now half-man, half-brewing apparatus, returns for ...    ","episodeNumber":0,"rating":7.3},{"title":"The Devil Wears Nada","summary":"\nMarge rediscovers her sexuality after appearing in a racy calendar, but Homer is too tired to respond to her advances because he is being worked to death by his new boss, Carl.    ","episodeNumber":0,"rating":6.7},{"title":"Pranks and Greens","summary":"\nBart meets the boy responsible for the greatest prank in Springfield Elementary School history, and discovers that he\u0027s now a 19-year-old loser. Meanwhile, Marge is scolded for providing unhealthy snacks for Maggie\u0027s play group.    ","episodeNumber":0,"rating":6.6},{"title":"Rednecks and Broomsticks","summary":"\nHomer becomes an expert on moonshine when he starts hanging out with Cletus after he saves the Simpsons\u0027 lives, while Lisa becomes friends with three teenage Wiccans.    ","episodeNumber":0,"rating":6.7},{"title":"Oh Brother, Where Bart Thou?","summary":"\nBart becomes jealous of Maggie and Lisa\u0027s special bond as sisters, so he goes to an orphanage and \u0022adopts\u0022 a little brother.    ","episodeNumber":0,"rating":7.0},{"title":"Thursdays with Abie","summary":"\nHomer becomes jealous when a syndicated newspaper columnist begins publishing Grandpa\u0027s stories, while Bart is assigned to take care of the class\u0027s stuffed sheep for the weekend.    ","episodeNumber":0,"rating":6.7},{"title":"Once Upon a Time in Springfield","summary":"\nThe antagonism between Krusty and the new female co-star forced upon him soon turns to romance, while a headhunter encourages Homer, Lenny and Carl to take a job at another nuclear power plant.    ","episodeNumber":0,"rating":6.5},{"title":"Million Dollar Maybe","summary":"\nHomer can\u0027t tell Marge he won the lottery because he was supposed to be giving a wedding toast when he bought the ticket. But Bart soon finds out where he\u0027s hiding the money and begins to blackmail him.    ","episodeNumber":0,"rating":7.1},{"title":"Boy Meets Curl","summary":"\nHomer and Marge become members of the U.S. Olympic curling team. At the games, Lisa becomes addicted to collecting pins, and Bart tries to save her.    ","episodeNumber":0,"rating":6.8},{"title":"The Color Yellow","summary":"\nWhile searching for an admirable ancestor for a class project, Lisa discovers the story of a relative named Eliza Simpson, who may or may not have helped a slave escape to freedom.    ","episodeNumber":0,"rating":6.6},{"title":"Postcards from the Wedge","summary":"\nWhen Bart unsuccessfully tries to play Homer and Marge against each other, he comes up with a dangerous prank that is sure to get their attention.    ","episodeNumber":0,"rating":7.0},{"title":"Stealing First Base","summary":"\nBart gets Springfield Elementary School in legal trouble when he kisses the enigmatic daughter of two lawyers, while Lisa is depressed about being ostracized because she is smart.    ","episodeNumber":0,"rating":7.0},{"title":"The Greatest Story Ever D\u0027ohed","summary":"\nNed takes the Simpsons on a pilgrimage to Israel in order to try and save Homer, but soon discovers that he may not be worth saving.    ","episodeNumber":0,"rating":5.7},{"title":"American History X-cellent","summary":"\nMr Burns is sent to prison for art theft, where a scary inmate introduces him to religion. Meanwhile Smithers becomes the boss at the plant, and Bart and Lisa try to share an ant farm.    ","episodeNumber":0,"rating":6.5},{"title":"Chief of Hearts","summary":"\nHomer and Chief Wiggum\u0027s new friendship is put to the test when the chief becomes needy after being shot, while Marge suspects that Bart may be dealing drugs.    ","episodeNumber":0,"rating":6.8},{"title":"The Squirt and the Whale","summary":"\nAfter a violent storm, Lisa tries to rally the townspeople and come to the rescue of a beached whale.    ","episodeNumber":0,"rating":6.8},{"title":"To Surveil, with Love","summary":"\nSpringfield covers the town with surveillance cameras after Homer creates a bomb scare at the train station. Meanwhile, Lisa considers becoming a brunette so that people will take her more seriously.    ","episodeNumber":0,"rating":7.1},{"title":"Moe Letter Blues","summary":"\nHomer, Apu and Reverend Lovejoy all suspect that Moe may have left with one of their wives after receiving a mysterious letter, but which one is it?    ","episodeNumber":0,"rating":7.0},{"title":"The Bob Next Door","summary":"\nBart is convinced that the Simpsons\u0027 new friendly, unassuming neighbor is actually Sideshow Bob in disguise.    ","episodeNumber":0,"rating":7.3},{"title":"Judge Me Tender","summary":"\nMoe\u0027s gruff and abrasive personality makes him the perfect hyper-critical judge, and lands him a spot on American Idol. Meanwhile, Homer makes Marge uncomfortable when he starts spending more time at home with Moe\u0027s now closed.    ","episodeNumber":0,"rating":6.5}]},{"number":22,"episodes":[{"title":"Elementary School Musical","summary":"\nWhile Homer and Bart accompany Krusty to Oslo so he can receive the Nobel Peace Prize, Marge enrolls Lisa for a week in performing arts camp.    ","episodeNumber":0,"rating":6.2},{"title":"Loan-a Lisa","summary":"\nLisa uses the $50 she receives from Grandpa to give Nelson a microloan to jump-start his bicycle business, but soon comes to regret the decision.    ","episodeNumber":0,"rating":6.7},{"title":"MoneyBart","summary":"\nLisa takes over as manager of Bart\u0027s baseball team and uses statistical analysis to build a winner, but she takes all of the fun out of it and causes Bart to quit the team.    ","episodeNumber":0,"rating":6.7},{"title":"Treehouse of Horror XXI","summary":"\nA Satanic board game causes other popular board games to come to life, Homer and Marge rescue a possible killer and let him on their boat, and a parody of \u0022Twilight\u0022 where Lisa falls for a young vampire.    ","episodeNumber":0,"rating":7.1},{"title":"Lisa Simpson, This Isn\u0027t Your Life","summary":"\nWhen Lisa discovers that Marge was also a model student, she tries to find out where everything changed so that she doesn\u0027t repeat her mistakes. Meanwhile, a series of chance accidents cause Bart to replace Nelson as school bully.    ","episodeNumber":0,"rating":7.2},{"title":"The Fool Monty","summary":"\nAfter Mr. Burns finds out that he is dying, he has an accident and loses his memory, and all the townspeople use the situation to get their revenge on him.    ","episodeNumber":0,"rating":6.5},{"title":"How Munched Is That Birdie in the Window?","summary":"\nBart adopts a carrier pigeon, but Santa\u0027s Little Helper eats it.    ","episodeNumber":0,"rating":6.3},{"title":"The Fight Before Christmas","summary":"\nMarge gets depressed when the rest of the family does not get into the holiday spirit, and she writes a letter, hoping to get some help; Mr. Burns and Moe\u0027s new friend delay the Simpsons as they attempt to travel to Hawaii for the holiday.    ","episodeNumber":0,"rating":6.7},{"title":"Donnie Fatso","summary":"\nHomer goes to prison after attempting to get out of a series of fines with a bribe, but agrees to a reduced sentence by informing on Fat Tony for the FBI.    ","episodeNumber":0,"rating":7.0},{"title":"Moms I\u0027d Like to Forget","summary":"\nBart sets out to uncover the origins of a sword-shaped scar on his hand; Marge reconnects with three friends she fell out with years ago.    ","episodeNumber":0,"rating":6.3},{"title":"Flaming Moe","summary":"\nMoe tries to keep his \u0027straightness\u0027 a secret when he opens a gay bar; Skinner falls for a new teacher.    ","episodeNumber":0,"rating":6.7},{"title":"Homer the Father","summary":"\nHomer picks up parenting advice from an 80s sitcom; Bart becomes involved in trading nuclear secrets.    ","episodeNumber":0,"rating":6.9},{"title":"The Blue and the Gray","summary":"\nMoe employs Homer as his wing man, only to find Homer has more luck with the ladies than he does; Marge finds her first gray hair.    ","episodeNumber":0,"rating":6.7},{"title":"Angry Dad: The Movie","summary":"\nBart\u0027s \u0022Angry Dad\u0022 character gets his own movie, but when the movie starts winning awards, Homer tries to hog all the credit.    ","episodeNumber":0,"rating":7.2},{"title":"The Scorpion\u0027s Tale","summary":"\nLisa\u0027s school project leads to the discovery of a new drug that makes the elderly less cranky and more tolerable.    ","episodeNumber":0,"rating":6.6},{"title":"A Midsummer\u0027s Nice Dreams","summary":"\nAfter Tommy Chong walks away from the Cheech \u0026 Chong reunion tour, Homer goes on the road as his replacement. Meanwhile, Marge tries to help the cat lady with her hoarding problem.    ","episodeNumber":0,"rating":6.0},{"title":"Love Is a Many Strangled Thing","summary":"\nThe tables are turned for Homer and Bart after a therapist cures Homer of his violent tendencies toward the boy.    ","episodeNumber":0,"rating":6.2},{"title":"The Great Simpsina","summary":"\nThe family is greeted by folk singer Ewell Freestone when they visit a peach farm, but when Marge goes overboard with peach-inspired dishes, Lisa and Bart try to get rid of the unwanted fruit. Later, Lisa becomes a magician\u0027s apprentice to the legendary Great Raymondo who helps her develop her craft, but a schoolgirl crush clouds her judgment when she is coaxed into revealing the Great Raymondo\u0027s most famous magic trick to his phony archnemesis. But when the rival magician\u0027s act takes a risky turn, the Great Raymondo has one last trick up his sleeve and stages ...    ","episodeNumber":0,"rating":6.8},{"title":"The Real Housewives of Fat Tony","summary":"\nSelma falls in love with and marries Fat Tony, and Lisa discovers that Bart has a skill for finding truffles.    ","episodeNumber":0,"rating":6.5},{"title":"Homer Scissorhands","summary":"\nHomer opens his own salon after he discovers that he has skills as a hair stylist, and Lisa becomes suspicious after Millhouse gets a 5th grade girlfriend.    ","episodeNumber":0,"rating":7.1},{"title":"500 Keys","summary":"\nWhile Homer takes the Duff Blimp for a joyride, Lisa discovers a secret room in the basement of Sprinfield Elementary School.    ","episodeNumber":0,"rating":7.3},{"title":"The Ned-Liest Catch","summary":"\nWhen Krabbapple gets suspended and put into detention after hurting Bart, Bart tries to break her out, but it ends that Flanders is the one that saves her life. But soon, Ned figures out that Edna has also dated other men such as Homer, Skinner Comic Book Guy and Aerosmith drummer Joey Kramer.    ","episodeNumber":0,"rating":6.9}]},{"number":23,"episodes":[{"title":"The Falcon and the D\u0027Ohman","summary":"\nHomer tries to befriend the new security guard at the nuclear power plant, who for some unknown reason isn\u0027t interested and keeps having flashbacks to his violent past as a government agent.    ","episodeNumber":0,"rating":7.1},{"title":"Bart Stops to Smell the Roosevelts","summary":"\nSuperintendant Chalmers gets fired after using unconventional methods to teach Bart and his friends about Teddy Roosevelt, so the boys take over Springfield Elementary until he gets his old job back.    ","episodeNumber":0,"rating":7.0},{"title":"Treehouse of Horror XXII","summary":"\nHomer takes a dangerous dive into an isolated canyon on Candy Peak, but when a crashing boulder traps his arm, he channels Aron Ralston to save himself. In \u0022The Diving Bell and Butterball,\u0022 the first of three hair-raising Halloween tales, a venomous spider bite leaves Homer paralyzed, but when Lisa discovers Homer\u0027s ability to communicate through natural gases, he is able to express his love for Marge. The killer spells continue in \u0022Dial D for Diddly,\u0022 when Ned Flanders, devout preacher by day, transforms into a cold-blooded vigilante by night. In the final terrifying...    ","episodeNumber":0,"rating":6.4},{"title":"Replaceable You","summary":"\nHomer is betrayed by his new assistant at work and winds up working for her, and Bart and Martin create a science project that brings joy to the seniors at the Springfield Retirement Castle.    ","episodeNumber":0,"rating":6.4},{"title":"The Food Wife","summary":"\nHomer is worried that he is no longer the cool parent after Marge, Bart, and Lisa become foodies.    ","episodeNumber":0,"rating":7.1},{"title":"The Book Job","summary":"\nHomer and Bart put together a team to author the next successful tween novel franchise and make a million dollars, but discover that they need Lisa\u0027s help to pull it off.    ","episodeNumber":0,"rating":7.9},{"title":"The Man in the Blue Flannel Pants","summary":"\nHomer gets promoted to accounts manager at the nuclear power plant, but soon learns the job robs you of your soul. Meanwhile, Lisa introduces Bart to \u0022Little Women.\u0022    ","episodeNumber":0,"rating":6.6},{"title":"The Ten-Per-Cent Solution","summary":"\nKrusty the Clown is stuck in a rut when the television network pulls his show from the air and his talent agency drops him as a client. But when the Simpsons introduce him to seasoned agent Annie, they are surprised to learn that Annie was Krusty\u0027s very first agent. Despite their rocky relationship, Annie is convinced to re-sign Krusty and craft his career comeback. But when Krusty\u0027s retro comedy show reboot is deemed a critical success, Krusty must decide to stay with his agent or side with the network executives.    ","episodeNumber":0,"rating":6.1},{"title":"Holidays of Future Passed","summary":"\nThirty years in the future the Simpsons get together for Christmas. Bart and Lisa are struggling as parents to connect with their children.    ","episodeNumber":0,"rating":8.3},{"title":"Politically Inept, with Homer Simpson","summary":"\nHomer becomes the host of a popular political talk show, starts an \u0022everyman\u0022 movement in Springfield, and ends up hand-picking Ted Nugent as the Republican nominee for president.    ","episodeNumber":0,"rating":6.0},{"title":"The D\u0027oh-cial Network","summary":"\nLisa creates an online social network that becomes a Springfield obsession, but later becomes a victim of user backlash.    ","episodeNumber":0,"rating":6.9},{"title":"Moe Goes from Rags to Riches","summary":"\nWhile Bart tries to regain Milhouse\u0027s friendship, Moe\u0027s bar cleaning rag tells his unlikely story of how he got to where he is today.    ","episodeNumber":0,"rating":5.7},{"title":"The Daughter Also Rises","summary":"\nLisa falls for an adventurous, Hemingway-esque young boy, while Bart and Millhouse set out to bust all the myths that surround Springfield Elementary School.    ","episodeNumber":0,"rating":6.3},{"title":"At Long Last Leave","summary":"\nThe town votes to kick the Simpsons out of Springfield, so they decide to move to the Outlands.    ","episodeNumber":0,"rating":6.9},{"title":"Exit Through the Kwik-E-Mart","summary":"\nBart becomes an urban vandal and decides to use Homer as his inspiration, while Apu hits hard times when a new trendy market takes all the Kwik-E-Mart customers.    ","episodeNumber":0,"rating":6.8},{"title":"How I Wet Your Mother","summary":"\nThe family break into Homer\u0027s dreams Inception-style after he begins wetting the bed.    ","episodeNumber":0,"rating":7.2},{"title":"Them, Robot","summary":"\nMr. Burns replaces all of the nuclear plant employees with robots--except for Homer, who stays along to supervise the robots and serve as a human scapegoat.    ","episodeNumber":0,"rating":6.9},{"title":"Beware My Cheating Bart","summary":"\nJimbo\u0027s girlfriend cheats on Jimbo with Bart, and Homer uses his new treadmill to catch up on a TV series about plane crash victims stranded on an island.    ","episodeNumber":0,"rating":7.1},{"title":"A Totally Fun Thing Bart Will Never Do Again","summary":"\nBart gets the family to take the cruise vacation of his dreams, and then launches a fiendish plot to ensure that it goes on forever.    ","episodeNumber":0,"rating":7.6},{"title":"The Spy Who Learned Me","summary":"\nHomer uses his paid sick leave to improve his marriage, with the help of his imaginary friend, super-spy Stradivarius Cain. Meanwhile, Bart gets revenge on Nelson for stealing everyone\u0027s lunch money.    ","episodeNumber":0,"rating":6.8},{"title":"Ned \u0027N Edna\u0027s Blend Agenda","summary":"\nAfter Ned and Edna announce publicly that they were secretly married, the two clash over how to raise Rod and Todd.    ","episodeNumber":0,"rating":6.6},{"title":"Lisa Goes Gaga","summary":"\nAfter a desperate attempt by Lisa to become more popular backfires, Lady Gaga shows up in Springfield to help her with her self-esteem.    ","episodeNumber":0,"rating":4.0}]},{"number":24,"episodes":[{"title":"Moonshine River","summary":"\nThe Simpsons go back to New York City so that Bart can find his old girlfriend Mary Spuckler. Meanwhile, Lisa and Marge spend the trip trying to take in New York culture on the cheap.    ","episodeNumber":0,"rating":6.3},{"title":"Treehouse of Horror XXIII","summary":"\nA black hole threatens to swallow Springfield, Homer tries to find the source of paranormal activity, and a \u0022Back to the Future\u0022 parody in which Bart keeps Marge from marrying Homer.    ","episodeNumber":0,"rating":7.2},{"title":"Adventures in Baby-Getting","summary":"\nMarge decides that she wants another baby, but Homer doesn\u0027t want one. Meanwhile, Bart tries to figure out where Lisa is secretly going after school.    ","episodeNumber":0,"rating":6.8},{"title":"Gone Abie Gone","summary":"\nHomer invests Lisa\u0027s college fund on an online poker site. Meanwhile Abe disappears from the Springfield Retirement Castle.    ","episodeNumber":0,"rating":6.7},{"title":"Penny-Wiseguys","summary":"\nFat Tony has to serve jury duty, and his clerk, Dan, must run the mafia while he\u0027s gone. Meanwhile, Lisa considers making a disgusting change to her diet.    ","episodeNumber":0,"rating":6.3},{"title":"A Tree Grows in Springfield","summary":"\nHomer becomes addicted to his new tablet computer. But when it is destroyed Homer becomes despondent, until he finds and provides hope for Springfield in the most unlikely place.    ","episodeNumber":0,"rating":6.3},{"title":"The Day the Earth Stood Cool","summary":"\nHomer befriends a hipster and invites his family to move in next door. However, their friendship soon sours as Springfield is transformed into a haven for \u0022coolness.\u0022    ","episodeNumber":0,"rating":6.9},{"title":"To Cur with Love","summary":"\nWhen Homer shows no remorse over almost losing Santa\u0027s Little Helper, Grandpa tells everyone the story of Homer\u0027s childhood dog.    ","episodeNumber":0,"rating":7.2},{"title":"Homer Goes to Prep School","summary":"\nHomer joins the \u0022Springfield Preppers,\u0022 an off-the-grid survivalist group whose leader has set up a top-secret retreat outside of town to prepare for the end of the world.    ","episodeNumber":0,"rating":6.7},{"title":"A Test Before Trying","summary":"\nThe fate of Springfield Elementary rests on Bart and his test scores, and Homer finds way to make money with his own parking meter.    ","episodeNumber":0,"rating":6.9},{"title":"Changing of the Guardian","summary":"\nHomer and Marge find the perfect young couple and ask them to be the guardians for the kids in case something happens to them.    ","episodeNumber":0,"rating":6.4},{"title":"Love Is a Many Splintered Thing","summary":"\nMary Spuckler returns to Springfield and begins a relationship with Bart. However, Bart treats her with disrespect.    ","episodeNumber":0,"rating":6.2},{"title":"Hardly Kirk-ing","summary":"\nBart poses Millhouse as his father so that they can do adult activities, and Homer becomes skilled at finding lost objects thanks to Highlights magazine.    ","episodeNumber":0,"rating":7.0},{"title":"Gorgeous Grampa","summary":"\nHomer\u0027s obsession with the TV show \u0022Storage Battles\u0022 leads the family to discover Grampa\u0027s past identity as \u0022Gorgeous Godfrey,\u0022 the most feared, villainous man in pro-wrestling history    ","episodeNumber":0,"rating":6.2},{"title":"Black-Eyed, Please","summary":"\nNed gets fed up with Homer and punches him in the eye, and Lisa is a bullying victim from her new substitute teacher.    ","episodeNumber":0,"rating":6.9},{"title":"Dark Knight Court","summary":"\nWhen Bart is accused of a prank he says he didn\u0027t commit, Lisa is forced to defend him in youth court, with former attorney general Janet Reno serving as judge.    ","episodeNumber":0,"rating":7.0},{"title":"What Animated Women Want","summary":"\nHomer contemplates his next move after getting in the doghouse with Marge, while Millhouse\u0027s new Stanley Kowalski-inspired persona makes him suddenly attractive to Lisa.    ","episodeNumber":0,"rating":6.4},{"title":"Pulpit Friction","summary":"\nSpringfield gets a bedbug scare, the new assistant pastor at church appoints Homer as a deacon, and Marge loses her wedding dress.    ","episodeNumber":0,"rating":6.4},{"title":"Whiskey Business","summary":"\nA new makeover could put Moe in a position to make big money, Bart fails at his job of taking care of Grandpa, and Lisa fights the shameless exploitation of Bleeding Gums Murphy\u0027s likeness.    ","episodeNumber":0,"rating":6.7},{"title":"The Fabulous Faker Boy","summary":"\nBart takes piano lessons from a cute Russian girl, Marge tries to teach the girl\u0027s father how to drive, and Homer loses the last of his hair.    ","episodeNumber":0,"rating":6.2},{"title":"The Saga of Carl","summary":"\nHomer, Moe, Lenny and Carl win the lottery, but Carl steals the ticket and leaves with the money for Iceland.    ","episodeNumber":0,"rating":7.0},{"title":"Dangers on a Train","summary":"\nWhen Marge tries to buy Homer snack cakes for their anniversary, she winds up meeting a married man who shares a common love of British television.    ","episodeNumber":0,"rating":7.0}]},{"number":25,"episodes":[{"title":"Homerland","summary":"\nHomer returns from a nuclear power convention a changed man, and Lisa begins to suspect that he has become a domestic terrorist.    ","episodeNumber":0,"rating":6.8},{"title":"Treehouse of Horror XXIV","summary":"\nThe scariest Simpsons Halloween show yet, featuring an opening by Guillermo Del Toro.    ","episodeNumber":0,"rating":6.9},{"title":"Four Regrettings and a Funeral","summary":"\nWhile attending a funeral, Homer, Marge, Mr. Burns, and Kent Brockman recall a past regret and try to find a way to rectify the situation.    ","episodeNumber":0,"rating":6.4},{"title":"YOLO","summary":"\nHomer is stunned to learn he\u0027ll only live once. A pen pal from his youth helps him live that life to its fullest. Meanwhile Springfield Elementary institutes an honor code.    ","episodeNumber":0,"rating":6.5},{"title":"Labor Pains","summary":"\nHomer helps take care of a child that he delivered in an elevator, and Lisa tries to organize the Springfield Atoms cheerleaders against the team\u0027s greedy owner.    ","episodeNumber":0,"rating":6.8},{"title":"The Kid Is All Right","summary":"\nLisa is distressed when she discovers that her new friend is a Republican, and they wind up running against each other as Springfield Elementary\u0027s second grade representative.    ","episodeNumber":0,"rating":6.4},{"title":"Yellow Subterfuge","summary":"\nPrincipal Skinner promises the students that the best-behaved can take a ride in a submarine. Bart believes his past indiscretions will be forgotten. Lisa tries to help Krusty by suggesting him to sell the foreign rights to his shows.    ","episodeNumber":0,"rating":6.8},{"title":"White Christmas Blues","summary":"\nWhen a sudden tourist spike means that the family cannot afford Christmas, the Simpsons open up their house to boarders.    ","episodeNumber":0,"rating":6.4},{"title":"Steal This Episode","summary":"\nFed up with the high price of Hollywood films, Homer begins screening pirated movies in his backyard, but is busted by the FBI after Marge turns him in.    ","episodeNumber":0,"rating":7.7},{"title":"Married to the Blob","summary":"\nComic Book Guy seeks romantic advice from Homer when he falls for a Japanese woman who\u0027s interested in manga.    ","episodeNumber":0,"rating":6.9},{"title":"Specs and the City","summary":"\nMr. Burns\u0027 Christmas present to his employees, a pair of augmented reality glasses, places a strain on Homer and Marge\u0027s relationship. Meanwhile, Bart wrestles with giving a Valentine\u0027s Day card to Nelson.    ","episodeNumber":0,"rating":7.1},{"title":"Diggs","summary":"\nBart becomes friends with a schoolmate who enjoys falconry, but turns out to be mentally disturbed.    ","episodeNumber":0,"rating":6.3},{"title":"The Man Who Grew Too Much","summary":"\nLisa becomes friends with Sideshow Bob, who now has a new job working with genetically-altered foods. Meanwhile, Marge becomes frustrated teaching abstinence for the church.    ","episodeNumber":0,"rating":6.6},{"title":"The Winter of His Content","summary":"\nWhen Abe and two of his friends move in with the Simpsons after the Springfield Retirement Castle closes, Homer begins to embrace their lifestyle. Meanwhile, Nelson initiates Bart into the bully group after coming to his defense.    ","episodeNumber":0,"rating":6.6},{"title":"The War of Art","summary":"\nThe friendship between the Simpsons and the Van Houtens is challenged when a painting the Simpsons buy from the Van Houtens\u0027 yard sale is discovered to be extremely valuable.    ","episodeNumber":0,"rating":6.8},{"title":"You Don\u0027t Have to Live Like a Referee","summary":"\nHomer becomes a referee for the World Cup and finds himself tested by bribers when the Simpsons travel to Brazil.    ","episodeNumber":0,"rating":6.7},{"title":"Luca$","summary":"\nMarge becomes worried when Lisa starts dating a competitive eater-in-training, while Bart receives gifts from Snake Jailbird for helping him out.    ","episodeNumber":0,"rating":6.3},{"title":"Days of Future Future","summary":"\nThirty years into the future, Bart is having trouble dealing with his divorce, Lisa is struggling with her marriage to Milhouse, and Marge is finally fed up after burying yet another Homer clone.    ","episodeNumber":0,"rating":7.0},{"title":"What to Expect When Bart\u0027s Expecting","summary":"\nBart becomes a savior to Springfield couples trying to conceive when he inadvertently uses voodoo to get his art teacher pregnant.    ","episodeNumber":0,"rating":5.8},{"title":"Brick Like Me","summary":"\nThe Lego version of Homer begins to suspect that his entire Lego world is not real when a toy triggers a flashback to an alternate reality.    ","episodeNumber":0,"rating":7.9},{"title":"Pay Pal","summary":"\nWhen Homer ruins his and Marge\u0027s chances of making a new couple friend, Marge decides to concentrate on finding a friend for Lisa. However, Lisa suddenly makes a new friend on her own.    ","episodeNumber":0,"rating":6.6},{"title":"The Yellow Badge of Cowardge","summary":"\nBart wins the annual \u0022last day of school\u0022 race - with a little help from Nelson - and Homer attempts to bring back 4th of July fireworks, which have been canceled due to low budget cuts.    ","episodeNumber":0,"rating":6.6}]},{"number":26,"episodes":[{"title":"Clown in the Dumps","summary":"\nKrusty has a crisis of conscience and retires from show business after his father dies before ever approving of his career. Meanwhile, Lisa becomes worried about Homer\u0027s health and life expectancy.    ","episodeNumber":0,"rating":5.7},{"title":"The Wreck of the Relationship","summary":"\nHomer and Bart turn to the open seas to improve their relationship, and Marge becomes a trash talking victim after she drafts Homer\u0027s fantasy football team.    ","episodeNumber":0,"rating":6.7},{"title":"Super Franchise Me","summary":"\nMarge opens a sandwich franchise store after her sandwiches become a huge hit at Springfield Elementary. But running day-to-day at the store proves challenging, especially when the same franchise opens another location across the street.    ","episodeNumber":0,"rating":6.4},{"title":"Treehouse of Horror XXV","summary":"\nThe 25th annual \u0027Simpsons\u0027 Halloween special includes an alternate dimension, a \u0022Clockwork Orange\u0022-style gang led by Moe and a visit from the Tracey Ullman-era Simpsons.    ","episodeNumber":0,"rating":7.4},{"title":"Opposites A-Frack","summary":"\nAn Assemblywoman brought in by Lisa to stop Mr. Burns\u0027 fracking operation ends up falling for him as much as he does for her.    ","episodeNumber":0,"rating":6.3},{"title":"Simpsorama","summary":"\nThe Simpsons meet the Planet Express crew, who have come to Springfield in the present to stop them from destroying the future.    ","episodeNumber":0,"rating":7.9},{"title":"Blazed and Confused","summary":"\nBart tricks his family into a camping trip at a strange event known as \u0022Blazing Guy\u0022 so that he can get revenge on his sadistic new fourth grade teacher.    ","episodeNumber":0,"rating":6.8},{"title":"Covercraft","summary":"\nHomer forms a cover band with other dads in town when he takes up bass guitar to deal with a mid-life crisis, but the band\u0027s modest success is soon overwhelmed by Apu\u0027s breakout potential.    ","episodeNumber":0,"rating":6.4},{"title":"I Won\u0027t Be Home for Christmas","summary":"\nMarge kicks Homer out of the house for Christmas after he consoles Moe on Christmas Eve instead of going home.    ","episodeNumber":0,"rating":6.8},{"title":"The Man Who Came to Be Dinner","summary":"\nAn amusement park ride takes the Simpsons to the home planet of Kang and Kodos.    ","episodeNumber":0,"rating":6.6},{"title":"Bart\u0027s New Friend","summary":"\nHomer is hypnotized into believing he\u0027s ten years old and ends up stuck in his new age when the hypnotist dies, so he bonds with Bart and refuses to take back the responsibilities of adulthood.    ","episodeNumber":0,"rating":7.1},{"title":"The Musk Who Fell to Earth","summary":"\nInventor Elon Musk comes to Springfield, and Homer inspires him with a new idea that could revolutionize Springfield, but winds up costing Mr. Burns a ton of money.    ","episodeNumber":0,"rating":5.5},{"title":"Walking Big \u0026 Tall","summary":"\nMarge tries to get Homer to lose weight. But instead, he finds a support group that encourages him to embrace his largeness.    ","episodeNumber":0,"rating":6.2},{"title":"My Fare Lady","summary":"\nMarge gets a job as a driver for a transportation app service, while Moe is forced to work as a janitor at the nuclear plant after Homer causes the bar to go bankrupt.    ","episodeNumber":0,"rating":6.5},{"title":"The Princess Guide","summary":"\nMoe falls in love with a Nigerian princess whose father is working out a uranium deal with Mr. Burns.    ","episodeNumber":0,"rating":6.4},{"title":"Sky Police","summary":"\nThe congregation, led by Marge, is forced to resort to gambling in order to collect money to fix the church, which Chief Wiggum destroyed with a jet pack he received by mistake.    ","episodeNumber":0,"rating":6.7},{"title":"Waiting for Duffman","summary":"\nAfter \u0022Duffman\u0022 retires, Homer wins a reality competition to become his replacement. But his contract states that he cannot drink beer, which gives him a new perspective on alcohol.    ","episodeNumber":0,"rating":6.6},{"title":"Peeping Mom","summary":"\nMarge decides to follow Bart everywhere until he confesses to being involved in a bulldozer crash. Meanwhile, Homer ignores Santa\u0027s Little Helper when Ned gets a new dog.    ","episodeNumber":0,"rating":6.6},{"title":"The Kids Are All Fight","summary":"\nThe story of Bart and Lisa\u0027s rivalry is told when Homer finds an old film strip.    ","episodeNumber":0,"rating":6.7},{"title":"Let\u0027s Go Fly a Coot","summary":"\nBart takes up smoking e-cigarettes to impress Milhouse\u0027s cousin Annika while the rest of the family learns about Grampa\u0027s days in the Air Force.    ","episodeNumber":0,"rating":6.0},{"title":"Bull-E","summary":"\nBart gets bullied at a school dance, so Marge gets an anti-bullying law passed, which results in Homer being put in therapy for bulling Ned.    ","episodeNumber":0,"rating":6.5},{"title":"Mathlete\u0027s Feat","summary":"\nGroundskeeper Willie becomes the coach of the mathletes, Lisa and other kids from Springfield Elementary compete against Waverly Hills Elementary.    ","episodeNumber":0,"rating":6.7}]},{"number":27,"episodes":[{"title":"Every Man\u0027s Dream","summary":"\nMarge decides it\u0027s finally time to separate from Homer, and quickly moves on with her life. Homer is initially devastated, but soon stumbles into a romance with a younger woman.    ","episodeNumber":0,"rating":5.7},{"title":"\u0027Cue Detective","summary":"\nA celebrity television chef challenges Homer to a barbecue cook-off. But before the competition, Homer\u0027s new, prized barbecue grill is stolen.    ","episodeNumber":0,"rating":6.5},{"title":"Puffless","summary":"\nPatty and Selma try to quit smoking, but Patty moves in with the Simpsons when Selma takes it up again. Meanwhile, Maggie goes on an adventure with some local creatures.    ","episodeNumber":0,"rating":6.9},{"title":"Halloween of Horror","summary":"\nThe Simpsons are proud to be the most festively decorated house on the block. But when Lisa is traumatized at Krustyland Horror Night, she feels she cannot handle Halloween anymore.    ","episodeNumber":0,"rating":7.5},{"title":"Treehouse of Horror XXVI","summary":"\nAfter killing Bart, Sideshow Bob doesn\u0027t know what to do with himself; Homer wakes up with short-term memory loss; Because of radiation, Lisa, Bart and Milhouse gain super-powers.    ","episodeNumber":0,"rating":6.5},{"title":"Friend with Benefit","summary":"\nLisa makes a new friend at school - Harper, who happens to be super-rich, while Homer makes friends with Harper\u0027s dad and sets out to continue living the good life when Lisa decides to end the friendship.    ","episodeNumber":0,"rating":6.6},{"title":"Lisa with an \u0022S\u0022","summary":"\nBroadway legend Laney Fontaine transforms Lisa into a show-biz kid after Homer loses her chance at band camp.    ","episodeNumber":0,"rating":5.9},{"title":"Paths of Glory","summary":"\nLisa tries to restore the reputation of a forgotten Springfield female inventor, while Bart takes full advantage of a diagnosis that he is a sociopath.    ","episodeNumber":0,"rating":6.7},{"title":"Barthood","summary":"\nA tale of Bart\u0027s journey from youth to adulthood, where he is constantly in search of approval from his father and in the shadow of his more-successful younger sister.    ","episodeNumber":0,"rating":8.4},{"title":"The Girl Code","summary":"\nWhen Homer loses his job due to Marge\u0027s social media post, he begins working as a dishwasher at a Greek restaurant. Meanwhile, Lisa creates an app that can predict the effect any post on social media will have.    ","episodeNumber":0,"rating":6.5},{"title":"Teenage Mutant Milk-Caused Hurdles","summary":"\nBart and Principal Skinner battle over the affection of Bart\u0027s new teacher, and a new milk-based product that Homer buys from the Kwik-E-Mart causes big changes in Bart and Lisa.    ","episodeNumber":0,"rating":6.5},{"title":"Much Apu About Something","summary":"\nApu\u0027s nephew makes big changes when he takes over the Kwik-E-Mart business, and Bart decides that he\u0027s through with being bad after his latest prank spirals out of control.    ","episodeNumber":0,"rating":6.5},{"title":"Love Is in the N2-O2-Ar-CO2-Ne-He-CH4","summary":"\nProfessor Frink\u0027s new invention turns him into a ladies\u0027 man, while a new pill at the Springfield Retirement Castle causes Grandpa to hallucinate back to his happiest moments.    ","episodeNumber":0,"rating":6.3},{"title":"Gal of Constant Sorrow","summary":"\nLisa tries to launch the career of a homeless Appalachian folk singer, but Bart warns her that she will just let her down. Meanwhile, Homer tries to rescue the cat, who is trapped in the walls of the house.    ","episodeNumber":0,"rating":6.4},{"title":"Lisa the Veterinarian","summary":"\nLisa takes a job as veterinarian\u0027s assistant, but soon lets the responsibilities of the job get to her head. Meanwhile, Marge decides to take a job as a crime scene cleaner.    ","episodeNumber":0,"rating":6.3},{"title":"The Marge-ian Chronicles","summary":"\nLisa signs up for an opportunity to be part of a mission to colonize Mars in ten years, and Homer\u0027s strategy to use reverse psychology to talk her out of it backfires.    ","episodeNumber":0,"rating":7.0},{"title":"The Burns Cage","summary":"\nHomer tries to raise Smithers\u0027 spirits by finding him a man, and Lisa gets the lead in the school production of \u0022Casablanca\u0022 alongside a new male student, sparking Millhouse\u0027s jealousy.    ","episodeNumber":0,"rating":6.3},{"title":"How Lisa Got Her Marge Back","summary":"\nAfter Lisa overhears Marge say that she doesn\u0027t like Lisa\u0027s jazz music, Marge takes Lisa on a trip to Capitol City to regain her friendship. Meanwhile, Bart uses Maggie as his new partner in crime for his practical jokes.    ","episodeNumber":0,"rating":6.2},{"title":"Fland Canyon","summary":"\nMaggie will not go to sleep, so Homer tells her a bedtime story about when the Simpsons and the Flanders went to the Grand Canyon together.    ","episodeNumber":0,"rating":7.1},{"title":"To Courier with Love","summary":"\nAfter promising Marge the trip of a lifetime, Homer makes a deal with a travel agent to be a courier of a top-secret briefcase in exchange for a discounted family vacation to Paris.    ","episodeNumber":0,"rating":6.6},{"title":"Simprovised","summary":"\nWhile trying to overcome a fear of public speaking, Homer creates an improv comedy troupe; Marge rebuilds Bart\u0027s treehouse.    ","episodeNumber":0,"rating":6.2},{"title":"Orange Is the New Yellow","summary":"\nMarge lets Bart go to the park alone because he\u0027s too irritating, then she ends up getting arrested for leaving him unsupervised.    ","episodeNumber":0,"rating":6.6}]},{"number":28,"episodes":[{"title":"Monty Burns\u0027 Fleeing Circus","summary":"\nMr. Burns puts on a variety show at the Springfield Bowl.    ","episodeNumber":0,"rating":6.1},{"title":"Friends and Family","summary":"\nHomer finds a new friend in a woman who acts just like him when Mr. Burns hires the other Simpsons as his live-in virtual reality family.    ","episodeNumber":0,"rating":6.6},{"title":"The Town","summary":"\nHomer takes the family on a \u0022hate-cation\u0022 to Boston after he catches Bart rooting for a rival football team.    ","episodeNumber":0,"rating":7.0},{"title":"Treehouse of Horror XXVII","summary":"\nThe children of Springfield fight to the death, Hunger Games style; Lisa\u0027s imaginary friend kills her real friends; Moe recruits Bart into his group of covert barfly agents.    ","episodeNumber":0,"rating":6.8},{"title":"Trust But Clarify","summary":"\nBart and Lisa investigate Krusty\u0027s new candy; Marge helps Homer dress for a promotion; Kent Brockman struggles with the changing media world.    ","episodeNumber":0,"rating":6.3},{"title":"There Will Be Buds","summary":"\nHomer coaches the kids\u0027 lacrosse team with Kirk Van Houten, who disappears before the championship game, after Homer rants about him being a loser.    ","episodeNumber":0,"rating":6.6},{"title":"Havana Wild Weekend","summary":"\nThe Simpsons go to Cuba to get Grampa cheap medical care when the Retirement Castle and V.A. hospital are unable to solve his health problems.    ","episodeNumber":0,"rating":6.2},{"title":"Dad Behavior","summary":"\nHomer discovers an app that makes his life easier, while Grampa learns that he\u0027ll be a father again.    ","episodeNumber":0,"rating":6.5},{"title":"The Last Traction Hero","summary":"\nHomer is placed in a cast following a workplace accident, leading Marge to receive romance from an unexpected source; Lisa attempts to keep the peace as bus monitor.    ","episodeNumber":0,"rating":6.3},{"title":"The Nightmare After Krustmas","summary":"\nKrusty and his daughter spend Christmas with the Simpsons; Reverend Lovejoy seeks converts to boost attendance at church; A Christmas toy scares Maggie.    ","episodeNumber":0,"rating":5.9},{"title":"Pork and Burns","summary":"\nA Japanese book on minimalism inspires Marge to adapt to a new way of living, so the Simpsons have to part with items that no longer bring them joy.    ","episodeNumber":0,"rating":6.7},{"title":"The Great Phatsby","summary":"\nMr Burns tries to relive his glory days, and crosses paths with a mysterious music mogul.    ","episodeNumber":0,"rating":6.1},{"title":"Fatzcarraldo","summary":"\nWhen all the fast food restaurants in Springfield become healthy, Homer turns to the last bastion of greasy food for comfort; Lisa must find a good news story when her school radio station is in jeopardy.    ","episodeNumber":0,"rating":6.3},{"title":"The Cad and the Hat","summary":"\nBart ruins Lisa\u0027s perfect day out of jealousy and becomes haunted by the manifestation of his guilty conscious. Homer is revealed to be a master chess player which helps him bond with his competitive dad.    ","episodeNumber":0,"rating":6.4},{"title":"Kamp Krustier","summary":"\nBart and Lisa return home following a traumatic incident at Kamp Krusty, putting an end to Homer and Marge\u0027s sexual encounters.    ","episodeNumber":0,"rating":6.5},{"title":"22 for 30","summary":"\nA mocumentary about how Bart became a star basketball player at Springfield Elementary only to fall prey to fame, his own ego and the schemes of mobster Fat Tony.    ","episodeNumber":0,"rating":6.5},{"title":"A Father\u0027s Watch","summary":"\nAs Homer and Marge try a different parenting style on the hellraising Bart, Grampa gives him a special watch that becomes Bart\u0027s moral center. But Bart loses it and tries everything to get it back.    ","episodeNumber":0,"rating":6.7},{"title":"The Caper Chase","summary":"\nMr. Burns opens his own for-profit university, hiring the completely unqualified Homer as a professor, only to lose him to a mad scientist.    ","episodeNumber":0,"rating":6.1},{"title":"Looking for Mr. Goodbart","summary":"\nBart bonds with Skinner\u0027s mother over their mutual dislike of Skinner and realizes that he could make a bundle by befriending other lonely and disgruntled grandmothers of Springfield for money.    ","episodeNumber":0,"rating":6.8},{"title":"Moho House","summary":"\nMr. Burns makes a bet with his old friend that nothing can break Homer and Marge apart. But that\u0027s where Moe comes in.    ","episodeNumber":0,"rating":6.1},{"title":"Dogtown","summary":"\nAfter a successful animal rights campaign, all dogs in Springfield are allowed to go where they want and do what they want. Pack mentality quickly kicks in and the dogs of Springfield assert their dominance by threatening the people.    ","episodeNumber":0,"rating":6.4}]},{"number":29,"episodes":[{"title":"The Serfsons","summary":"\nIn a medieval world, Lisa is forced to use illegal magic when Marge\u0027s mother is turned into an Ice Walker.    ","episodeNumber":0,"rating":6.8},{"title":"Springfield Splendor","summary":"\nLisa\u0027s sad experience is adapted into a graphic novel, which becomes a Broadway show.    ","episodeNumber":0,"rating":6.5},{"title":"Whistler\u0027s Father","summary":"\nHomer launches Maggie\u0027s baby-celebrity career with her whistling talent; Marge is hired to style Fat Tony\u0027s brothel.    ","episodeNumber":0,"rating":6.1},{"title":"Treehouse of Horror XXVIII","summary":"\nMaggie gets possessed by a demon; Lisa discovers a creepy/perfect version of her family in an alternative universe; Homer cannibalizes himself.    ","episodeNumber":0,"rating":7.1},{"title":"Grampy Can Ya Hear Me","summary":"\nGrampa gets a hearing aid and finally hears what everyone has been saying about him.    ","episodeNumber":0,"rating":6.4},{"title":"The Old Blue Mayor She Ain\u0027t What She Used To Be","summary":"\nMarge runs for mayor and uses Homer as the butt of her jokes to gain public support.    ","episodeNumber":0,"rating":6.3},{"title":"Singin\u0027 in the Lane","summary":"\nHomer gets his old bowling team back together and they wind up competing with arrogant millionaires.    ","episodeNumber":0,"rating":6.4},{"title":"Mr. Lisa\u0027s Opus","summary":"\nIn the future, Lisa writes a college application essay to Harvard and recalls disappointing past birthdays that helped shape her.    ","episodeNumber":0,"rating":6.8},{"title":"Gone Boy","summary":"\nWhen Bart goes missing, the town puts together a search party to find him.    ","episodeNumber":0,"rating":7.2},{"title":"Haw-Haw Land","summary":"\nLisa falls for a crooning jazz pianist named Brendan; Bart discovers he has an affinity for chemistry.    ","episodeNumber":0,"rating":6.5},{"title":"Frink Gets Testy","summary":"\nMr. Burns builds a doomsday ark after he believes the world is ending; Professor Frink is tasked with determining who is worth saving.    ","episodeNumber":0,"rating":6.2},{"title":"Homer is Where the Art Isn\u0027t","summary":"\nHomer is accused of stealing a multimillion-dollar painting and only freelance insurance investigator Manacek can prove his innocence or guilt.    ","episodeNumber":0,"rating":6.7},{"title":"3 Scenes Plus a Tag from a Marriage","summary":"\nHomer and Marge tell the story of how they went from loving life without kids to being miserable parents.    ","episodeNumber":0,"rating":6.6},{"title":"Fears of a Clown","summary":"\nBart goes to prankster rehab after a clown-mask prank terrifies the town and ruins Krusty\u0027s career causing him to give up comedy and try serious drama.    ","episodeNumber":0,"rating":6.0},{"title":"No Good Read Goes Unpunished","summary":"\nMarge forces everyone to give up their electronics and go to the book store in an effort to bring the family together.    ","episodeNumber":0,"rating":6.3},{"title":"King Leer","summary":"\nHomer and Marge attempt to reunite Moe with his troubled family.    ","episodeNumber":0,"rating":6.3},{"title":"Lisa Gets the Blues","summary":"\nThe Simpsons\u0027 flight to Gainesville gets re-routed to New Orleans, where Lisa must regain her confidence as a jazz musician.    ","episodeNumber":0,"rating":6.7},{"title":"Forgive and Regret","summary":"\nOn his deathbed, Grampa makes a confession to Homer about the notes from Homer\u0027s mother that got lost when she left. This angers Homer to the point of refusing to reconcile with Abe after he miraculously recovers.    ","episodeNumber":0,"rating":7.0},{"title":"Left Behind","summary":"\nHomer gets Flanders a job at the power plant; Marge feels there\u0027s no spark left in their marriage.    ","episodeNumber":0,"rating":6.6},{"title":"Throw Grampa from the Dane","summary":"\nThe Simpsons go to Denmark so Grampa can benefit from its free health-care system.    ","episodeNumber":0,"rating":6.7},{"title":"Flanders\u0027 Ladder","summary":"\nWhen Bart falls into a coma after he is struck by lightning, he is visited by ghosts seeking closure.    ","episodeNumber":0,"rating":7.6}]},{"number":30,"episodes":[{"title":"Bart\u0027s Not Dead","summary":"\nBart ends up in the hospital after taking a dare and lies about going to heaven to cover it up, but Homer takes a deal with Christian producers to make a movie about it.    ","episodeNumber":0,"rating":6.3},{"title":"Heartbreak Hotel","summary":"\nMarge and Homer travel to a tropical island and go on Marge\u0027s favorite reality competition program to win a million dollars.    ","episodeNumber":0,"rating":6.1},{"title":"My Way or the Highway to Heaven","summary":"\nWhile God and St. Peter discuss who will get into heaven, the citizens of Springfield recall divine encounters.    ","episodeNumber":0,"rating":6.2},{"title":"Treehouse of Horror XXIX","summary":"\nHomer wins an oyster-eating contest against the mythical Cthulhu, Springfield is overrun by plant body-snatchers, Lisa finally snaps and Mr. Burns opens a retirement home with some Jurassic upgrades.    ","episodeNumber":0,"rating":6.0},{"title":"Baby You Can\u0027t Drive My Car","summary":"\nA self-driving car company comes to Springfield, poaching all of the power plant employees with their fun work environment.    ","episodeNumber":0,"rating":7.0},{"title":"From Russia Without Love","summary":"\nBart, Nelson and Milhouse get a mail-order bride for Moe as a hardcore prank.    ","episodeNumber":0,"rating":6.5},{"title":"Werking Mom","summary":"\nIn search of a job, Marge gets one selling plastic food storage containers - as a drag queen; Lisa tries to make the world better.    ","episodeNumber":0,"rating":5.8},{"title":"Krusty the Clown","summary":"\nKrusty hides out at a circus after he nearly kills Homer, who becomes a TV recapper and gives him a bad grade.    ","episodeNumber":0,"rating":6.5},{"title":"Daddicus Finch","summary":"\nBart feels neglected when Homer and Lisa bond over To Kill a Mockingbird and start spending quality time together, so Marge attempts to help Homer balance attention between the kids.    ","episodeNumber":0,"rating":6.8},{"title":"\u0027Tis the 30th Season","summary":"\nMarge is determined to fix Christmas following a failed Black Friday shopping spree, but Homer and the kids surprise her with a vacation in Florida.    ","episodeNumber":0,"rating":6.7},{"title":"Mad About the Toy","summary":"\nMotivated by a PTSD episode Grampa had while babysitting the kids, the Simpsons take a journey to Grampa\u0027s past as a post-WW2 toy model for plastic army men, and Abe finally faces his on confused sexuality.    ","episodeNumber":0,"rating":5.9},{"title":"The Girl on the Bus","summary":"\nLisa tries to live a double life when she makes a new friend and gets a taste of what it would be like to live with a more cultured family.    ","episodeNumber":0,"rating":6.5},{"title":"I\u0027m Dancing as Fat as I Can","summary":"\nHomer tries to make amends for binging his and Marge\u0027s favorite show without her; Bart prepares for \u0022Krusty\u0027s Holiday Trample\u0022.    ","episodeNumber":0,"rating":6.8},{"title":"The Clown Stays in the Picture","summary":"\nOn Marc Maron\u0027s podcast, Krusty reveals the untold story of his past movie project, The Sands of Space. Hearing the podcast, Bart and Lisa learn their parents were production assistants on the movie in the early days of their relationship.    ","episodeNumber":0,"rating":6.2},{"title":"101 Mitigations","summary":"\nHomer steals Comic Book Guy\u0027s car and must either prove his innocence in court or reconcile with him.    ","episodeNumber":0,"rating":6.4},{"title":"I Want You (She\u0027s So Heavy)","summary":"\nWhen a romantic night ends in injury for Homer and Marge, Lisa turns to an unlikely source to fix their strained relationship.    ","episodeNumber":0,"rating":5.8},{"title":"E My Sports","summary":"\nHomer discovers a passion for coaching Bart in video game competitions; Lisa\u0027s plan to bring Homer back to reality creates chaos.    ","episodeNumber":0,"rating":6.4},{"title":"Bart vs. Itchy \u0026 Scratchy","summary":"\nBart\u0027s friends start a boys rights activist group to protest Krusty\u0027s all-female reboot of Itchy and Scratchy. When they catch Bart enjoying it, they kick him out, so he joins Bossy Riot, a militant feminist gang of sixth-grade girls.    ","episodeNumber":0,"rating":5.0},{"title":"Girl\u0027s in the Band","summary":"\nHomer works extra shifts at the plant so Lisa can play in the Capitol City Youth Philharmonic.    ","episodeNumber":0,"rating":6.4},{"title":"I\u0027m Just a Girl Who Can\u0027t Say D\u0027oh","summary":"\nMarge becomes Director of Springfield\u0027s local theater, armed with Lisa\u0027s script resembling \u0022Hamilton\u0022; Homer joins a baby class with Maggie, and takes a liking to supervisor Chloe.    ","episodeNumber":0,"rating":5.6},{"title":"D\u0027oh Canada","summary":"\nLisa is mistakenly given political asylum in Canada during a family trip to Niagara Falls.    ","episodeNumber":0,"rating":5.8},{"title":"Woo-Hoo Dunnit?","summary":"\nThe documentary crime series \u0022Dateline: Springfield\u0022 goes in-depth to solve the case of Lisa\u0027s missing college fund.    ","episodeNumber":0,"rating":6.2},{"title":"Crystal Blue-Haired Persuasion","summary":"\nMarge starts a business selling healing crystals and other New Age products to the naive mothers of Springfield when Homer\u0027s job cuts children\u0027s health-care benefits, leading Marge to use the crystals as a cheaper solution for Bart\u0027s ADD.    ","episodeNumber":0,"rating":6.1}]},{"number":31,"episodes":[{"title":"The Winter of Our Monetized Content","summary":"\nBart and Homer become social media celebrities when a video of them fighting goes viral; Lisa fights the school\u0027s new industrialized detention system.    ","episodeNumber":0,"rating":5.9},{"title":"Go Big or Go Homer","summary":"\nHomer inspires a 35-year-old millennial who idolizes him to start his own business, which leads the mob to chase both of them.    ","episodeNumber":0,"rating":5.9},{"title":"The Fat Blue Line","summary":"\nWhen the wrong man is arrested for pickpocketing Springfield during the San Castellaneta street festival, Chief Wiggum sets out to catch the real criminal.    ","episodeNumber":0,"rating":6.5},{"title":"Treehouse of Horror XXX","summary":"\nThe 30th Treehouse of Horror features a demon Maggie, a mission to rescue Milhouse from another dimension, dead-Homer\u0027s spirit trying on some new bodies for size and Selma finally finding love in an unlikely place - the alien in the basement.    ","episodeNumber":0,"rating":6.8},{"title":"Gorillas on the Mast","summary":"\nAfter visiting Aquatraz Water Park, Lisa and Bart set out to free from captivity the most vicious animals in Springfield. Homer fulfills a lifelong dream and buys a boat, only to realize how much boat ownership sucks.    ","episodeNumber":0,"rating":6.2},{"title":"Marge the Lumberjill","summary":"\nMarge becomes a competitive lumberjack and goes on a month-long retreat to Portland with her trainer, whom Homer fears will take his wife away from him.    ","episodeNumber":0,"rating":5.6},{"title":"Livin la Pura Vida","summary":"\nThe Simpsons join other Springfield families on the Van Houtens\u0027 annual trip to Costa Rica, where Homer befriends Patty\u0027s new girlfriend and Lisa discovers how the Van Houtens are able to afford this trip every year.    ","episodeNumber":0,"rating":6.5},{"title":"Thanksgiving of Horror","summary":"\nThe Simpsons face various Thanksgiving nightmares, including the first Thanksgiving, an A.I. mishap and a dangerous space mission complicated by a sentient cranberry sauce.    ","episodeNumber":0,"rating":7.3},{"title":"Todd, Todd, Why Hast Thou Forsaken Me?","summary":"\nTodd blames God for his mother\u0027s death and rejects his faith, so Ned sends him to live with the Simpsons, hoping they can scare him into believing in God again.    ","episodeNumber":0,"rating":6.5},{"title":"Bobby, It\u0027s Cold Outside","summary":"\nSideshow Bob gets the role of Santa Claus at Santa\u0027s Village amusement park. Meanwhile, someone is stealing all the Christmas packages off people\u0027s front porches.    ","episodeNumber":0,"rating":6.5},{"title":"Hail to the Teeth","summary":"\nHomer and Marge attend Artie Ziff\u0027s wedding and become quite uncomfortable when they realize that his bride-to-be is a clone of Marge.    ","episodeNumber":0,"rating":6.0},{"title":"The Miseducation of Lisa Simpson","summary":"\nThe sea captain finds treasure for which he\u0027s been searching for 40 years, but City Hall claims it since it was in city limits. Marge convinces the townspeople to use the windfall to build a STEM school. Homer crusades against automation.    ","episodeNumber":0,"rating":6.5},{"title":"Frinkcoin","summary":"\nProfessor Frink invents a cryptocurrency that makes him the richest man in Springfield, a title Mr. Burns has no intention of giving up.    ","episodeNumber":0,"rating":5.9},{"title":"Bart the Bad Guy","summary":"\nBart uses spoilers for a superhero movie he saw to get what he wants, but two movie executives will stop at nothing to keep his knowledge secret.    ","episodeNumber":0,"rating":7.2},{"title":"Screenless","summary":"\nMarge implements a limit on screen time for the whole family, only to realize she\u0027s the one addicted to screens.    ","episodeNumber":0,"rating":6.5},{"title":"Better Off Ned","summary":"\nJealous of Bart\u0027s bond with Ned, Homer mentors Nelson in retaliation, but an act of heroism helps Homer to regain Bart\u0027s respect.    ","episodeNumber":0,"rating":6.4},{"title":"Highway to Well","summary":"\nMarge gets a job at an upscale cannabis dispensary leading Homer to open a competing business that replicates the scuzzy days of scoring weed from and old-school pot connection.    ","episodeNumber":0,"rating":6.9},{"title":"The Incredible Lightness of Being a Baby","summary":"\nMaggie reunites with baby Hudson, but Marge isn\u0027t too crazy about his mom. Homer befriends Cletus Spuckler who recently discovered a vast underground reserve of helium gas on his property, attracting unwanted attention from Mr. Burns.    ","episodeNumber":0,"rating":6.3},{"title":"Warrin\u0027 Priests","summary":"\nReverend Lovejoy investigates the mysterious past of a new priest who\u0027s come to town and shaken things up at church.    ","episodeNumber":0,"rating":6.1},{"title":"Warrin\u0027 Priests Part 2","summary":"\nIn Michigan, Reverend Lovejoy learns the true reason why Bode came to Springfield and the congregation must decide whether to banish their new priest.    ","episodeNumber":0,"rating":5.8},{"title":"The Hateful Eight-Year-Olds","summary":"\nLisa joins a group of rich girls when she makes a friend who loves horses; Homer takes Marge on a romantic cruise.    ","episodeNumber":0,"rating":6.5},{"title":"The Way of the Dog","summary":"\nThe Simpsons explore the tragic past of Santa\u0027s Little Helper when he bites Marge.    ","episodeNumber":0,"rating":7.4}]},{"number":32,"episodes":[{"title":"Undercover Burns","summary":"\nMr. Burns goes undercover at the power plant as an employee named Fred and befriends Homer and the gang, but a jealous Smithers plots to bring the old Burns back.    ","episodeNumber":0,"rating":6.5},{"title":"I, Carumbus","summary":"\nAt a museum exhibit of Ancient Rome, Marge and Homer imagine themselves in Rome where Homer is more ambitious.    ","episodeNumber":0,"rating":6.8},{"title":"Now Museum, Now You Don\u0027t","summary":"\nLisa stays home from school and fantasizes about the history of Western art.    ","episodeNumber":0,"rating":5.8},{"title":"Treehouse of Horror XXXI","summary":"\nThe 31st annual Simpsons Halloween special includes a frightening look at the 2020 election, parodies of Pixar and Spider-Man: Into the Spider-Verse and a ninth birthday Lisa just can\u0027t get over.    ","episodeNumber":0,"rating":6.3},{"title":"The 7 Beer Itch","summary":"\nHomer is tempted by a British femme fatale while Marge and the kids are on a seaside vacation.    ","episodeNumber":0,"rating":5.7},{"title":"Podcast News","summary":"\nGrampa is accused of a crime, while Kent Brockman questions his career.    ","episodeNumber":0,"rating":6.7},{"title":"Three Dreams Denied","summary":"\nBart becomes a voice over actor, Comic Book Guy is humiliated at Comic-Con and Lisa is set up for a fall.    ","episodeNumber":0,"rating":6.3},{"title":"The Road to Cincinnati","summary":"\nSkinner and Chalmers take an 800-mile car ride to an administrator\u0027s convention in Cincinnati.    ","episodeNumber":0,"rating":6.6},{"title":"Sorry Not Sorry","summary":"\nLisa calls Ms. Hoover a hack and refuses to apologize, then learns her private pain.    ","episodeNumber":0,"rating":6.3},{"title":"A Springfield Summer Christmas for Christmas","summary":"\nA cable channel films a Christmas movie in Springfield and Skinner falls in love.    ","episodeNumber":0,"rating":6.3},{"title":"The Dad-Feelings Limited","summary":"\nThe origin story of Comic Book Guy is revealed as he and Kumiko debate having a baby.    ","episodeNumber":0,"rating":7.1},{"title":"Diary Queen","summary":"\nBart learns a surprising secret when he finds Mrs. Krabappel\u0027s diary at a yard sale, while Lisa discovers an even bigger surprise.    ","episodeNumber":0,"rating":6.9},{"title":"Wad Goals","summary":"\nBart becomes a successful caddy, but Marge thinks it may ruin his character.    ","episodeNumber":0,"rating":6.3},{"title":"Yokel Hero","summary":"\nCletus becomes a singing sensation and ruins everything when he turns on his fans, while Homer becomes a new man.    ","episodeNumber":0,"rating":5.6},{"title":"Do Pizza Bots Dream of Electric Guitars","summary":"\nHomer tries to reunite a mechanical band from his youth, but J.J. Abrams beats him to it.    ","episodeNumber":0,"rating":5.9},{"title":"Manger Things","summary":"\nA secret from Flanders\u0027 past and a never-before-seen room in the Simpson home are revealed.    ","episodeNumber":0,"rating":6.4},{"title":"Uncut Femmes","summary":"\nSarah Wiggum is more than she seems; Marge participates in a jewel heist.    ","episodeNumber":0,"rating":6.5},{"title":"Burger Kings","summary":"\nMr. Burns joins the plant-based burger business, convincing Lisa that he\u0027s changed for the better.    ","episodeNumber":0,"rating":6.7},{"title":"Panic on the Streets of Springfield","summary":"\nLisa\u0027s imaginary friend is a depressed British singer from the 1980s; Homer becomes a truck guy.    ","episodeNumber":0,"rating":6.3},{"title":"Mother and Child Reunion","summary":"\nIn the future, Lisa makes a shocking college decision that hurts Marge, leading to a surprising place.    ","episodeNumber":0,"rating":6.7},{"title":"The Man from G.R.A.M.P.A.","summary":"\nA British secret agent comes to Springfield to find a Russian spy.    ","episodeNumber":0,"rating":6.3},{"title":"The Last Barfighter","summary":"\nA secret society of bartenders seeks revenge on Homer and his friends when Moe breaks their most sacred rule.    ","episodeNumber":0,"rating":7.4}]},{"number":33,"episodes":[{"title":"The Star of the Backstage","summary":"\nMarge stages a revival of a musical from high school, but her pleasant memories are threatened by the return of her old rival.    ","episodeNumber":0,"rating":4.4},{"title":"Bart\u0027s in Jail!","summary":"\nWhen Grandpa falls victim to a phone scam, the Simpsons set out to get his money back.    ","episodeNumber":0,"rating":7.0},{"title":"Treehouse of Horror XXXII","summary":"\nThe 32nd annual Simpsons Halloween special includes a spoof of \u0022Parasite\u0022 and a segment where Bambi gets his revenge.    ","episodeNumber":0,"rating":6.7},{"title":"The Wayz We Were","summary":"\nMoe is faced with a difficult choice when Evergreen Terrace develops a traffic problem.    ","episodeNumber":0,"rating":6.8},{"title":"Lisa\u0027s Belly","summary":"\nLisa reacts to a hurtful word spoken by Marge while Bart gets swole.    ","episodeNumber":0,"rating":6.8},{"title":"A Serious Flanders","summary":"\nHomer and Ned get sucked into the violent world of prestige TV when a ruthless debt collector comes to Springfield.    ","episodeNumber":0,"rating":8.2},{"title":"A Serious Flanders: Part 2","summary":"\nThings go from bad to worse for Homer and Ned.    ","episodeNumber":0,"rating":8.2},{"title":"Portrait of a Lackey on Fire","summary":"\nSmithers finds true love with a famous fashion designer, but this new relationship may destroy Springfield.    ","episodeNumber":0,"rating":6.2},{"title":"Mothers and Other Strangers","summary":"\nIn a flashback to his teen years, Homer goes on a road trip with his father to search for his mother.    ","episodeNumber":0,"rating":6.3},{"title":"A Made Maggie","summary":"\nFat Tony becomes Maggie\u0027s godfather.    ","episodeNumber":0,"rating":6.9},{"title":"The Longest Marge","summary":"\nMarge battles Mr. Burns for the soul of a brash young football prodigy.    ","episodeNumber":0,"rating":5.8},{"title":"Pixelated and Afraid","summary":"\nHomer and Marge must push themselves to their limits when they get lost in an icy wilderness.    ","episodeNumber":0,"rating":7.7},{"title":"Boyz N the Highlands","summary":"\nBart, Martin and the bullies run for their lives when a weekend in the wilderness takes a dark turn.    ","episodeNumber":0,"rating":6.7},{"title":"You Won\u0027t Believe What This Episode Is About - Act Three Will Shock You!","summary":"\nHomer becomes a pariah when footage of him allegedly leaving Santa\u0027s Little Helper in a hot car goes viral.    ","episodeNumber":0,"rating":6.5},{"title":"Bart the Cool Kid","summary":"\nHomer leads a rebellion of loser dads against the friendship between Bart and a famous kid influencer.    ","episodeNumber":0,"rating":6.4},{"title":"Pretty Whittle Liar","summary":"\nCletus feels betrayed when he learns that Brandine can read.    ","episodeNumber":0,"rating":6.2},{"title":"The Sound of Bleeding Gums","summary":"\nLisa meets the son of the late Bleeding Gums Murphy and tries to improve his life.    ","episodeNumber":0,"rating":5.9},{"title":"My Octopus and a Teacher","summary":"\nBart has romantic feelings for his new teacher; Lisa befriends an octopus.    ","episodeNumber":0,"rating":6.5},{"title":"Girls Just Shauna Have Fun","summary":"\nLisa finds an unlikely mentor in Shauna Chalmers when she joins the high school marching band; Homer becomes a craft beer brewer.    ","episodeNumber":0,"rating":6.6},{"title":"Marge the Meanie","summary":"\nMarge bonds with Bart when she discovers a secret from her past, terrifying Homer.    ","episodeNumber":0,"rating":6.7},{"title":"Meat Is Murder","summary":"\nGrampa reconnects with an old associate in the hamburger business.    ","episodeNumber":0,"rating":6.0},{"title":"Poorhouse Rock","summary":"\nBart finally learns to admire Homer, but a visit from a magical singing janitor changes everything they thought they knew.    ","episodeNumber":0,"rating":5.8}]},{"number":34,"episodes":[{"title":"Habeas Tortoise","summary":"\nAfter humiliating himself at a town meeting, Homer looks for acceptance in an internet group on the hunt for a missing tortoise and finds something much more sinister.    ","episodeNumber":0,"rating":6.5},{"title":"One Angry Lisa","summary":"\nLisa gets called for jury duty, while Marge becomes obsessed with her exercise bike.    ","episodeNumber":0,"rating":6.3},{"title":"Lisa the Boy Scout","summary":"\nThe show is hijacked by cyber terrorists.    ","episodeNumber":0,"rating":6.6},{"title":"The King of Nice","summary":"\nMarge gets a job as a segment producer on Krusty\u0027s new talk show, which she soon realizes is a never-ending nightmare.    ","episodeNumber":0,"rating":6.5},{"title":"Not It","summary":"\nYoung Homer and his friends are terrorized by a killer clown in a special Treehouse of Horror presentation spoofing Stephen King\u0027s \u0022It\u0022.    ","episodeNumber":0,"rating":7.5},{"title":"Treehouse of Horror XXXIII","summary":"\nIn the 33rd annual Halloween special, Marge\u0027s resentment takes a monstrous form, Lisa tries to save the planet through murder, and Homer realizes that he\u0027s not the man he thought he was.    ","episodeNumber":0,"rating":8.3},{"title":"From Beer to Paternity","summary":"\nHomer and Duffman go on a road trip with Lisa that threatens to expose Homer\u0027s bad parenting after he becomes Duffman\u0027s girl-dad hero.    ","episodeNumber":0,"rating":6.4},{"title":"Step Brother from the Same Planet","summary":"\nHomer is filled with rage and resentment when Grampa becomes a stepfather to his girlfriend\u0027s son; Lisa and Bart throw the ultimate slumber party.    ","episodeNumber":0,"rating":6.4},{"title":"When Nelson Met Lisa","summary":"\nLisa and Nelson become an unlikely couple in the future.    ","episodeNumber":0,"rating":5.9},{"title":"Game Done Changed","summary":"\nBart ropes Principal Skinner into his scheme to make off a glitch in an online game; Marge and Maggie discover paradise.    ","episodeNumber":0,"rating":6.6},{"title":"Top Goon","summary":"\nMoe coaches Bart\u0027s hockey team and recruits the world\u0027s greatest brawlers to teach Nelson the art of hockey goonery.    ","episodeNumber":0,"rating":6.8},{"title":"My Life as a Vlog","summary":"\nThe rise and fall of the Simpson Family Vlog is told through a series of recommended YouTube videos.    ","episodeNumber":0,"rating":5.8},{"title":"The Many Saints of Springfield","summary":"\nNed goes into business with the Springfield mafia.    ","episodeNumber":0,"rating":6.5},{"title":"Carl Carlson Rides Again","summary":"\nCarl discovers the origins of a mysterious rodeo buckle tied to his identity when he\u0027s smitten with a beautiful black woman.    ","episodeNumber":0,"rating":6.1},{"title":"Bartless","summary":"\nHomer and Marge imagine a world where Bart isn\u0027t a Simpson after his latest prank causes chaos at Springfield Elementary.    ","episodeNumber":0,"rating":6.6},{"title":"Hostile Kirk Place","summary":"\nKirk goes on a crusade to censor and control the school curriculum in response to a history lesson that paints one of his ancestors in a bad light and Homer comes along for fun and profit.    ","episodeNumber":0,"rating":0},{"title":"Pin Gal","summary":"\nJacques returns to coach Marge for a bowling tournament.    ","episodeNumber":0,"rating":0},{"title":"Fan-ily Feud","summary":"\n  Know what this is about?\n Be the first one to add a plot.\n    ","episodeNumber":0,"rating":0},{"title":"Write Off This Episode","summary":"\n  Know what this is about?\n Be the first one to add a plot.\n    ","episodeNumber":0,"rating":0},{"title":"The Very Hungry Caterpillars","summary":"\n  Know what this is about?\n Be the first one to add a plot.\n    ","episodeNumber":0,"rating":0},{"title":"Clown V. Board of Education","summary":"\n  Know what this is about?\n Be the first one to add a plot.\n    ","episodeNumber":0,"rating":0},{"title":"Homer\u0027s Adventure Through the Windshield Glass","summary":"\n  Know what this is about?\n Be the first one to add a plot.\n    ","episodeNumber":0,"rating":0}]}]